[{"Author":"Peter Bogdanovich","Name":"Who the hells in it","Price":"17.90","Description":"From Lillian Gish to Jack Lemmon, Bogdanovich captures brilliantly--in their own words and in his--the work and styles of 26 fascinating Hollywood iconic actors and actresses. 120 photos in text.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Michael Deeley","Name":"Blade runners deer hunters and blowing the bloody doors off","Price":"15.90","Description":"One man links The Deer Hunter, Blade Runner, The Italian Job, Don t Look Now, The Wicker Man and The Man Who Fell To Earth. Producer Michael Deeley, an urbane Englishman in Hollywood, had to fight wars to get these movies made, from defending the legendary sex scene of Don t Look Now from a disapproving Warren Beatty to seizing control of Convoy from a cocaine- ridden Sam Peckinpah. This is a no-holds-barred look at the true stories behind some of the greatest cult movies ever made.\"","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"James Chapman","Name":"Licence to thrill","Price":"13.90","Description":"A cultural history of the most popular and enduring film series of all time. Chapman explores the origins of the Bond films in Fleming's novels, locates them in the spy thriller genre, discusses the Bond formula and places the suave British secret agent's adventures in cinema history and film culture.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Tove Jansson","Name":"Moomin: The Complete Tove Jansson Comic Strip, Book One","Price":"34.90","Description":"Tove Jansson is revered around the world as one of the foremost children's authors of the twentieth century for her illustrated chapter books regarding the magical worlds of her creation, the Moomins. The Moomins saw life in many forms but debuted to its biggest audience ever on the pages of the world's largest newspaper, the&nbsp;London Evening News,&nbsp;in 1954. The strip was syndicated in newspapers around the world with millions of readers in forty countries.&nbsp;Moomin Book One&nbsp;is the first volume of Drawn &amp; Quarterly's publishing plan to reprint the entire strip drawn by Jansson before she handed over the reins to her brother Lars in 1960. This is the first time the strip will be published in any form in North America and will deservedly place Jansson among the international cartooning greats of the last century.The Moomins are a tight-knit family-hippo-shaped creatures with easygoing and adventurous outlooks. Jansson's art is pared down and precise, yet able to compose beautiful portraits of ambling creatures in fields of flowers or on rock-strewn beaches that recall Jansson's Nordic roots. The comic strip reached out to adults with its gentle and droll sense of humor. Whimsical but with biting undertones, Jansson's observations of everyday life, including guests who overstay their welcome, modern art, movie stars, and high society, easily caught the attention of an international audience and still resonate today.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Ian Phillips","Name":"Lost and found","Price":"11.90","Description":"For pet owners everywhere, and for anyone who has ever stopped to read a lostpet poster, \"Lost\" is a heartwarming tribute. 90 illustrations.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Mark J Asher","Name":"Old Friends: Great Dogs on the Good Life","Price":"12.90","Description":"Old dogs know plenty of tricks for staying young at heart - and here they are! This humorous and loving collection of duotone portraits captures the golden years of humanity's best friends and most faithful companions.&nbsp;Sage and tender moments are caught on film and are paired with captions that reveal each dog's age and their secrets for a long and happy life, such as Tonto (12): \"Lift and pee, lift and pee, lift and pee on every tree,\" and Kelsey (11): \"Never let little dogs with bows in their hair get the best of you.\" These are dogs who know how to live life fully and recognize its priorities (like bacon). \"Old Friends\" is the perfect gift for dog owners and everyone who hopes to age gracefully in the canine spirit.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Timothy Corrigan","Name":"A short guide to writing about film","Price":"13.90","Description":"For courses in Film Criticism, Film History, Writing for Film, or Film Appreciation. A succinct guide to thinking critically and writing precisely about film Both an introduction to film study and a practical writing guide, this brief text introduces students to major film theories as well as film terminology, enabling them to write more thoughtfully and critically. With numerous student and professional examples, this engaging and practical guide progresses from taking notes and writing first drafts to creating polished essays and comprehensive research projects. Moving from movie reviews to theoretical and critical essays, the text demonstrates how an analysis of a film can become more subtle and rigorous as part of a compositional process.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Matthew Sweet","Name":"Shepperton Babylon","Price":"17.90","Description":"This is a wonderful secret history of British movies that includes the scandals, the suicides, the immolations and the contract killings - the product of thousands of conversations with veteran film-makers. Here you'll meet, among many others, 20s film idols snorting cocaine from an illuminated glass dance floor on the bank of the Thames, the model who escaped Soho's gangsters to become the queen of the nudie flicks, and the genteel Scottish comedienne who, at the age of fifty-five, reinvented herself as a star of exploitation cinema, and fondly remembers 'the one where I drilled in people's heads and ate their brains.' Welcome to the lost worlds of British cinema.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Ernesto Guevara","Name":"The Motorcycle Diaries","Price":"12.90","Description":"These travel diaries capture the essence and exuberance of the young legend, Che Guevara. This expanded, new edition, published with exclusive access to the Che Guevara Archives held in Havana, includes a preface by Che's daughter, Aleida Guevara. 30 photos.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Matthew Weinreb; Ben Weinreb","Name":"London: Portrait Of A City","Price":"9.90","Description":"Composed of a sequence of images punctuated by a series of essays which explore London through its architectural features and materials, this book focuses on both famous landmarks and lesser-known, anonymous buildings.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Chronicle Books LLC Staff","Name":"Prospero's Books Magic Symbols (Prospero's Library)","Price":"12.90","Description":"No description available","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Bruno Ernst","Name":"The Magic Mirror Of M.C. Escher","Price":"15.90","Description":"A study of the life and works of M.C. Escher. It shows many of the sketches, studies and diagrams which he made while creating his magical effects. His contribution to our understanding of perception and what we regard as possible or impossible is discussed and explained in this book.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Miranda Fellows","Name":"The Life And Works Of Escher","Price":"15.90","Description":"Fellows describes Esher and his work simply but beautifully.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Francesca Gavin","Name":"Street Renegades","Price":"17.90","Description":"Graffiti and street art have been at the heart of visual subcultures for the past thirty years. However, as time progresses the new wave of artists are moving in fresh directions. Corporate giants have been quick to jump on the graffiti bandwagon, perceiving it as a shortcut to youth culture. Even street stickers have been highjacked by the multinationals for advertising. Frustrated by wholesale corporate theft of the scene, the latest generation of street artists are employing different techniques in their work, different means of dissemination, different materials, different ways of getting their work noticed. Using the detritus of the urban environmentadvertising, fly-tipped rubbish, street signsthe new scene is subverting the streetscape in 3D to shock, educate, and entertain. This book documents the new graffiti with photographs of the work and interviews with major players around the world.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Trisha Ziff","Name":"Che Guevara revolutionary and icon","Price":"19.90","Description":"Ziff offers a revealing look at the incredibly varied ways a 1960s photo and Che Guevara have been appropriated. The image has become an ideal of abstraction, and this text vividly demonstrates the diverse ways in which it has been used.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Paul Jackson","Name":"Origami","Price":"13.90","Description":"Paul Jackson's complete origami course.&nbsp;","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"David Shipman","Name":"The story of cinema","Price":"21.90","Description":"First US edition. Book in very good condition; spine has no creases, binding is tight, pages are clean and bright. Illus. w b/w photos throughout. Cover shows minimal shelf wear.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"James Beck","Name":"Leonardos rules of painting","Price":"17.90","Description":"Interesting concept - tying principles from Leonardo's notebooks to images of modern art to show how well they work even across many centuries and many stylistic changes in creativity.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Herbert Read","Name":"A concise history of modern sculpture","Price":"17.90","Description":"Drawing on the knowledge of a lifetime of study, and the understanding of one who himself participated in the creative adventure of modern art, the late Sir Herbert Read traces the development of modern sculpture from Rodin to the present day and brings order into the apparently chaotic proliferation of styles and techniques during this period. 339 illus., 49 in color.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Peter Cowie","Name":"The cinema of Orson Welles","Price":"17.90","Description":"A superb and masterful analysis of Orson Welles films (up to the early 70s, as the book was written when Orson was still alive and active making films). The book treats Wellesians and cinema fans to detailed breakdowns of his movies, the longest being a in depth look at his first and greatest project Citizen Kane.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Lucien Edwards","Name":"The moustache growers guide","Price":"13.90","Description":"Whether it's a Handlebar, a Fu Manchu, or a Laser Loop, this illustrated guide will help men everywhere achieve the moustache of their dreams. Included are instructions for how to grow, groom, and maintain 30 classic and modern moustaches, as well as fashion advice on how to rock each look. Outdoorsy types can go wild with the Lumberjack and some flannel, while those aspiring to steampunk style should dress up the Aeronaut with a tuxedo or nautical gear. Fora dash of hipster irony, the Crustache or the Pyramid looks sharp with skinny jeans and glasses. With tons of illustrations and exclusive tips from professional competitors, The Moustache Grower's Guide will add major style to any 'stache.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Tony Thacker","Name":"Dream cars of the fifties","Price":"19.90","Description":"Tony Thacker's dream cars of the fifties","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Catherine Haill","Name":"Fun Without Vulgarity","Price":"19.90","Description":"Burgeoning Victorian leisure time created demand for a rich diversity of public entertainment, from Punch and Judy shows to lavish spectaculars in London theatres. This collection of posters from the Public Record Office archives reflects this diversity in style and content. Early, fussy designs groaning with text and ornament changed with French influence, creating a bold new art form combining fine art and popular culture.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Annettte Kuhn","Name":"Womens pictures","Price":"15.90","Description":"This pioneering and influential work of feminist theory has been extensively updated by the author to chart the changes in feminist film theory and practice between the eighties and the nineties. Readers, whether engaged in the making of films, the study of them, or simply the pleasure of viewing them, will appreciate the way in which the author discusses and demystifies the current methods of analysis, including semiotic and psychoanalytical approaches. The films used as points of discussion are drawn from both mainstream and alternative cinema, institutions which are themselves examined in relation to their production, distribution and exhibition practices. The thesis proposed by Annette Kuhn is an exciting one: namely, that feminism and cinema, taken together, could provide the basis for new forms of expression, providing the opportunity for a truly feminist alternative cinema in terms of film language, of reading that language and of representing the world.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"David Lodge","Name":"The art of fiction","Price":"11.90","Description":"From Jane Austen to Paul Auster, irony to magical realism, the novelist's art is revealed in an entertaining and enlightening book for readers and writers--from the author of Nice Work. Here are 50 of David Lodge's articles from the acclaimed series that engaged and delighted readers of The Washington Post and the London Independent.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Klaus Honnef","Name":"Warhol","Price":"14.90","Description":"A critical observer of American society&nbsp;Andy Warhol&nbsp;(1928вЂ“1987) is recognized today as the&nbsp;most important exponent of the Pop Art movement. He overturned the traditional understanding of art and placed in its stead a concept that retracts the individuality of the artist.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Ken Russell","Name":"Fire over England","Price":"17.90","Description":"Providing an analysis of British cinema, this book attempts to challenge and offer new insights into the cinema artform of the 20th century. The author examines the Ealing comedy and the Gainsborough romantic historical pastoral in such pictures as \"Passport to Pimlico\".","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Angelika Taschen","Name":"London Restaurants &amp; More","Price":"20.90","Description":"English food is much more varied than fish 'n' chips (though we can tell you where to get the best London has to offer). Indeed, England's capital city is home to a dizzying array of culinary options and of course Angelika Taschen has selected the finest London eateries where you'll delight in a meal, tea, or simply hobnobbing with the jet-set. Highlights of this book include descriptions of: The Golden Hind with its art deco interior and delectable fish 'n' chips - a fixture on Marylebone Lane since 1914; The Wolseley, classic grand cafe and perfect place for afternoon tea and scones; the same classic British cooking as Charles Dickens once did at the city's oldest restaurant, Rules; London's first gastropub, The Eagle; La Fromagerie, a cheese Mecca and delicatessen with fresh groceries; celebrity chef Jamie Oliver's restaurant, Fifteen. Special features of this book include: exclusive hand-illustrated cover; exclusive hand-illustrated map for each area; information such as opening hours, history, and signature dishes; hand-illustrated tear-out postcard; and, softcover with a sturdy PVC jacket.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Katherine Higgins","Name":"Collecting the 1970s","Price":"19.90","Description":"Miller's Collecting the 1970s (Miller's Collectables Handbook)","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Herbert Read","Name":"Modern sculpture","Price":"17.90","Description":"Drawing on the knowledge of a lifetime of study, and the understanding of one who himself participated in the creative adventure of modern art, the late Sir Herbert Read traces the development of modern sculpture from Rodin to the present day and brings order into the apparently chaotic proliferation of styles and techniques during this period. 339 illus., 49 in color.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Madeleine Marsh","Name":"Gp - Miller's Collecting The 1960","Price":"22.90","Description":"No description available","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Andrea Weiss","Name":"Vampires and violets","Price":"19.90","Description":"A revelatory survey of lesbian identity in film--from the crossdressing stars like Garbo, Dietrich, and Hepburn to the vampire movies of the late '60s, Silkwood and The Color Purple. With wit and political acumen, Weiss reveals the concealed world of a host of movies both popular and forgotten. 160 photos.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Alun Evans","Name":"Brasseys guide to war films","Price":"17.90","Description":"Comprises alphabetically arranged entries on over two thousand films set in every period from Ancient Greece to the Gulf War. Lists the date, director, cinematographer, original book and actors with a brief description and appreciation.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Julie Hollings","Name":"Modern Art: A Graphic Guide (Graphic guides)","Price":"11.90","Description":"No description available","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Jim Smith","Name":"Gangster films","Price":"15.90","Description":"Giving a detailed analysis of over 20 films including 'The Racket', 'Big Sleep', 'Brighton Rock', 'Goodfellas', 'Sexy Beast', 'Pulp Fiction', 'Get Carter' and 'Angels with Dirty Faces', this is an essential guide to gangsters through the ages on the big screen.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"M C Escher","Name":"The graphic work","Price":"19.90","Description":"Twisted mind: The graphic pattern genius of M. C. EscherFrom impossible staircases to tesselated birds, Dutch artist M. C. Escher (1898 1972) crafted a unique graphic language of patterns, puzzles, and mathematics. Dense, complex, and structured by intricate principles, his work is at the same time decorative and playful, toying constantly with optic illusions and the limitations of sensory perception. For mathematicians and scientists, Escher is a mastermind. For hippies, he was the pioneer of psychedelic art.Born in Leeuwarden, in the Netherlands in 1898, Escher s early works focused on nature and landscapes, with regular exhibitions in Holland, and some international recognition.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Daniel Tatarsky","Name":"Eagle Annual: The Best of the 1960s Comic","Price":"21.90","Description":"From Dan Dare, Pilot of the Future, to Jeff Arnold in \"Riders of the Range,\" \"The Eagle\" carried some of Britain's most popular strips from its launch right through to the sixties. This cool collection fits right into the current vogue for \"retro-futurism,\" and features the strips as well as individual drawings and artwork, original advertisements, and a present-day narrative that will appeal to contemporary boys, lads, and dads.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Everard","Name":"Wild flowers of the world","Price":"18.90","Description":"This book is an essential guide for experts and amateurs alike in identifying more than 1000 of the worlds exotic and colorful plants. It describes and illustrates the wild flowers of many regions of the world including: Europe, The Arctic and Antarctic, The Middle East, China, North America and more. The vast number of known plants is estimated at a quarter of a million species. Wild Flowers of the World provides a sampling of these on a regional basis.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"E. O. Parrott","Name":"How to Be Tremendously Tuned in to Opera","Price":"9.90","Description":"An introduction to the opera, including precis of the most famous plots, biographies of leading opera stars, and guides to different styles of production.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Peter Cowie","Name":"The Godfather Book","Price":"19.90","Description":"The story of the evolution of Francis Ford Coppola's trilogy of gangster films which began with \"The Godfather\" in 1972. Peter Cowie's account is based on access to Coppola's archives, and also interviews with him and other relevant people.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Hugh Honour","Name":"The penguin dictionary of decorative arts","Price":"19.90","Description":"With almost 5000 entries and more than 1000 illustrations, this dictionary provides a concise guide to the decorative arts of the West from the middle ages to the present day. Though mainly concerned with the furniture and furnishings of the European and North American private house, it also includes accounts of Chinese and Japanese pottery and porcelain, Peruvian pottery, Islamic metalwork and pottery, Turkish, Persian and other oriental carpets and many other objects which have influenced the development of the decorative arts in the West. John Fleming has contributed to \"Robert Adam and His Circle in Edinburgh and Rome\", \"The Penguin Dictionary of Architecture\" and \"A World History of Arto\". Hugh Honour has published \"Chinoiserie\", \"The Companion Guide to Venice\", \"Neo Classicism\" and \"Romanticism\".","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Trish Davies","Name":"70 Classic Recipes from Bulgaria, Romania, Croatia &amp; Slovenia","Price":"13.90","Description":"The outstanding volume on the classic cooking of the Balkan region presents a definitive collection of recipes from this fascinating area. Seafood, summer fruits and vegetables are transformed with fresh herbs and spices into piquant dishes with subtle inter-regional variations of tastes and textures.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Charlotte Fiell","Name":"Graphic Design for the 21st Century: 100 of the World's Best Graphic Designers","Price":"13.90","Description":"Covering a vast range of cutting-edge graphics, with politically charged anti-commercial work placed in the same context as Nike's latest ads, this book presents a sweeping look at today's most progressive graphic currents - from signage at packaging to branding and web design.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Neil Sinyard","Name":"The films of Woody Allen","Price":"19.90","Description":"A book about the films of Woody Allen&nbsp;","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Gretchen LeMaistre","Name":"Porn For Women Of A Certain Age","Price":"11.90","Description":"Appealing to the desires of women of a certain age, these steamy scenarios show hunky yet distinguished men catering to a woman's every whim, from insisting she take an early retirement to taking over the cooking and cleaning. 40 color photos.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Hill Tim","Name":"Images Of The Beatles","Price":"19.90","Description":"This book is pictures of the Beatles starting back in 1960 and goes to 2004.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"D. Ealy","Name":"The Woman's Book Of Creativity","Price":"14.90","Description":"Ealy discusses the social attitudes that have obstructed women's creativity for years, providing simple activities, examples and explanations to illustrate and nurture the holistic, spiral process that is the hallmark of feminine creativity. Included are: Letting your dreams create for you Quieting the inner critic Learning to change your perception of reality Altering your sense of time Becoming more spontaneous Loving your creative self Learning to accept nurturance.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Charles R. Phillips","Name":"Colour For Life","Price":"12.90","Description":"Charles Phillips reveals hundreds of ways to use color in every aspect of your life to promote your physical and spiritual well-being- Colorful topics include how to combine colors for harmonious outfits, what the color of food tells us about its nutritional value, and ancient secrets of using colored gems, color-vitalized drinks, and colored light for healing.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Nils Jockel","Name":"Peter Bruegel's Tower Of Babel: The Builder With The Red Hat Adventures In Art Prestel","Price":"9.90","Description":"An examination of Bruegel's piece also looks at Antwerp in the sixteenth century and includes reproductions of other works on the subject","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Paul Simpson","Name":"The Rough Guide To Kids' Movies","Price":"9.90","Description":"Kids' Movies where do you start? There are hundreds of them out on video and DVD, and life (or at least, childhood) is too short to discover the gems, or to endure the dross. Which is where this Rough Guide comes in, reviewing the best kids' films across genres from action to fantasy to westerns, and telling you, crucially, if they're any good. The Rough Guide includes reviews of more than 250 kids' movies, celebrating recent hits such as Finding Nemo and Elf, as well as classics like The Wizard of Oz and lesser-known gems like Miyazaki's Kiki's Delivery Service. There is also full coverage of more than 100 grown up' movies, from James Bond to Jane Austen, which should divert and delight older kids. For each entry there is advice on content and suitablility the film, noting scenes or language which might disturb younger viewers or their parents!\"","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"R. Taylor; D. Taylor","Name":"Approaching Art And Design","Price":"11.90","Description":"The aim of this book is to provide a practical guide and resource for students taking A-level Art and Design. It identifies and explores key issues in art and design at this level, such as observation, response, analysis, recording, providing a guide to good practice and equipping students with the necessary basic skills and resources for the course. Divided into six sections, the book focuses specifically on art history/appreciation and drawing and gives attention to the attitudes, responses and approaches of the students, often given in the form of written testimonies. The book presents possibilities for ways forward rather than simply following the usual step-by-step approach and aims to help students see the parallels between their own work and the work of established and famous artists. There is a section devoted to the importance of studying and responding to the work of mature artists and the developments section illustrates how the student can make use of experiences to produce work in a variety of media and processes.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Whiteman","Name":"The English lakes","Price":"13.90","Description":"Beautiful and unspoiled, Britain's Lake District is the crown jewel in a land filled with scenic treasures. The variety of landscapes found in a mere thirty-five square miles simply takes the breath away. A spectacular photographic display captures the splendor and drama of these panoramas, filled with greenery and rolling hills that hug flowing waters. Along with the images, a revealing text describes the history, geography, traditions, and literary connections of this exceptional region.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Millers","Name":"Sci fi and fantasy collectibles","Price":"19.90","Description":"Following an introduction to the subject of collecting sci-fi and fantasy and a timeline of the key events in the development of the genre and interest in the subject, the book is then divided into the main types of collectible, such as comics and annuals, movie posters and ephemera.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Monique Beudert; Sean Rainbird","Name":"Contemporary Art: The Janet Wolfson De Botton Gift","Price":"13.90","Description":"In October 1996 the Tate Gallery announced the gift by Janet Wolfson de Botton of sixty works of contemporary art. The Gallery has not received a gift of this size and importance for over twenty-five years. Janet de Botton began collecting contemporary art in the 1970s and she pursued a policy of acquiring the best art available. Included in her gift are paintings, drawings, sculptures and photographs by thirty artists, mostly American and British, whose works span several decades from the 1960s to the early 1990s. This catalogue is published to accompany an exhibition of the gift at the Tate Gallery, the first time a substantial amount of Janet de Botton's collection will be seen together by the public. With an introduction by Monique Beudert, this catalogue also includes interviews with nine of the artists represented in the de Botton gift.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Dick Jude","Name":"Fantasy Art","Price":"19.90","Description":"The brightest talents in fantasy, horror, and science fiction art--including John Howe, Alan Lee, Steve Stone, and Jim Burns--present their favorite creations in show-and-tell interviews that reveal their inspirations and techniques in a variety of mediums. 120 illustrations, 100 in color.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Jack Vettriano","Name":"Jack Vettriano","Price":"29.90","Description":"Jack Vettriano emerged from the coal fields of Scotland, unknown and untutored, to become Scotland s most successful contemporary artist. Prints of his work outsell those of Van Gogh, Dali, and Monet, and his paintings have been acquired by celebrities around the world. This gorgeous monograph presents more than 30 new images, some earlier work never before seen, and a selection of the finest of Vettriano s previously published paintings.\"","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Helen Walters","Name":"200 % cotton: New T-Shirt Graphics","Price":"19.90","Description":"More than a cheap article of clothing, the T-shirt is a portable personal ad, its wearer declaring their political/musical/social affiliations for the world to see. Since the Sixties, the T-shirt has provided a forum for expression where anti-war slogans mixed with early counter-culture classics such as 'Keep on Truckin'', and tie-dye mingled with the debut of that hardy perennial, the tour T-shirt - album cover graphic on the front, venue details listed on the back.This book reflects the diverse and rich graphic culture that has arisen from the medium, considering its use in areas such as music, politics and fashion. Music has had a lasting relationship with the T-shirt, which has proved almost as enduring a medium for music-related graphic design as the album cover. Design companies such as Mo Wax, Intro, Stylorouge and Designers Republic have comprehensive back catalogues of cool T-shirts that not only reflect the spirit of a particular band but also the spirit of a particular time. Equally, however, politics and high fashion use the T-shirt as a medium for expressing a particular message.Katherine Hamnett famously used T-shirts to oppose Pershing missiles, while Greenpeace, Amnesty International and similar organizations highlight their causes through T-shirt graphics. Fashion designers such as Stella McCartney and Savage use memorable graphics on T-shirts as an integral part of their range, while T-shirts are also a core part of the business of surf and skateboard companies such as Mambo and Fuct. Equally, however, graphic designers such as Tom Hingston and Product 250 are expanding into creating designs specifically for T-shirts.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Introducting the Bulgarian Realists","Name":"Unknown","Price":"9.90","Description":"Introducing the Bulgarian RealistsHow to get to know the Bulgarian through their paintings?What do we need to know about a painter?What's in a name + classifying paintings.All this you can find in this book, full of interesting facts, images and a DVD on the back cover!Includes a DVD","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Caroline de Maigret","Name":"How to be Parisian","Price":"0","Description":"From four stunning and accomplished French women--at last--a fresh and spirited take on what it really means to be a Parisienne: how they dress, entertain, have fun and attempt to behave themselves.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Reed Darmon","Name":"Made in Japan","Price":"0","Description":"Made in Japanthese three simple words conjure playful wit, a delight in detail, formal elegance, and graphic energy. Author of \"Made in China,\" Reed Darmon has collected hundreds of images of everyday Japanese design and pop culture ephemera from the past century. Including perfume ads, art deco matchboxes, robot toys, action movie posters, Noh masks, kimono patters, sumo cards, children's books, household product packages, and much more, the fascinating objects assembled here reveal traditional Japanese artistry and techniques as applied to playfully modern design.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Guy Phelps","Name":"The cinema as art","Price":"0","Description":"'The Cinema as Art'.to those brought up on the movie show and bubble gum image, must look like a pretentious contradiction in terms.As this book demonstrates, however, the cinema stands for an art form which is almost unique in immediacy and scope. The authors explain, with over 300 examples taken from films of every country and period, the stages by which a director isolates what is mentally and emotionally significant in a situation.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Yann Arthus-Bertrand","Name":"The earth from the air 365 days","Price":"0","Description":"Yann-Arthus Bertrand's photographic daybook features over 200 completely new photographs. Each image is accompanied on its facing page by a thoughtful and thorough explanatory text. The images reach across the continents, from the icebergs of Antarctica to the cotton fields of India to the olive plantations of Spain. All 12 chapters of the book open with a thoughtful introduction by one of several noted authors who address a wide variety of subjects critical to the present and future health of our planet: agriculture, biodiversity, sustainable development, energy, forests, fresh water, seas, global warming. The book thus offers us a new perspective on our spectacular but fragile environment.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Jan Udris","Name":"Studying Film","Price":"0","Description":"Studying Film is an all-encompassing guide to cinema and film which explores the key concepts, terms and events that have shaped film study and criticism, all of which is illustrated by reference to classic and contemporary movies from around the world, from The Great Train Robbery to Pulp Fiction via Un Chien Andalou and Cinema Paradiso. This accessible introduction to the study of film aims to stimulate students' enjoyment and understanding of a wide range of different types of film, and to give them an awareness of the nature of cinema as a medium, as an art form, and as a social and economic institution. Contemporary film is seen in context by tracing its development from 1895 to the present, exploring film production in a variety of countries in a range of styles, and placing film next to other media.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Irving Stone","Name":"Lust for life","Price":"0","Description":"No artist has been more ruthlessly driven by his creative urge, nor more isolated by it from most ordinary sources of human happiness, than Vincent Van Gogh. A painter of genius, his life was an incessant struggle against poverty, discouragement, madness and despair. Lust for Life skilfully captures the exciting atmosphere of the Paris of the Post-Impressionists and reconstructs with great insight the development of Van Gogh's art. The painter is brought to life not only as an artist but as a personality and this account of his violent, vivid and tormented life is a novel of rare compassion and vitality.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Bodhi Oser","Name":"Fuck this book","Price":"0","Description":"Juvenile, profane, and timeless, this book collects the images of real public signs that have been mischievously altered by stickers bearing the most expressive of all four-letter words. 150 color photos.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"David Britt","Name":"Modern art","Price":"0","Description":"An introduction to modern art which covers most developments in the visual arts in the last hundred years. The texts written by art historians are up-to-date in approach and are supplemented by chronologies and bibliographies. Includes a gallery of 20th century art with an informed survey of the period.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Sladen and Yedgar","Name":"Panic Attack","Price":"0","Description":"This edited work offers a vibrant and powerful visual account of an exciting, innovative period in British and American art. It features the work of 30 leading artists, among them Gilbert &amp; George, Nan Goldin, Derek Jarman and Robert Mapplethorpe.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Mark Kermode","Name":"Its only a movie","Price":"0","Description":"In \"It's Only a Movie,\" the incomparable Mark Kermode takes us into the weird world of a life lived in widescreen. Join him as he gets lost in Russia on the trail of a low-budget horror flick, gasp as he's shot at in Hollywood while interviewing Bavarian director Werner Herzog, cheer as he gets thrown out of the Cannes film festival for heckling in very bad French, and cringe as he's handbagged by Helen Mirren at London's glitzy BAFTA Awards. Written with sardonic wit and wry good humour, this compelling cinematic memoir is genuinely 'inspired by real events'.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Susannah Handley","Name":"Nylon","Price":"0","Description":"Beginning in a test tube and ending on the catwalk, Nylon brings together social history and the story of fashion.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Nikolaus Pevsner","Name":"The sources of modern architecture and design","Price":"0","Description":"\"No one but Dr Pevsner could have packed so much information into so compact a work or illustrated it more effectively.\" The Times Literary Supplement","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Jessica Lack","Name":"The Tate guide to modern art","Price":"0","Description":"How many times have you read the caption next to a work of art in a museum or gallery, or a review of an exhibition, and found yourself none the wiser? The language in which modern art is described can be even more mystifying than the art itself. Now, a fully updated and expanded edition of the acclaimed \"Tate Guide to Modern Art Terms \"offers a clear and reliable guide, with more than 450 pithy entries on the full range of international modern and contemporary art. Drawing on the expertise of Tate, the book provides an authoritative and up-to-date resource, small enough to fit into a bag or pocket. Spanning the dawn of Impressionism to the digital age, every term whether a theme, movement, medium, or technique is defined with clarity and precision. This is the perfect companion for all those wanting to increase their understanding and appreciation of modern and contemporary art. \"","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"David Shipman","Name":"Cinema the first hundred years","Price":"0","Description":"In 1893 Thomas Alva Edison built the first film studio, a hut on a pivot which could be rotated to follow the sun. The first film came later the same year, when a camera caught one of Edison's assistants mid-sneeze. From inauspicious, low-budget start has grown a medium that has influenced world history as powerfully as history has influenced it. In \"Cinema: The First Hundred Years\", David Shipman takes a year-by-year look at cinema's phenomenal growth. He describes the best - and worst - films from each year, charts the rise and fall of the stars, and records the staggering technical developments. He shows, too, how the century's films reflect our attitudes towards sex, religion, politics and racism.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Herbert Read","Name":"A concise history of modern painting","Price":"0","Description":"Comprehensive, authoritative, highly readable and generously illustrated, Herbert Read's text has been rightly acknowledged as \"by far the best introduction to the subject\" (Alan Bowness) and \"throughout, lively and closely packed\" (Hugh Casson). Here is modern painting from its roots in the work of Cezanne, through Cubism, Futurism, Surrealism and Dada in the early decades of the twentieth century and on to Abstract Expressionism in the 1950s. The works of Frank Stella, Richard Hamilton, Andy Warhol and Robert Rauschenberg, amongst many others, are discussed and analyzed by Caroline Tisdall and William Feaver in a lively final chapter that brings us up to present times and points to exciting new developments. 500 illus., 118 in color.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Bob Currie","Name":"Great British motorcyles of the fifties","Price":"0","Description":"Includes profiles of many British-made bikes such as the Norton Dominator 650SS, the Triumph T120 Bonneville and the BSA Bantam D14/4.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Joe Boyd","Name":"White Bicycles: Making Music in the 1960s","Price":"0","Description":"The essential memoir from legendary producer who knew Dylan, Nick Drake, Pink Floyd and many more","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Nobuo Honda","Name":"The contented cat","Price":"0","Description":"What is a contented cat? A cat that is sleeping, eating or just lolling in the sun.... This delightful book contains page after page of pictures so evocative you can almost hear the cats purr: Nobuo Honda's flawless photography captures the charm of these contemplative felines in beautiful full-color and black-and-white photographs.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Henri Stierlin","Name":"Greece: From Mycenae to the Parthenon","Price":"0","Description":"Setting out on the trial of Greek Architecture, this volume presents a comprehensive survey which extends beyond the borders of Greece itself to include southern Italy, Asia Minor and Persia. Fortifications, domed tombs, theatres, oracular sites, temples and palaces dating from the sixteenth to the fourth century B.C. are all set within their cultural and historical context, conveying a vivid impression of the architecture of Ancient Greece and its profound importance.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Tim Hill","Name":"The Beatles - Then there was music","Price":"0","Description":"With a day-by-day chronology from the earliest days of the Beatles through to the present day this is a full visual record of the Fab Four accompanied with authoritative text and features covering every aspect of the band.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Emma Dexter","Name":"Frida Kahlo","Price":"0","Description":"Frida Kahlo is regarded as one of the most significant artists of the twentieth century. Her tragic personal life has been the subject of numerous biographies and a major film starring Salma Hayek. In recent times, public interest in Kahlo's life has threatened to eclipse serious consideration of her artistic achievement. This beautifully produced publication presents an enlightening retrospective of her work, refocusing on the artistic qualities that have made her paintings some of the most iconic images of the last hundred years. Presenting major works alongside the lesser known, and incorporating paintings, drawings and photographs, the volume offers a thoroughly researched, accessible overview of her life's work. At the heart of the book, lavishly illustrated thematic sections illuminate the genres and themes which motivated her art, offering an ideal introductory survey, while also enabling those readers more familiar with her work to encounter some of her most famous pieces afresh. works, a chronology charts the dramatic events of her personal, artistic and political life is combined with an extensive, illustrated glossary explaining the symbolic background to certain key elements that recur in her paintings, making this an essential purchase for anyone with an interest in this most public and yet enigmatic of artists.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"E. Good","Name":"The Beatles the illustrated biography","Price":"0","Description":"An illustrated biography of The Beatles.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Hugh Honour","Name":"Cabinet Makers And Furniture Designers","Price":"0","Description":"This is the first in a series of three books on great craftsmen by Hugh Honour. It is made up of 50 absorbing studies of outstanding makers and designers of furniture, from the 16the century to the present day, and a quick glance at the contents page will reveal a gallery of highly illustrious names, including such leading figures as Chippendale, Sheraton, Boulle, Piranesi and Le Corbusier.The author aims not only to describe these men's ideas and the work in which they were expressed, but also to shed some light on their personalities, their lives, and their careers. He highlights the historical and artistic influences which have shaped the design of furniture through the centuries, and draws attention to the relationships that have existed in different periods and in different places between craftsmen, designers and workshops.He has selected French, English, American, Dutch, German and Scandinavian craftsmen, and demonstrates the wide range of people, from widely differing walks of life, who have contributed to the development of furniture design. The text is accompanied by photographs of some of the most outstanding pieces by the makers and designers in the book as well as by contemporary engravings and original drawings. 32 pages of colour illustrations 230 black and white illustrations","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Suzanne Bailey","Name":"Essential history of American art","Price":"0","Description":"American artists are among the most innovative and groundbreaking in the entire history of art. They have introduced new forms and styles and have helped to further push out the boundaries of artistic development.&nbsp;Written with a comprehensive introduction,&nbsp;Essential History of American Art&nbsp;looks in detail at the range of art that has been produced by American artists, with detailed commentary on 120 works. Some of these are considered the most important pieces; others may be less well known, but they are all essential to the development of American Art.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Michael Palin","Name":"Inside Himalaya","Price":"0","Description":"Following the success of&nbsp;Inside Sahara, photographer Basil Pao documents another of Michael Palin's unforgettable journeys, this time to the top of the world: the amazing, breathtaking Himalayas. The 300 resulting photographs provide a dramatic visual record of an extraordinary trip, and will be tied to a Travel Channel special program.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Igloo Books","Name":"The Beatles","Price":"0","Description":"The Beatles : Featuring intimate photographs, familiar publicity shots and a lively account of their career from the band's early days to their break-up, this book looks back at the story that is The Beatles. Alongside the year-by-year and album-by-album descriptions, there are also comprehensive guides to their singles and movies, as well as a whole host of surprising facts. Packed with information and stunning photographs, The Beatles is a worthy tribute to one of the greatest bands of all time.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Matt Groening","Name":"The Comic Book Guy's Book Of Pop Culture","Price":"0","Description":"The latest release from the best-selling Simpsons Library of Wisdom series. Resident of Springfield and owner of the Android's Dungeon &amp; Baseball Card Shop, the infamous Comic Book Guy spends his days at the comfort of his stool, patiently awaiting his next paying customer. The Comic Book guy embodies all the traits of your typical comic book shop owner, being tubby, and wearing his brown hair in a pony tail. He is also known for being extremely sarcastic.Being a sci-fi, comic and movie buff, the Comic Book Guy holds several prized collectibles: a rare copy of Mary Worth, in which Mary advises a friend to commit suicide, as well as his rare photo of Sean Connery, signed by Roger Moore. In some scenarios, the Comic Book Guy can be found sporting his alter-ego, \"The Collector\", a menacing superhero with the intention of finding the most sought-after collectible! (The Collector makes his first appearance in the Treehouse of Horror X Halloween special).","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Alan Aldridge","Name":"The Beatles: Illustrated Lyrics","Price":"0","Description":"This compilation of Beatles lyrics is a must for Beatles fans. The lavishly illustrated book revisits over 200 favorite songs and journeys through the poetic muses of a band that changed the way we look at music as well as ourselves. It is the ultimate tribute to the Beatles; the dazzling artwork - contributed by some of the greatest artists of our time - gives an enduring and captivating picture of the Fab Four\" s artistic influence through the decades and works as beautiful accompaniment to the songs. As the editor comments in the introduction, \" [this book is as] entertaining to the eye and the imagination as a Beatles album is to the ear.\" The magic remains","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Hans Silvester","Name":"Cats of the Greek Islands","Price":"0","Description":"Cats are ubiquitous in Greece's dazzling Cycladic Islands. Mykonos, Milos, Paros, Naxos and the other havens of legendary Mediterranean beauty are populated by cats of all types, sizes and colours. Living alongside the islanders, they are never allowed inside family homes, but are nonetheless welcomed as fellow inhabitants, rodent catchers and companions. Fed, cared for, but never pampered or tamed, they lead spontaneous, natural existences, whether sunning themselves, befriending fishermen, patrolling their territories or stalking their prey - part of the landscape, maintaining their wild autonomy whilst delighting and delighting in their human compatriots.The esteemed photographer Hans Silvester has devoted some three years to carefully tracking, observing and recording these charming creatures, penetrating their private world and capturing their attitudes in every situation and mood. The result is a celebration of a veritable paradise for cats. Born in Germany in 1938, Hans Silvester has toured the United States, Mexico, Egypt, Tunisia, Hungary, Italy and other locations throughout the world and has captured their scenic beauty in many photographic volumes.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Laurel Harper | Radical Graphics","Name":"Graphic Radicals","Price":"0","Description":"A unique profile of the landmark designers who broke the rules, fractured the grid, and set new standards for the world of graphic arts. Full color.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Julius Wiedermann","Name":"Japanese graphics now","Price":"0","Description":"Exploding with eye-popping originality and freshness, todayвЂ™s best Japanese graphics have been gathered together to make this must-have guide to contemporary aesthetics in Japan. With their unique perspective, the Japanese have a way of looking at the world that has long been a source of great interest for the Western mind.&nbsp;","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Yann Arthus-Bertrand","Name":"The earth from the air","Price":"0","Description":"How can we ensure sustainable development and preserve the Earth? The crisis facing the global population propelled Arthus-Bertrand on his mission to create a portrait of the world - both of its natural beauty and its precarious condition, including the impact of human civilization on the land.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Andy Warhol","Name":"Fashion","Price":"0","Description":"Before he found fame as the father of Pop Art, Andy Warhol was an accomplished advertising illustrator and commercial artist for fashion tastemakers such as Barney's, Neiman Marcus, I. Miller, Glamour, Mademoiselle and Harper's Bazaar. This delicately beautiful, colourfully playful and hugely influential fashion illustration work from the 1950s has never before been collected in a book. A pop object in itself, Warhol Fashion Drawings is a fun and gorgeous gallery of hundreds of his most delightful images. These witty drawings - fanciful shoes, chic hats, smart suits and perfect accessories to match - showcase his unique ability to find inspiration in the everyday and elevate the ordinary to the extraordinary. Sprinkled with Warhol's perceptively funny observations - 'When you think about it, department stores are kind of like museums' - Warhol Fashion Drawings is a must-buy book for anyone with style.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Steve Crist","Name":"The Polaroid book","Price":"0","Description":"In existence for over 50 years, the Polaroid CorporationвЂ™s photography collection is the greatest collection of Polaroid images in the world. Begun by Polaroid founder Edwin Land and photographer Ansel Adams, the collection now includes images by hundreds of photographers throughout the world and contains important pieces by artists such as David Hockney, Helmut Newton, Jeanloup Sieff, and Robert Rauschenberg.&nbsp;The Polaroid Book, a survey of this remarkable collection, pays tribute to a medium that defies the digital age and remains a favorite among artists for its quirky look and instantly gratifying, one-of-a-kind images.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Yann Arthus-Bertrand","Name":"6 Billion Others: Portraits of Humanity from Around the World","Price":"0","Description":"The latest project from bestselling photographer Yann Arthus-Bertrand,6 Billion Others&nbsp;presents the photographic portraits and transcribed responses of 500 men and women, interviewed on video over the past six years. This understated yet compelling look at ways of life both familiar and strange creates an instructive, affecting biography of modern humanity. Inspired by the idea that \"every single person has got something interesting to say, and every single person has the right to say it,\" Arthus-Bertrand created a questionnaire of 40 prompts on universal topics such as family, happiness, money, and love, and dispatched six filmmakers to interview more than 5,000 subjects in 75 countries around the world. About one-tenth of the resulting 3,500 hours of film is available online, with subtitles.","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Mega Manga","Name":"The Complete Reference to Drawing Manga","Price":"0","Description":"All the techniques you need to create great manga characters, with step-by-step drawings in pencil, ink, and color. Learn how to draw bodies and faces, eyes and hair, hands and feet, expressions, and gestures, across a range of human and fantasy creatures.Includes galleries of finished art to show you the full range of what you can achieve, including scores of hairstyles, facial expressions, hand gestures, and body poses for you to practice, and add variety to your work.&nbsp;Pages of clothing, accessories and gadgets, weapons and vehicles for you to draw and color and incorporate into your manga illustrations and stories, together with ideas for animals, including monsters and cute fantasy creatures, to help you build skill and confidence.by Keith Sparrow","Category":{"CategoryName":"Art, Architecture & Photography"}},{"Author":"Roger Hicks","Name":"Successful Black And White Photography: A Practical Handbook","Price":"0","Description":"Black and white photography possesses a unique ability to capture moods. Here are the latest advances in monochrome film, advice from world famous photographers, new developing processes, and information on buying equipment and materials. Master settings and filters and set up a darkroom.","Category":{"CategoryName":"Art, Architecture & Photography"}}]