[{"Author":"Janet Malcolm","Name":"The Silent Woman","Price":"13.90","Description":"This is a reasoned meditation on the art of biography, a work of criticism and literary detection and an examination of the means by which biographers justify their ends. The author takes as her example the various biographers of the poet Sylvia Plath and their conflicts with the Plath estate.This is not a book about the life of Sylvia Plath, but her afterlife: how her reputation was forged from the poems she wrote just before her suicide; how her estranged husband, the poet Ted Hughes, as executor of her estate, tried to serve two masters: her art and his own need for privacy; and how it fell to his sister, Olwyn Hughes, as literary agent for the estate, to protect him by limiting access to Plath's work; and how five biographers, variously thwarted in their attempts to give what they felt to be a true account of the life have turned much of the literary world against Ted and Olwyn Hughes","Category":{"CategoryName":"Biography"}},{"Author":"Ben Mezrich","Name":"Rigged","Price":"11.90","Description":"Rigged\"Rigged\" tells an incredible rags-to-riches story\r\nof David Russo, an Italian-American upstart from the streets of Brooklyn who\r\nclaws his way into the wild, frenetic world of the testosterone-laced warrens\r\nof the Merc Exchange, the asylum-like oil trading center located in lower\r\nManhattan where billions of dollars trade hands every week, a place where\r\nformer garbagemen become millionaires overnight and fistfights break out on the\r\ntrading floor. But the Merc is just the starting place of an adventure that\r\nleads David to private yachts in Monte Carlo, the gold-lined hotel palaces of\r\nDubai, and dangerous deals in the back alleys of Beijing. \"Rigged\"\r\ntells the true story of one man's adventure to revolutionize the oil trading\r\nindustry - and along with it, the world.","Category":{"CategoryName":"Biography"}},{"Author":"Dave Thompson","Name":"Beyond the Velvet Underground","Price":"18.90","Description":"The story of the legendary 60s cult group in the words of Lou Reed, John Cale, Nico, and more.","Category":{"CategoryName":"Biography"}},{"Author":"Dr Maya Angelou","Name":"Even The Stars Look Lonesome","Price":"12.90","Description":"There is no-one quite like Maya Angelou. Poet to the president, champion of the people, best-selling autobiographer, her experiences as dancer, singer, waitress, activist, director, teacher, wife and mother, have made her one of the few people truly qualified to share her lessons of a lifetime. With her customary courage and humour - and always with style and grace - she reflects on the people and places she has known. She talks about Africa and ageing, she gives us a profile of her great friend and 'daughter' Oprah Winfrey, she sings the praises of sensuality. But here too are her thoughts on the end of a much-wanted marriage, confessions of rage and the importance of solitude. EVEN THE STARS LOOK LONESOME is the work of a wonderful woman who is not afraid to admit to the mistakes and vulnerabilities that make us human. 'Impressive, charismatic, my heroine' Diane Abbott, MP","Category":{"CategoryName":"Biography"}},{"Author":"Susan Hill","Name":"Rolling Stones","Price":"22.90","Description":"Life in Pictures: The Rolling Stones charts the rise of the world's greatest Rock 'n' Roll band.","Category":{"CategoryName":"Biography"}},{"Author":"Craig Cabell","Name":"Terry Pratchett","Price":"12.90","Description":"Terry Pratchett is one of the most loved writers in the world. With worldwide sales of over 65 million copies in 37 languages, his novels are eagerly awaited by his legions of fans year after year. His first Discworld novel, The Colour of Magic, was released in 1983 and ever since then the series, with its whimsical heroes and fiendish foes, has delighted both young and old alike. In 2007 Pratchett announced that he had been diagnosed with Alzheimer's disease. He has courageously faced the disease head-on, equalling the determination of his characters in his vivid and satirical novels.","Category":{"CategoryName":"Biography"}},{"Author":"Isaac Newton","Name":"James Gleick","Price":"13.90","Description":"From one of the best writers on science, a remarkable portrait of Isaac Newton. The man who changed our understanding of the universe, of science, and of faith. Isaac Newton was the chief architect of the modern world. He answered the ancient philosophical riddles of light and motion; he effectively discovered gravity; he salvaged the terms 'time', 'space', 'motion' and 'place' from the haze of everyday language, standardized them and married them, each to the other, constructing an edifice that made knowledge a thing of substance: quantative and exact. Creation, Newton demonstrated, unfolds from simple rules, patterns iterated over unlimited distances.","Category":{"CategoryName":"Biography"}},{"Author":"Bruce Springsteen","Name":"Born to run","Price":"44.90","Description":"'Writing about yourself is a funny business...But in a project like this, the writer has made one promise, to show the reader his mind. In these pages, I've tried to do this.' -Bruce Springsteen, from the pages of Born to Run In 2009, Bruce Springsteen and the E Street Band performed at the Super Bowl's halftime show. The experience was so exhilarating that Bruce decided to write about it. That's how this extraordinary autobiography began.","Category":{"CategoryName":"Biography"}},{"Author":"John Chilton","Name":"Louis: the Louis Armstrong story","Price":"15.90","Description":"No description available","Category":{"CategoryName":"Biography"}},{"Author":"Barry Miles","Name":"William Burroughs: El hombre invisible","Price":"13.90","Description":"William Burroughs has influenced not just the literary world but the whole realm of popular culture. He invented the term \"heavy metal\", and was the inspiration behind bands as diverse as Steely Dan and Duran Duran. He was notorious for his homosexuality (among his lovers and long-term friends was the poet Allen Ginsberg) and his drug use, and for the bizarre killing of his wife in a notorious shooting accident in Mexico. His friends and benefactors include Andy Warhol, Paul McCartney, David Bowie, Mick Jagger and Lou Reed. But it is the shattering insight of his books that has made him one of the most controversial writers of the century. \"Naked Lunch\", his most famous book and now a major feature film, was burnt by British Customs. As a close friend of Burroughs, Barry Miles penetrates beneath the drug addict, the homosexual and the gun-toting icon to reveal the motives and techniques of this legendary figure.","Category":{"CategoryName":"Biography"}},{"Author":"Princess Chichibu","Name":"The Silver Drum","Price":"13.90","Description":"This is the story of a Japanese Princesss and is the first autobiography by a member of the Japanese Imperial family to be published in English.","Category":{"CategoryName":"Biography"}},{"Author":"Kumiko Kakehashi","Name":"Letters from Iwo Jima","Price":"12.90","Description":"Based on the letters that inspired Clint Eastwood's film LETTERS FROM IWO JIMA reveals the true story of the Battle of Iwo Jima, the subject of two films directed by Clint Eastwood. FLAGS OF OUR FATHERS tells the story of the US Marines who raised the flag above the island: the iconic image of the war with Japan. His other film, LETTERS FROM IWO JIMA tells the story from Japanese point of view. At the heart of the story is the maverick general Tadamichi Kuriyabashi, devoted family man, brilliant leader and the first man on the island to know they were all going to die.As Clint Eastwood comments, 'General Kuribayashi was a unique guy. He liked America. He thought it was a mistake to go to war. . America was too big an industrial complex.' Unlike most Japanese officers, he had travelled abroad, spent time in America, and was under no illusions as to the ultimate end. He fought and died to delay the Americans for as long as he could. He knew that once the island fell, it would be used as an airbase by US bombers to strike at Tokyo. His unorthodox methods made this the fiercest battle the US Marines have ever faced, and he sustained resistance far longer than anyone believed possible. Kumiko Kakehashi's heart-rending account is based on the letters written home by the doomed soldiers on the island, mostly family men, conscripted late in the war. She reveals a very different Japanese army from the popular image. It is an incredibly moving portrayal of men determined to resist to the last breath, despite their profound opposition to the regime that led them into war.","Category":{"CategoryName":"Biography"}},{"Author":"James Lincoln Collier","Name":"Louis Armstrong","Price":"13.90","Description":"Louis Armstrong. \"Satchmo.\" To millions of fans, he was just a great entertainer. But to jazz aficionados, he was one of the most important musicians of our times--not only a key figure in the history of jazz but a formative influence on all of 20th-century popular music. Set against the backdrop of New Orleans, Chicago, and New York during the \"jazz age,\" Collier re-creates the saga of an old-fashioned black man making it in a white world.He chronicles Armstrong's rise as a musician, his scrapes with the law, his relationships with four wives, and his frequent feuds with fellow musicians Earl Hines and Zutty Singleton. He also sheds new light on Armstrong's endless need for approval, his streak of jealousy, and perhaps most important, what some consider his betrayal of his gift as he opted for commercial success and stardom. A unique biography, knowledgeable, insightful, and packed with information, it ends with Armstrong's death in 1971 as one of the best-known figures in American entertainment.","Category":{"CategoryName":"Biography"}},{"Author":"Tim Flannery","Name":"The life and adventures of John Nicol mariner","Price":"12.90","Description":"In his many voyages, the Scottish-born sailor John Nicol (1755 - 1825) twice circumnavigated the globe, visiting every inhabited continent while participating in many of the greatest events of exploration and adventure of the eighteenth century. During his career Nicol battled pirates, traded with Native Americans, and fought for the British navy in the American and French revolutions. In Hawaii, he was entertained by the King's court mere days after the murder of Captain James Cook. In Jamaica, he saw firsthand the horrors of the slave system and befriended slaves who invited him to join in their dance celebrations. En route to Australia, he would meet the love of his life, Sarah Whitlam, a convict bound for the Botany Bay prison colony, who would bear his son before duty forced them apart forever. An international best-seller, The Life and Adventures of John Nicol, Mariner is a rousing memoir of an ordinary man's extraordinary life, a gripping true adventure tale. \"[Nicol has] made a lasting place for himself in the literature of the sea and ships he loved so deeply.\" -- Jonathan Yardley, The Washington Post","Category":{"CategoryName":"Biography"}},{"Author":"Martin Meredith","Name":"The state of Africa","Price":"13.90","Description":"After a long civil war in Rhodesia, Robert Mugabe came to power in Zimbabwe in 1980, and in this history of Mugabes rule, the author chronicles how Mugabe has become ever more dictatorial, and seemingly less and less interested in the welfare of his people, for this riveting and tragic political story.","Category":{"CategoryName":"Biography"}},{"Author":"David Starkey","Name":"Elizabeth","Price":"14.90","Description":"An abused child, yet confident of her destiny, passionately sexual yet, she said, a virgin, famed as England's most successful ruler yet actually doing little, Elizabeth I is full of contradictions. This biography, published to accompany a Channel 4 series presented by the author, aims to turn the paradox into a person. Starting with Elizabeth's own speeches and writings, the author lays emphasis on two things: her faith made her see religion as a purely personal relationship between the individual conscience and God, yet her sophisticated education led her to a smoke-and-mirrors view of politics, in which clever image-making and speech-writing could solve or postpone real problems.","Category":{"CategoryName":"Biography"}},{"Author":"Rayya Elias","Name":"Harley loco","Price":"12.90","Description":"'She's experienced wealth, cultural alienation, homelessness, brushes with fame, prison, rehab, record deals, a million blown second chances, a dozen broken hearts and one bloody-knuckled ultimate spiritual redemption. She even died once in the process, and may very well have had sex with your wife back in the eighties...' Elizabeth Gilbert When she was seven, Rayya Elias and her upper-class family fled the political conflict in their native Syria, settling in a suburb of Detroit. Bullied in school and caught between the world of her traditional family and her tough American classmates, she rebelled early. Rayya moved to New York City to become a musician and kept herself afloat with an uncommon talent for cutting hair. At the height of the punk movement, life on the Lower East Side was full of adventure, creative inspiration and temptation. Eventually though, Elias's passionate affairs with lovers of both sexes went awry, her (more than) occasional drug use turned to addiction and she found herself living on the streets - between visits to jail. Told with a keen sense of humour and a lack of self-pity in even the most harrowing situations, Harley Loco is a memoir about jumping in head-first, no questions asked. It's a book about living in the moment no matter what that might bring, and about pursuing, not always by choice, a life of extremes - highs and lows, pain and passion - until ultimately arriving at a place of contentment and peace.","Category":{"CategoryName":"Biography"}},{"Author":"Anton Chekhov","Name":"A journey to the end of the Russian empire","Price":"11.90","Description":"Overwhelmed by what he felt was the worthlessness of his great success as a writer, Chekhov (1860-1904) decided to leave everything behind him and go to the far reaches of Siberia - to the terrible Russian penal colony on Sakhalin Island. This book mixes his witty, charming letters back to friends on his long journey with his grim account of the reality of life in one of the worst places on earth. \"Great Journeys\" allows readers to travel both around the planet and back through the centuries - but also back into ideas and worlds frightening, ruthless and cruel in different ways from our own. Few reading experiences can begin to match that of engaging with writers who saw astounding things: great civilisations, walls of ice, violent and implacable jungles, deserts and mountains, multitudes of birds and flowers new to science. Reading these books is to see the world afresh, to rediscover a time when many cultures were quite strange to each other, where legends and stories were treated as facts and in which so much was still to be discovered.","Category":{"CategoryName":"Biography"}},{"Author":"Shirin Ebadi","Name":"Iran awakening","Price":"11.90","Description":"The moving, inspiring memoir of Shirin Ebadi, winner of the 2003 Nobel Peace Prize and advocate for the oppressed, offers a vivid picture of the struggles of one woman against the system.","Category":{"CategoryName":"Biography"}},{"Author":"Augusten Burroughs","Name":"Dry","Price":"12.90","Description":"You may not know it, but you've met Augusten Burroughs: You've seen him on the street, in bars, on the train, at restaurants: a twenty-something guy, nice suit, works in advertising. Regular. Ordinary. But when the ordinary person had two drinks, Augusten was circling the drain by having twelve; when the ordinary person went home at midnight, Augusten never went home at all. Loud, distracting ties, automated wake-up calls and aftershave on the tongue could only hide so much for so long. At the request (well, it wasn't really a request) of his employers, Augusten lands in rehab, where his dreams of group therapy with Robert Downey Jr. are immediately dashed by the grim reality of paper hospital slippers. But when he is forced to examine himself, something actually starts to click, and that's when he finds himself in the worst trouble of all. Because when his thirty days are up, he has to return to his same drunken Manhattan life - and live it sober. What follows is a memoir that's as moving as it is funny, as heartbreaking as it is real.","Category":{"CategoryName":"Biography"}},{"Author":"Ben Myers","Name":"The Clash","Price":"21.90","Description":"Cartoonist Ray Lowry reveals what it was like to be with The Clash night and day. In addition to his handwritten memories are his evocative cartoons which give a flavour of life on the road with Strummer, Jones, Simenon and Headon.","Category":{"CategoryName":"Biography"}},{"Author":"Jamie Oliver","Name":"Happy days","Price":"14.90","Description":"Jamie Oliver's no 1 bestseller, Happy Days with the Naked Chef Jamie is one of Britain's best-loved chefs who has made cooking interesting and accessible, not only for a new generation but for all those who love good food. He believes in getting the most out of ingredients and making tasty, easy, sociable food with the minimum of fuss. Like his first two books, Happy Days is filled with fantastic recipes for different occasions. By keeping it simple, it is perfect for those who want to give it a go in the kitchen. Happy Days with Naked Chef contains loads of classic, easy recipes like the fluffy pancakes USA style, Jamie Oliver's ultra-simple pukka pineapple with bashed-up mint sugar, and his old man's superb chicken. Genius. 'There is only one Jamie Oliver. Great to watch. Great to cook' Delia Smith 'Great, fabulous. Just enjoy yourself, get stuck in, happy days' Spectator Jamie Oliver's career started as a chef at the River Cafe, where he was quickly spotted by the television company that made him famous as The Naked Chef. He has since published a huge range of bestselling cookery books, including The Naked Chef, The Return of the Naked Chef, Jamie's Dinners, Jamie Does, Jamie's Ministry of Food, Jamie's Kitchen, Cook with Jamie, Jamie at Home, Jamie's Italy, Jamie's Great Britain, Jamie's 30 Minute Meals and Jamie's 15-Minute Meals.","Category":{"CategoryName":"Biography"}},{"Author":"Albin Zak","Name":"The Velvet Underground Companion: Four Decades Of Commentary","Price":"13.90","Description":"Eighth in the Schirmer Companion Series, the \"Velvet Underground Companion\" collects important articles, reviews, interviews, and essays on this influential, avante garde band.","Category":{"CategoryName":"Biography"}},{"Author":"Signed Book DREAMING OF JUPITER Ted Simon","Name":"Unknown","Price":"24.90","Description":"Signed Book DREAMING OF JUPITER Ted SimonOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Back in the seventies, Ted Simon drove a Triumph motorcycle around the world. His book, Jupiter's Travels, became the acknowledged classic of motorcycle adventure. It inspired thousands, Ewan McGregor included, to roam the globe. Now in his own seventies, thirty years after his epic journey began, Ted has retraced that epic journey, still on a bike, to rediscover himself, his world and the memorable characters he met. A remarkable perspective on the world today.Hardcover","Category":{"CategoryName":"Biography"}},{"Author":"Matt Kent","Name":"The Who Revealed","Price":"15.90","Description":"The quintessential Mod band, notorious for their theatricality and destructiveness on stage, The Who rate alongside the Beatles, Bob Dylan and the Rolling Stones as one of the most successful and innovative rock bands of the sixties and seventies, who captured the voice of youth. Following on from the successful Led Zeppelin Revealed and Pink Floyd Revealed, this new, glossy, visually stimulating coffee-table book covers all the major events in their 20-year career accompanied by revealing and evocative images.","Category":{"CategoryName":"Biography"}},{"Author":"Solomon Northup","Name":"12 years a slave","Price":"12.90","Description":"\"The retelling of Solomon Northup's true story is a valuable contribution to black history. Readers of all ages will enjoy . . . this important account.\" --Dr. Charles A. Hicks, former Arkansas state supervisor of education The best firsthand account of the slavery experience, this autobiographical story, originally published in 1853, has been rewritten to make it accessible to younger readers.Northup, a family man and hack driver in upstate New York, was kidnapped, whisked away from his home, and sold into slavery. His remarkable telling of the epic journey from free man of color to slave to free man again is even more astonishing because it was written entirely from memory. As a slave, Northup was permitted neither pen nor paper, yet he was able to recall his ordeal in exacting detail. Written for children aged nine through thirteen, this story of perseverance presents to children a personal side to the detached history of slavery.","Category":{"CategoryName":"Biography"}},{"Author":"Francoise Sagan","Name":"Dear Sarah Bernhardt","Price":"15.90","Description":"This experimental biography of the actress Sarah Bernhardt is structured in the form of a correspondence from the grave between the author and her subject. Francoise Sagan has also written the worldwide bestseller \"Bonjour Tristesse\" and \"Aimez-Vous Brahms\".","Category":{"CategoryName":"Biography"}},{"Author":"Bob Ortega","Name":"In Sam we trust","Price":"13.90","Description":"If bigger is better, Wal-Mart has rightfully won its leading position in the pantheon of international institutions. With more than 100 million customers a week, Wal-Mart is by far the world's largest retailer. It is the biggest private-sector employer in North America, and one of the most dominant and influential corporations anywhere. Sam Walton's company prides itself on being a paragon of service, integrity, and frugality to its customers. But all is not well in the many areas where people have been \"Wal-Martized\" and have faced Wal-Mart's controversial business practices.","Category":{"CategoryName":"Biography"}},{"Author":"Signed Book WHY NOT SAY WHAT HAPPENED Ivana Lowell","Name":"Unknown","Price":"24.90","Description":"Signed Book&nbsp;WHY NOT SAY WHAT HAPPENED Ivana LowellOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Born into one of the most celebrated Anglo-Irish families, the Guinnesses, Ivana Lowell grew up at the whim of two literary heavyweightsвЂ”her mother, writer Lady Caroline Blackwood, and stepfather, poet Robert Lowell.&nbsp;Now, with an incisive eye and a wicked sense of humor, she shares the stories weвЂ™ve always wanted to hear. She tells of following the famous authors from one crumbling, drafty country house to another, and of summers spent with madcap relatives such as her maternal grandmother, the Marchioness of Dufferin and Ava, and her вЂњold friend,вЂќ the Queen Mother. But Ivana also has darker stories to tell: about her childhood accident, about her own stints in rehab, and, finally, about discovering the secret Lady Caroline had successfully kept from Ivana her entire life.","Category":{"CategoryName":"Biography"}},{"Author":"Signed Book FATE AND CRAFT Aleksey Batalov","Name":"Unknown","Price":"39.90","Description":"Signed Book&nbsp;FATE AND CRAFT Aleksey Batalov&nbsp;Our signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.РќР°СЂРѕРґРЅС‹Р№ Р°СЂС‚РёСЃС‚ РЎРЎРЎР  РђР»РµРєСЃРµР№ Р’Р»Р°РґРёРјРёСЂРѕРІРёС‡ Р‘Р°С‚Р°Р»РѕРІ РІ СЃРІРѕРµР№ РєРЅРёРіРµ В«РЎСѓРґСЊР±Р° Рё СЂРµРјРµСЃР»РѕВ» РІРµРґРµС‚ СЂРµС‡СЊ РѕР± Р°РєС‚РµСЂСЃРєРѕРј РёСЃРєСѓСЃСЃС‚РІРµ вЂ” РІ РїСЂРѕС„РµСЃСЃРёРѕРЅР°Р»СЊРЅРѕРј Рё Р±РѕР»РµРµ С€РёСЂРѕРєРѕРј, РіСЂР°Р¶РґР°РЅСЃРєРѕРј СЃРјС‹СЃР»Рµ. РђРєС‚РµСЂ СЂР°Р·РјС‹С€Р»СЏРµС‚ Рѕ С‚РІРѕСЂС‡РµСЃС‚РІРµ РІ РєРёРЅРѕ, РґРµР»РёС‚СЃСЏ СЃРІРѕРёРј РѕРїС‹С‚РѕРј, СЂР°СЃСЃРєР°Р·С‹РІР°РµС‚ Рѕ С‚РѕРІР°СЂРёС‰Р°С… РїРѕ РёСЃРєСѓСЃСЃС‚РІСѓ, Рѕ СЂР°Р±РѕС‚Рµ РЅР° СЂР°РґРёРѕ.","Category":{"CategoryName":"Biography"}},{"Author":"Howard Marks","Name":"Senor Nice","Price":"11.90","Description":"The long-awaited and hugely-entertaining sequel to Mr. Nice. During the mid-1980s, Howard Marks had forty-three aliases, eighty-nine phone lines and companies trading throughout the world. At the height of his career he was smuggling consignments of up to fifty tons from Pakistan and Thailand to America and Canada. He was eventually busted and sentenced to twenty-five years in prison at Terre Haute Penitentiary, Indiana for marijuana smuggling.He was released in April 1995, after serving seven years. Senor Nice tells the story of what happened next. After release from prison, Marks changed careers: he wrote two best-selling books, became a sports and travel writer, stood as a parliamentary candidate, and embarked on a long-running sell-out series of one-man shows. While performing in his home town of Kenfig Hill, Wales, an elderly aunt told him of his outlaw ancestry: William Owen, the legendary Welsh smuggler (who had operated for some time in South America) and his great-great-grandfather Patrick McCarty, the half-brother of Billy the Kid, who had joined Butch Cassidy and the Sundance Kid in Patagonia.So, Marks decided to explore South America. His travels took him to Jamaica and Panama in the footsteps of the Welsh buccaneer Henry Morgan; to a search for obscure Welsh settlers in Brazil whom he never found; and a search among the thriving Welsh community in Patagonia for signs of Billy the Kid's half-brother. Richly comic and charged with the sense of adventure that induced this Oxford graduate to become the world's most notorious marijuana smuggler, Senor Nice is the hugely entertaining sequel to Mr. Nice. \"From the Hardcover edition.\"","Category":{"CategoryName":"Biography"}},{"Author":"Chris Ingham","Name":"The Rough Guide To &quot;The Beatles&quot;","Price":"11.90","Description":"\"The story, the songs, the solo years\"","Category":{"CategoryName":"Biography"}},{"Author":"Dr. Hunter S. Thompson","Name":"Better Than Sex: Confessions Of A Political Junkie, Trapped Like A Rat In Mr.Bill's Neighbourhood","Price":"11.90","Description":"\"Better than Sex\" is famed political analyst Hunter S. Thompson's groundbreaking and escapading saga of what happens to campaign junkies behind the scenes of a victorious American presidential campaign - their orgies, their despair, and finally their terror when they abandon all hope as the forces of darkness close in and make them prisoners in their own White House, where they cry out like doomed animals. As he does in such classics as \"Fear and Loathing on the Campaign Trail '72\", \"Hell's Angels\" and \"Fear and Loathing in Las Vegas\", Dr Thompson has again wandered into the savage vortex of political power","Category":{"CategoryName":"Biography"}},{"Author":"Pamela stevenson","Name":"Bravemouth","Price":"9.90","Description":"\"Billy, \" the biography of Britain s favorite iconoclast, gave millions of readers a fascinating insight into the personal and professional life of the genius that is Billy Connolly. Now, in this followup to her phenomenal bestseller, Pamela Stephenson celebrates life with the Scottish beastie as he hits the Big 6-0. Here we relive colorful and epic moments from Billy s early life in Glasgowthe background to an intimate portrait of his marriage with Pamela and their life in Scotland and Los Angeles. Witty and insightful, \"Bravemouth \"draws the reader into two very different worldshers of international sexology and the serious psychology of humorists, his of incontinence pants, being married to a shrink, and the finer points of banjo playing.\"","Category":{"CategoryName":"Biography"}},{"Author":"John Lyons","Name":"Chomsky","Price":"13.90","Description":"Chomsky's contribution to the study of language has, over the last four decades, been enormous, and has exerted a powerful influence throughout the other cognitive sciences. Language is, arguably, an even more distinctively human characteristic than intelligence, and the thousands of different human languages are, according to Chomsy, cut to the same general pattern. This pattern is determined, he claims, by innate structuring principles which only human beings possess. Chomsky's search for the universal in language has revitalized the question of the relationship between language and mind, and has provided a powerful new tool, generative grammar, for students of language.","Category":{"CategoryName":"Biography"}},{"Author":"Craig Goldman","Name":"Natural born fighters","Price":"11.90","Description":"Plunged into a brutal world that exists beyond the authority of any sporting body,&nbsp;Natural Born Fightersuncovers today's kings of underground combat. From bare-knuckle fights that take place in country lanes and inner-city building sites to bloody, raw gladiatorial cage fighting, you'll meet hard men, villains, gypsies, maybe even the bloke who lives next door to you. They're all connected by a common threadвЂ”they all love fighting, and they'll do anything to win.","Category":{"CategoryName":"Biography"}},{"Author":"Terry Jones","Name":"The Pythons Biography","Price":"29.90","Description":"Over 30 years ago, a group of five Englishmen and one wayward American, rewrote the rules of comedy on \"Monty Python's Flying Circus.\" This book is a unique look at arguably the most important comic team of the modern age, lavishly illustrated with 1000 photographs and illustrations.","Category":{"CategoryName":"Biography"}},{"Author":"Thomas Keneally","Name":"Lincoln","Price":"13.90","Description":"Most people know little more about the US President Abraham Lincoln than how he met his end - assassinated in a theatre box by a gunman. But as Thomas Keneally, Booker prizewinning novelist for Schindler's Ark, shows in this short, but enthralling life that Lincoln's origins, his early life, his self-taught lawyer's career and how he became a politician and ultimately US president, is an epitome of the American dream. If Lincoln - without any benefits of class, wealth or contacts - could reach the pinnacle of US life then so might anyone else. Keneally has long been absorbed by Lincoln's life and letters, upon which he draws for his biography.","Category":{"CategoryName":"Biography"}},{"Author":"Robert Sellers","Name":"Hollywood hellraisers","Price":"0","Description":"Robert Sellers traces the intertwining lives and careers of movie mavericks Brando, Hopper, Beatty and Nicholson in this remarkable follow-up to the acclaimed Hellraisers. \"I don't know what people expect when they meet me. They seem to be afraid that I'm going to piss in the potted palm and slap them on the ass.\" --Marlon Brando \"I should have been dead ten times over. I believe in miracles. It's an absolute miracle that I'm still around.\" --Dennis Hopper \"The best time to get married is noon.","Category":{"CategoryName":"Biography"}},{"Author":"Sean Smith","Name":"J K Rowling biography","Price":"0","Description":"J.K. Rowling's meteoric rise to worldwide superstardom and bestseller status is now the stuff of tabloid legend -- how she would spend hours in a cafГ© in Edinburgh, nursing a single coffee and a glass of water while she wrote the Harry Potter novel that would bring her fame and fortune.","Category":{"CategoryName":"Biography"}},{"Author":"Alex Haley","Name":"Roots","Price":"0","Description":"Alex Haley's grandmother used to tell him stories about their family back through the generations, all the way to a man she called \"the African\". She said he had lived across the ocean and had been out in the forest one day chopping wood when he was set upon by four men, beaten, chained and dragged aboard a slave ship bound for Colonial America. Haley began to search for documentation that might authenticate the narrative. The result is this two-century drama of Kunta Kinte and the six generations who came after him - slaves and freedmen, farmers and blacksmiths, lumbermill workers and Pullman porters, lawyers and architects - and one author.","Category":{"CategoryName":"Biography"}},{"Author":"Richard Gordon Smith","Name":"The Japan diaries","Price":"0","Description":"The diaries of Richard Gordon Smith, an Edwardian explorer, naturalist and sportsman, are a fascinating personal record of the forty years he spent traveling throughout the world. With an unbound sense of adventure and curiosity, his journeys took him from the wilds of Quebec, to the exotic beauty of Burma, Ceylon and Singapore to Shanghai Korea and finally Japan, a country for which he formed a lasting passion.","Category":{"CategoryName":"Biography"}},{"Author":"Irving Stone","Name":"Lust for life","Price":"0","Description":"No artist has been more ruthlessly driven by his creative urge, nor more isolated by it from most ordinary sources of human happiness, than Vincent Van Gogh. A painter of genius, his life was an incessant struggle against poverty, discouragement, madness and despair. Lust for Life skilfully captures the exciting atmosphere of the Paris of the Post-Impressionists and reconstructs with great insight the development of Van Gogh's art. The painter is brought to life not only as an artist but as a personality and this account of his violent, vivid and tormented life is a novel of rare compassion and vitality.","Category":{"CategoryName":"Biography"}},{"Author":"Christopher Hill","Name":"Gods englishman","Price":"0","Description":"A nuanced biography of Oliver Cromwell, breaking down Cromwell's life into different parts: fenland farmer and humble backbencher; stalwart of the good old cause and the New Model Army; key figure of the Commonwealth; and finally Lord Protector. Hill leads the reader unsentimentally through Cromwell's life from his beginnings in Huntingdonshire to his brutal end. Hill brings all his considerable knowledge of the period to bear on the relationships God's Englishman had with God and England. Such a detailed understanding of the workings of providence is vital to understanding Cromwell.","Category":{"CategoryName":"Biography"}},{"Author":"Clinton Heylin","Name":"Bob Dylan behind the shades","Price":"0","Description":"In virtually all areas of Dylan's life - his immigrant antecedents, his business dealings, his various addictions and his romantic attachments - Heylin is able to provide a fascinating picture of a man who changed the whole course of popular music in the sixties and, over thirty years later, won three Grammys. Heylin has given full weight to Dylan's own words and those of his closest associates, with over 250 people quoted in the book, helping to provide a portrait of a complex figure. Including 60,000 words of brand new material - dealing with Dylan's four twenty-first century albums; his archival audio-visual projects; his third film; his series of paintings and exhibitions; his autobiography, \"Chronicles\"; and his ongoing romantic liaisons and 'missing' marriages - this fully updated story of Dylan provides a monumental overview of the Man and his Music.","Category":{"CategoryName":"Biography"}},{"Author":"Maya Angelou","Name":"A song flung up to heaven","Price":"0","Description":"It is 1964 and Maya Angelou is on her way back home, leaving behind her beloved - and now seriously teenage - son Guy, to finish university in Ghana. America is pulsing with the challenge of change, the civil rights movement is in full swing and that's where Maya Angelou wants to be, working alongside her friends Malcolm X and Martin Luther King. In this marvellous account, Maya Angelou provides, with her customary wisdom, compassion and wit, a first-hand record of an extraordinarily exciting and tragic political period. She writes of 'Jimmy' Baldwin, Eldridge Cleaver, and of friends and family, and finishes with the beginnings of her career as one of America's most impressive memoir writers.","Category":{"CategoryName":"Biography"}},{"Author":"Feynman and Gleick","Name":"Genius","Price":"0","Description":"From the author of the national bestseller Chaos comes an outstanding biography of one of the most dazzling and flamboyant scientists of the 20th century that \"not only paints a highly attractive portrait of Feynman but also . . . makes for a stimulating adventure in the annals of science\" (The New York Times). 16 pages of photos.","Category":{"CategoryName":"Biography"}},{"Author":"Robert Sellers","Name":"Always look on the bright side of life","Price":"0","Description":"In 1978, George Harrison, the Monty Python team and American businessman Denis O'Brien formed HandMade films, which was responsible for such classics as \"Monty Python's Life of Brian\", \"Time Bandits\", \"The Long Good Friday\", \"A Private Function\", \"Mona Lisa\" and \"Withnail and I\". This book looks at the life and times of this film company. Robert Sellars has secured detailed and exclusive interviews with such diverse artists as Alan Bennett, John Cleese, Sean Connery and Richard E. Grant.","Category":{"CategoryName":"Biography"}},{"Author":"Vera Brittan","Name":"Testament of youth","Price":"0","Description":"Much of what we know and feel about the First World War we owe to Vera Brittain's elegiac yet unsparing book, which set a standard for memoirists from Martha Gellhorn to Lillian Hellman. Abandoning her studies at Oxford in 1915 to enlist as a nurse in the armed services, Brittain served in London, in Malta, and on the Western Front. By war's end she had lost virtually everyone she loved.&nbsp;Testament of Youth&nbsp;is both a record of what she lived through and an elegy for a vanished generation. Hailed by the&nbsp;Times Literary Supplement&nbsp;as a book that helped вЂњboth form and define the mood of its time,вЂќ it speaks to any generation that has been irrevocably changed by war.","Category":{"CategoryName":"Biography"}},{"Author":"Howard Marks","Name":"The Howard Marks' Book Of Dope Stories","Price":"0","Description":"Howard marks book of dope Stories will take you on an electrifying journey through the Discovery, consumption and trade of mind-altering Substances.&nbsp;","Category":{"CategoryName":"Biography"}},{"Author":"Hunter Davies","Name":"The Beatles","Price":"0","Description":"First published in 1968, Hunter Davies's intimate and revelatory book is still the only authorized biography of the world's most legendary and most influential pop group. This updated edition presents Davies's original book in a new, integrated illustrated format, and includes many rare photographs and illustrations. A revised introduction covers the 15 years since the last revised&nbsp;","Category":{"CategoryName":"Biography"}},{"Author":"Hugh Fearnley-Whittingstall","Name":"The River Cottage Year","Price":"0","Description":"In this new book, the follow-up to his bestselling River Cottage Cookbook, Hugh writes about the year on his Dorset smallholding. He recalls, month by month, the highs and lows of past years, and anticipates the 12 months ahead - what'll be in season when, and when'll be the best months to crack on with such tasks as chick rearing and sheep shearing, haymaking and hedge laying. But, for all its outdoorsy information, the real focus of THE RIVER COTTAGE YEAR is indoors - at Hugh's kitchen table.With over 100 brand new recipes, this is above all a cookery book and for once a genuinely seasonal one, celebrating local seasonal produce at its very best - chestnuts in January, artichokes in March, rhubarb in April, asparagus in May, strawberries in June, blackcurrants in July, tomatoes in August, plums in September, apples in October, pumpkins in November and parsnips in December...Full of his hard-earned smallholder's wisdom, seasoned with his infectious good humour, THE RIVER COTTAGE YEAR is Hugh's rallying cry for us to reclaim the seasons.","Category":{"CategoryName":"Biography"}},{"Author":"Mayank Chhaya","Name":"Dalai Lama","Price":"0","Description":"Written with the full cooperation of the Dalai Lama, this fascinating, up-to-date biography at once captures the public persona and enduring mystery behind one of the world's most important spiritual leaders. In 1997, the Indian journalist Mayank Chhaya was authorized by the Dalai Lama to write about his life and times. The only authorized biographer who is not a Buddhist, Chhaya conducted more than a dozen personal interviews with the Dalai Lama in McLeod Ganj in India's Himalayan north, home to Tibet's government-in-exile. In Dalai Lama: Man, Monk, Mystic he presents an in-depth, insightful portrait of a figure of perennial interest to people all over the world. Chhaya writes about Tibet and the Buddhist tradition from which the Dalai Lama emerged, helping readers understand the context that shaped his beliefs, politics, and ideals. Adding depth and nuance to his portrait, Chhaya depicts the Dalai Lama in the light of his life in exile and the various roles he has had to assume for his followers. He sheds light on the highly complex conflict between China and Tibet, and offers insights into the growing discontent among young Tibetans who are frustrated with the nonviolent approach to Chinese occupation that the Dalai Lama advocates. A balanced, informative view of the Dalai Lama and his work, this biography is both a compelling profile of a remarkable spiritual leader and his mission, and an engaging look at how the current unrest in his country will affect its future.","Category":{"CategoryName":"Biography"}},{"Author":"Spignesi","Name":"The Woody Allen companion","Price":"0","Description":"A comprehensive, up-to-date, fun and informative look at Woody Allen, his life, his films, his writings, and his unique role in contemporary culture. This is the ultimate guide for Woody's fans, featuring interviews, articles, photos, reviews, interpretive essays, bibliography, filmography, and more. 16 pages of photographs.","Category":{"CategoryName":"Biography"}},{"Author":"Ruth Brandon","Name":"The Life And Many Deaths Of Harry Houdini","Price":"0","Description":"Everyone has heard of Harry Houdini. Over 60 years after his death, his death-defying escapes still inspire imitators and ad-men. When we think of Houdini, we think of a small man, manacled, jumping off a bridge into icy water, suspended from a skyscraper or emerging, seemingly against the odds, from a sealed coffin. His tricks, and they usually were tricks, were very clever and effective, but the author argues that the man himself was far more interesting than they were. Brandon examines the phenomenon of fame - what is it that compels a man to perform acts of near-suicidal bravado to gain public acclaim, and what is it that draws vast crowds of people to watch? She considers the nature of a man whom she believes was probably sexually repressed, and yet performed almost naked draped in chains and manacles, who wrote love letters to his wife - who was in another room - five times a day, and who struggled obsessively for years to prove or disprove the existence of life after death. Brandon argues that it is in the death that the key to Houdini's life, and success, is to be found. More complex than simply seeing a small man triumph against the odds, she claims that his escapes can be read as drama of death and resurrection, a signal, perhaps, that one can return from the other side. By the author of \"The New Women and the Old Men\", and \"Being Divine\".","Category":{"CategoryName":"Biography"}},{"Author":"Orhan Pamuk","Name":"Instanbul","Price":"0","Description":"'From a very young age, I knew I was not alone: somewhere in the streets of Istanbul, in a house resembling ours, there lived another Orhan so much like me that he could pass for my twin, even my double...' For Orhan the day-dreaming child, the heart of the great teeming city of Istanbul was the building known as 'Pamuk Apartments', where each branch of his large and extended family occupied its own separate floor. Now the writer Orhan Pamuk, with his unique sense of history and extraordinary gift for narrative, revisits his own family's secrets and idiosyncracies, discovering what made them typical of their time and place.And as he companionably guides us through Istanbul's monuments and lost paradises, its dilapidated Ottoman villas, back streets and waterways, he introduces the writers, artists, columnists and mad popular historians who have tracked Istanbul through one hundred and fifty years of 'modernisation'. And so, in a beautiful and quite riveting fashion, Pamuk transforms the form of autobiography, and what begins as a portrait of the artist as a young man becomes a portrait of the artist as a city.","Category":{"CategoryName":"Biography"}},{"Author":"John Tytell","Name":"Naked angels","Price":"0","Description":"A fascinating blend of literary and social criticism, history, and biography, Naked Angels is a revealing introduction to the lives and work of Jack Kerouac, Allen Ginsberg, and William S. Burroughs and an unsurpassed look at the powerful influence they had on the 1960s and beyond. \"The definitive history.\" -Leon Edel.\"","Category":{"CategoryName":"Biography"}},{"Author":"Erich Kempka","Name":"I was Hitlers chauffeur","Price":"0","Description":"Erich Kempka served as Hitler s personal driver from 1934 through to the Fuhrer s dramatic suicide in 1945. His candid memoirs offer a unique eyewitness account of events leading up to and during the war, culminating in those dark final days in the Fuhrer's headquarters, deep under the shattered city of Berlin.He begins by describing his duties as a member of Hitler s personal staff in the years preceding the war, driving the Fuhrer throughout Germany and abroad, and accompanying him to rallies.The crux of his memoirs however covers his life with Hitler in the Berlin Fuhrerbunker. During this time he was responsible for a transport fleet of cars, and often drove the likes of Speer or Kesselring on inspection tours to the hot spots on the front; and in March 1945, he accompanied the Fuhrer to his final front-inspection tour. Kempka was also present when news came through of Goring and Himmler s efforts to seize power and negotiate a truce with the Western Allies.Crucially, Kempka also witnessed Hitler s marriage to Eva Braun, and his last dinner and personal farewell to all those present, before he and his wife committed suicide. Hitler s final order to Kempka was that he have ready enough petrol to burn him and his wife. Under constant Soviet artillery fire, Kempke, Linge and others poured petrol over the bodies and burnt them.","Category":{"CategoryName":"Biography"}},{"Author":"Magazine Rolling Stone - 1989-06-15","Name":"Unknown","Price":"0","Description":"Vintage magazines from your date of birth? This is what\r\nyou'll find, here in Elephant Bookstore - thousands of magazines and comics,\r\nincluding Playboy and National Geographic, all properly preserved, sorted and\r\npacked ready for a gift. \r\n\r\nCarefully sourced by scouring dealers in the USA, our unique\r\ncollection of magazines and comics are the perfect gift&nbsp; - young gentlemen and women (of course!)\r\nwould love to receive say a, Playboy from the time they were born !&nbsp; \r\n\r\nOur magazines, starting from 1917 (yes, really!) are in very\r\ngood condition and are ideal for both serious collectors and those of us who\r\njust love the period ads....... Ask us for your dates and consider also the\r\npossibility of framing the cover of your choice.","Category":{"CategoryName":"Biography"}},{"Author":"Margaret Atwood  Margaret Atwood Omnibus","Name":"Unknown","Price":"0","Description":"This omnibus edition contains two of Margaret Atwood's offbeat and quirky tales: \"Cat's Eye\" and \"Wilderness Tips\".","Category":{"CategoryName":"Biography"}},{"Author":"Bruce Chatwin","Name":"Anatomy Of Restlessness","Price":"0","Description":"Celebrated novelist and travel writer Bruce Chatwin, bestselling author of In Patagonia, The Songlines, and What Am I Doing Here?, has been called the foremost literary traveler of his generation. Now, published for the first time in book form, this collection of writings offers new insight into the late author's life and work","Category":{"CategoryName":"Biography"}}]