[{"Author":"Farewell, Monsieur Gaston","Name":"Unknown","Price":"25.90","Description":"Farewell, Monsieur GastonThe books are personally signed by the author! Farewell, Monsieur Gaston is a Dionysian mystery in which every character is also an actor, and each actor is a guest from another, hidden play, where all paths are circular and appearances are but a ruse by a primordial trickster demiurge. Set up as an Athenian tragedy complete with a skene, a chorus leader, a chorus of manic bacchants, and an audience, the novel uncloaks a sunless, grotesquely violent realm and tracks the journey of an ill fated Hero robbed of his most prized possession: his self.Grozni was born in Sofia, Bulgaria. After being accepted to the National Music School вЂњLubomir PipkovвЂќ, he trained to become a concert pianist, winning his first international piano award in Salerno, Italy, in 1983. Following the political changes after the fall of the Berlin Wall, in 1992 Grozni left Bulgaria to study Jazz and composition at Berklee College of Music, Boston.In 1995, Grozni left for India to become a Buddhist monk and study Tibetan language. He spent four years in Dharamsala, studying at the Institute of Buddhist Dialectics, before joining Drepung Monastery in South India in 1999, where he stayed for six months. The five years he spent in India would become the inspiration for his three works in Bulgarian, as well as for his memoir in English: вЂTurtle Feet: The making and unmaking of a Buddhist monk.\" Grozni holds an MFA in creative writing from Brown University. Grozni and his wife, Danielle Trussoni, were featured in an episode of Season 2 of This American Life TV),[1] in which he discussed his dislike of mowing the lawn.","Category":{"CategoryName":"Bulgarian Authors in English"}},{"Author":"Signed Book 18% GRAY Zachary Karabashliev","Name":"Unknown","Price":"24.90","Description":"Signed Book 18% GRAY Zachary KarabashlievOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Distraught over the sudden disappearance of his wife Stella, Zack tries to drown his grief in Tijuana, where he encounters a violent scene, and trying to save a stranger's life, he nearly loses his own. He manages to escape in his assailantsвЂ™ van and makes it back to the US, only to find a bag of marijuana in it.&nbsp;Using this as an impetus to change his life, Zack sets off for New York with the weed and a vintage Nikon. Through the lens of the old camera, he starts rediscovering himself by photographing an America we rarely see. His journey unleashes a series of erratic, hilarious, and life-threatening events interspersed with flashbacks to his relationship with Stella and life in Eastern Europe at the end of the 1980s.","Category":{"CategoryName":"Bulgarian Authors in English"}},{"Author":"Signed Book CLAUSTROPHOBIAS Nikolai Grozny","Name":"Unknown","Price":"18.90","Description":"Signed Book CLAUSTROPHOBIAS Nikolai GroznyOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Short stories&nbsp;on Claustrophobia&nbsp;in different style from all around the World, gathered in a book that you can only find in our bookstore.","Category":{"CategoryName":"Bulgarian Authors in English"}},{"Author":"Scriptura Mundi Writings Of The World","Name":"Unknown","Price":"39.90","Description":"This thorough, and almost breathtaking, collection appears as \"The First International Review on Writing and Written Cultures of the World.\" The editor explains that \"Scriptura Mundi is an initiative of the NGO for international cultural and media cooperation Balkanmedia Association, founded in 1990 in Sofia,&nbsp;Bulgaria.&nbsp;Scriptura Mundi for the first time presents a wide international and multi perspective, panoramic view on writing and written cultures of the world. It includes the studies of 38 leading national experts from 24 countries on the relevant alphabets and writing systems\" .&nbsp;The very&nbsp;scope and complexity of the book&nbsp;makes it impossible to summarize beyond a brief overview of the contents, though even this brief summary gives a good sense of the scope of the work.","Category":{"CategoryName":"Bulgarian Authors in English"}},{"Author":"Villa Pacifica","Name":"Kapka Kassabova","Price":"0","Description":"Villa Pacifica | Kapka Kassabova As Ute and her husband Jerry travel to a remote area on the west coast of South America, they decide to visit a recently established eco retreat called Villa Pacifica. The resort, run by a group of eccentric expatriates, offers a luxuriant refuge   in the middle of an arid and poverty stricken region   to an exotic menagerie of large cats, monkeys, giant turtles and birds of paradise which have been rescued from traffickers. When a huge storm descends on the coast, travellers and locals are left to fend for themselves. The hot house world that teems below the surface of Villa Pacifica rises to engulf everyone. Madness begins to take hold, and everybody starts questioning themselves and their own sanity.","Category":{"CategoryName":"Bulgarian Authors in English"}}]