[{"Author":"Choderlos De Laclos","Name":"Dangerous Liaisons","Price":"5.90","Description":"In this famous story of seduction, two highly intelligent but amoral French aristocrats plot the downfall of a respectable young married woman and a fifteen year old girl who has only just emerged from the convent. The letters these two conspirators exchange are remarkably frank in describing how they manage to achieve their ends and, at the same time, reveal nuances of character which make it impossible to dismiss either of them as simply evil. Those written by their victims are equally revelatory in a quite different and subtle way, while the manner in which Laclos handles the epistolary form in order to ensure that his two protagonists are finally defeated, not by outside forces, but the fissures in their own relationship, is a triumph of narrative skill. This novel poses shrewd questions about the relation between love and sex, and suggests that, in certain sections of eighteenth century French high society, idleness, boredom and wealth had created individuals whose misfortunes it would be hard to regret when, only seven years after Dangerous Liaisons was published, the Revolution broke out. Blurb by David Ellis","Category":{"CategoryName":"Classics"}},{"Author":"James Fenimore Cooper","Name":"The Deerslayer","Price":"5.00","Description":"The Deerslayer&nbsp;Set in the 1740s, when Natty Bumppo is in his twenties,&nbsp;J. F. Cooper's last leather-stocking tale shows us how&nbsp;\"Deerslayer\"&nbsp;becomes&nbsp;\"Hawkeye.\"&nbsp;For modern readers, it remains the best entry point into the series. Ezra Tawil's introduction examines the static nature of Natty, Cooper's motivations in writing the novel, and his vexed racial politics.","Category":{"CategoryName":"Classics"}},{"Author":"Fyodor Dostoyevsky","Name":"The House Of The Dead","Price":"4.00","Description":"The House Of The Dead&nbsp;Accused of political subversion as a young man,&nbsp;Fyodor Dostoyevsky was sentenced to four years of hard labor at a Siberian prison camp вЂ” a horrifying experience from which he developed this astounding semi-autobiographical memoir of a man condemned to ten years of servitude for murdering his wife.As with a number of the author's other works, this profoundly influential novel brilliantly explores his characters' thoughts while probing the depths of the human soul.Describing in relentless detail the physical and mental suffering of the convicts, Dostoyevsky's character never loses faith in human qualities and the goodness of man.A haunting and remarkable work filled with wonder and resignation,&nbsp;The House of the Dead&nbsp;ranks among the Russian novelist's greatest masterpieces. Of this powerful autobiographical novel, Tolstoy wrote, \"I know no better book in all modern literature.\"","Category":{"CategoryName":"Classics"}},{"Author":"Charles Dickens","Name":"Pickwick Papers","Price":"5.90","Description":"Pickwick Papers&nbsp;When young Charles Dickens was commissioned to write the text for a series of sporting illustrations in 1836, no one could have suspected that this journeyman task was to turn in to one of the great comic novels in&nbsp;English literature.After the premature death of the original illustrator, Dickens took charge of the project, which was published in monthly parts. The result is a brilliant panorama of English life in the 1830s, a cornucopia of stories and vignettes featuring dozens of vividly drawn characters. Chief among them are Mr Pickwick himself, a later day Don Quixote travelling about the country righting wrongs; and his Sancho Panza, Sam Weller, whose pithy sayings and bizarre anecdotes immediately became and remained part of national mythology.With&nbsp;The Pickwick Papers Dickens&nbsp;established himself at a single stroke as a major creative artist, revealing the depth of his human sympathies, the breadth of his interests and his extraordinary linguistic virtuosity. His first novel, published when he was 25, is his first masterpiece.&nbsp;","Category":{"CategoryName":"Classics"}},{"Author":"Rudyard Kipling","Name":"Limits And Renewals","Price":"3.00","Description":"&nbsp;Limits And RenewalsKipling's last collection of stories, written after the loss of his only son and when he was old and ill. Many reveal an obsession with pain and with the \"breaking point\" of a human being - the amount of pressure from physical and mental terrors that can be endured without a psychological collapse.","Category":{"CategoryName":"Classics"}},{"Author":"Homer","Name":"The Odyssey","Price":"5.90","Description":"\"The Odyssey\" is one of the earliest works of European literature, second only to \"The Iliad\". These two great epic poems, the astonishing first fruits of Greek civilisation, have together determined much of the course of Western literary culture and imagination. \"The Odyssey\" tells of the long and painful return of Odysseus from the Trojan War to his homeland of Ithaka, his wife Penelope, and his son Telemachos. Even after he finally returns, there are enemies to be fought in his house. The action of the poem covers a huge canvas, ranging widely over time and place, exploring the known and the unknown worlds, involving magic and monsters, gods and ghosts, dangers defied: throughout there runs a strong and eloquent insistence on the humanity of man and the ultimate triumph of good over evil.","Category":{"CategoryName":"Classics"}},{"Author":"Thomas Hardy","Name":"The Mayor Of Casterbridge","Price":"3.90","Description":"The Mayor Of Casterbridge&nbsp;A cruel joke at a country fair goes too far when a drunken laborer auctions off his wife and child to the highest bidder. So begins&nbsp;The Mayor of Casterbridge, Thomas Hardy's&nbsp;gripping tale of a man's rise and fall amid the natural beauty and human brutality of a rural English community.First published serially in 1886, the novel was praised by critics for its realism and poetic style. Most agreed, however, that its plot hinges upon unlikely turns of events. Hardy replied, \"It is not improbabilities of incident but improbabilities of character that matter.\"In this book вЂ” originally subtitled&nbsp;\"A Story of a Man of Character\"&nbsp;вЂ” the author perpetually tests his characters with frequent intrusions by the hand of fate. Rich in descriptive powers and steeped in irony, this timeless tale offers a spellbinding portrayal of ambition, rivalry, revenge, and repentance.","Category":{"CategoryName":"Classics"}},{"Author":"John Buchan","Name":"Three Hostages","Price":"5.50","Description":"Three HostagesA charismatic but dangerous adversary stands between Richard Hannay and his mission to free the three hostages. The author also wrote \"The Thirty-Nine Steps\", \"Greenmantle\", \"Mr Standfast\" and \"The Island of Sheep\".","Category":{"CategoryName":"Classics"}},{"Author":"John Buchan","Name":"Island Of Sheep","Price":"5.50","Description":"Island Of Sheep&nbsp;In this, his final adventure, Buchan's hero Richard Hannay becomes embroiled in one of the most hazardous escapades of his life. Two men are honour bound to help the tormented Valdemar Haraldsen, and a third decides to mastermind the whole affair out of a sheer love of adventure and a dislike of villains.","Category":{"CategoryName":"Classics"}},{"Author":"William Shakespear","Name":"As You Like It","Price":"7.90","Description":"As You Like ItWilliam Shakespeare (baptised 26 April 1564) was an English poet and playwright, widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist.He is often called England's national poet and the \"Bard of Avon\" (or simply \"The Bard\"). His surviving works consist of 38 plays, 154 sonnets, two long narrative poems, and several other poems. His plays have been translated into every major living language, and are performed more often than those of any other playwright.","Category":{"CategoryName":"Classics"}},{"Author":"Charles Dickens","Name":"Little Dorrit","Price":"5.90","Description":"Charles Dickens'Clennam rose softly, opened and closed the door without a\r\nsound, and passed from the prison, carrying the quiet with him into the\r\nturbulent streets.' Introspective and dreamy, Arthur Clennam returns to England\r\nfrom many years abroad to find a people gripped in their self-made social and\r\nmental prisons. Against a background of government incompetence and financial\r\nscandal, he searches for the key to the affairs of the Dorrit family, prisoners\r\nfor debt in the Marshalsea. He discovers through the seamstress Amy Dorrit the\r\nfulfilment of which he dreams, but only after he learns to understand his own\r\nheart. Revelation and redemption haunt Dickens's portrayal of human relations\r\nas fundamentally distorted by class and money. The swindling financier Merdle,\r\nthe bureaucratic nightmare of the Circumlocution Office, and a teeming cast of\r\ncharacters display the inadequacy of secular morality in the face of\r\ncontemporary social and political confusion.","Category":{"CategoryName":"Classics"}},{"Author":"James Clavell","Name":"Gai Jin","Price":"11.90","Description":"Gai Jin From the author of Noble House comes a blockbuster national\r\nbestselling masterpiece of Shogun. Clavell sweeps readers back to Japan in the\r\n1860s, where Malcolm Struan, he ir to the title of Tai-Pan meets a beautiful\r\nyoung French woman who will alter the Noble House legacy. Gai-Jin is scheduled\r\nto be made into an NBC mini-series in 1995.","Category":{"CategoryName":"Classics"}},{"Author":"Robert W Chambers","Name":"The king in yellow","Price":"12.90","Description":"The King in YellowWith an Introduction by&nbsp;David Stuart Davies. 'I read it and reread it, and wept and laughed and trembled with horror which at all times assails me yet'. With its strange, imaginative blend of horror, science fiction, romance and lyrical prose,&nbsp;Robert W. Chambers' The King in Yellow&nbsp;is a classic masterpiece of weird fiction.This series of vaguely connected stories is linked by the presence of a monstrous and suppressed book which brings fright, madness and spectral tragedy to all those who read it.An air of futility and doom pervade these pages like a sweet insidious poison. Dare you read it? This collection has been called the most important book in American supernatural fiction between Poe and the moderns.&nbsp;H. P. Lovecraft, creator of the famed Cthulu mythos, whose own fiction was greatly influenced by this book stated that&nbsp;The King in Yellow&nbsp;'achieves notable heights of cosmic fear'.","Category":{"CategoryName":"Classics"}},{"Author":"Thomas Hardy","Name":"The Woodlanders","Price":"5.90","Description":"Hardy described the theme of The Woodlanders as 'the immortal puzzle -given the man and woman, how to find a basis for their sexual relation'. Set in the familiar Dorset landscape, this time on the wooded outskirts of Blackmoor Vale, it tells the story of two women who love the same man. The elegant Grace Melbury and homelier Marty South compete for the attention of Giles Winterbourne, but both are doomed to disappointment. Written in 1887, shortly before Tess Of The D'urbervilles, The Woodlanders has none of that novel's fierce cruelty.","Category":{"CategoryName":"Classics"}},{"Author":"Henry James","Name":"Washington Square","Price":"5.90","Description":"'She will do as I have bidden her.' Catherine Sloper is heiress to a fortune and the social eminence associated with Washington Square. She attracts the attention of a good-looking but penniless young man, Morris Townsend. His suit is encouraged by Catherine's romantically-minded aunt, Mrs Penniman, but her father, a clever physician, is convinced that his motives are merely mercenary. He will not consent to the marriage, regardless of the cost to his daughter. Out of this classic confrontation Henry James fashioned one of his most deftly searching shorter fictions.","Category":{"CategoryName":"Classics"}},{"Author":"Ian Fleming","Name":"From Russia With Love","Price":"9.90","Description":"Bond does not himself feature until quite late in this novel - the opening chapters, one of Fleming's most amazing fantasies, creates the nightmare world of SMERSH - the Russian counter-spy organisation, its sickeningly foul section head Rosa Klebb and her top assassin Grant.","Category":{"CategoryName":"Classics"}},{"Author":"P.G. Wodehouse","Name":"Right Ho, Jeeves","Price":"9.90","Description":"Right Ho, Jeeves is a novel by P. G. Wodehouse, the second full-length novel featuring the popular characters Jeeves and Bertie Wooster, after Thank You, Jeeves. It also features a host of other recurring Wodehouse characters, and is mostly set at Brinkley Court, the home of Bertie's Aunt Dahlia. It was first published in the United Kingdom on October 5, 1934 by Herbert Jenkins, London, and in the United States on October 15, 1934 by Little, Brown and Company, Boston, under the title Brinkley Manor.","Category":{"CategoryName":"Classics"}},{"Author":"Rosalind Miles","Name":"Isolde","Price":"5.90","Description":"Isolde is a gifted healer and a princess. Tristan is an intrepid knight. When Isolde and Tristan fall in love, what unfurls is an epic of politics, faith, betrayal, and fate that will leave them both prey to evil but united by their perilous, abiding devotion.","Category":{"CategoryName":"Classics"}},{"Author":"Richard Bach","Name":"Jonathan Livingston Seagull","Price":"11.90","Description":"Jonathan Livingston Seagull, the bird determined to be more than ordinary, to have a reason for living. This is a story for people who follow their dreams and make their own rules; it's inspired people for decades. Most gulls don't bother to learn more than the simplest facts of flight--how to get from shore to food and back again,\" writes author Richard Bach, in this allegory about a unique bird named Jonathan Livingston Seagull. \"For most gulls it is not flying that matters, but eating. For this gull, though, it was not eating that mattered, but flight.\" Flight is indeed the metaphor that makes the story soar. Ultimately this is a fable about the importance of seeking a higher purpose in life, even if your flock, tribe or neighbourhood finds your ambition threatening. (At one point our beloved gull is even banished from his flock.) By not compromising his higher vision, Jonathan gets the ultimate pay-off: transcendence. Ultimately, he learns the meaning of love and kindness. The dreamy seagull photographs by Russell Munson provide just the right illustrations. This is a spirituality classic.","Category":{"CategoryName":"Classics"}},{"Author":"Michael Alexander (Editor)","Name":"Beowulf","Price":"11.90","Description":"The classic tale of monster-hunting, dragon-fighting Beowulf, here in its original Old English Beowulf is the greatest surviving work of literature in Old English, unparalleled in its epic grandeur and scope. It tells the story of the heroic Beowulf and of his battles, first with the monster Grendel, who has laid waste to the great hall of the Danish king Hrothgar, then with Grendel's avenging mother, and finally with a dragon that threatens to devastate his homeland.Through its blend of myth and history, Beowulf vividly evokes a twilight world in which men and supernatural forces live side by side, and celebrates the endurance of the human spirit in a transient world. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines.Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","Category":{"CategoryName":"Classics"}},{"Author":"Arthur Miller","Name":"A view from the bridge","Price":"12.90","Description":"Set on the gritty Brooklyn waterfront, \"A View from the Bridge\" follows the cataclysmic downfall of Eddie Carbone, who spends his days as a hardworking longshoreman and his nights at home with his wife, Beatrice, and niece, Catherine. But the routine of his life is interrupted when Beatrice's cousins, illegal immigrants from Italy, arrive in New York. As one of them embarks on a romance with Catherine, Eddie's envy and delusion plays out with devastating consequences.","Category":{"CategoryName":"Classics"}},{"Author":"Clive King","Name":"Stig of the Dump","Price":"9.90","Description":"Clive King's \"Stig of the Dump\" is a much-loved modern classic. \"Stig of the Dump\" is 50 years old and the story of Barney and his best friend, cave-man Stig, is as fresh today as it was when first published. Barney is a solitary little boy, given to wandering off by himself. One day he is lying on the edge of a disused chalk-pit when it gives way and he lands in a sort of cave. Here he meets 'somebody with a lot of shaggy hair and two bright black eyes' wearing a rabbit skin and speaking in grunts. He names him Stig. Of course nobody believes Barney when he tells his family all about Stig, but for Barney cave-man Stig is totally real. They become great friends, learning each others ways and embarking on a series of unforgettable adventures. This book is a wonderful \"Puffin Modern Classic\".","Category":{"CategoryName":"Classics"}},{"Author":"David Starkey","Name":"Elizabeth","Price":"14.90","Description":"An abused child, yet confident of her destiny, passionately sexual yet, she said, a virgin, famed as England's most successful ruler yet actually doing little, Elizabeth I is full of contradictions. This biography, published to accompany a Channel 4 series presented by the author, aims to turn the paradox into a person. Starting with Elizabeth's own speeches and writings, the author lays emphasis on two things: her faith made her see religion as a purely personal relationship between the individual conscience and God, yet her sophisticated education led her to a smoke-and-mirrors view of politics, in which clever image-making and speech-writing could solve or postpone real problems.","Category":{"CategoryName":"Classics"}},{"Author":"Markus Zusak","Name":"the book thief","Price":"11.90","Description":"'It's just a small story, really, about among other things: a girl, some words, an accordionist, a Jewish fist fighter, and quite a lot of thievery ...' This work is narrated in the all-knowing matter-of-fact voice of Death, witnessing the story of the citizens of Himmel Street: When nine-year-old Liesel arrives outside the boxlike house of her new foster parents, she refuses to get out of the car. Liesel has been separated from her parents - 'Kommunists' - for ever, and at the burial of her little brother, she steals a gravedigger's instruction manual which she can't read. It is the beginning of her illustrious career. In the care of the Hubermans, Liesel befriends blond-haired Rudy Steiner, her neighbour obsessed with Jesse Owens.","Category":{"CategoryName":"Classics"}},{"Author":"Astrid Lindgren","Name":"The best of Pippi Longstocking","Price":"11.90","Description":"Pippi Longstocking is as popular as ever, with dedicated fans all over the world. She's funny, feisty, and incredibly strong and has the most amazing adventures ever! Here's a chance to read three books about Pippi in one volume - Pippi Longstocking, Pippi Goes Aboard, and Pippi in the South Seas. This edition is illustrated throughout with black and white line drawings by best-selling artist, Tony Ross. Astrid Lindgren has won numerous awards including the Hans Christian Andersen Award and the International Book Award.","Category":{"CategoryName":"Classics"}},{"Author":"Michael Alexander","Name":"Beowulf","Price":"12.90","Description":"Finest heroic poem in Old English celebrates the exploits of Beowulf, a young nobleman of southern Sweden. Combines myth, Christian and pagan elements, and history into a powerful narrative. Genealogies.","Category":{"CategoryName":"Classics"}},{"Author":"Frances Beer","Name":"The juvenilia of Jane Austen and Charlotte Bronte","Price":"12.90","Description":"Their most striking similarity was that both produced a considerable body of juvenilia. For both authors this was a period in which to experiment and to develop character and style. Their work moved in very different directions: in her first short burlesques, Jane Austen exhibits a merciless wit as she lampoons human vanities and vices, later sharpened in 'The Three Sisters' and 'Catherine' to reveal a maturer moral perspective.","Category":{"CategoryName":"Classics"}},{"Author":"William Goldman","Name":"The Princess Bride","Price":"13.90","Description":"Beautiful, flaxen-haired Buttercup has fallen for Westley, the farm boy, and when he departs to make his fortune, she vows never to love another. So when she hears that his ship has been captured by the Dread Pirate Roberts - who never leaves survivors - her heart is broken. But her charms draw the attention of the relentless Prince Humperdinck who wants a wife and will go to any lengths to have Buttercup. So starts a fairytale like no other, of fencing, fighting, torture, poison, true love, hate, revenge, giants, hunters, bad men, good men, beautifulest ladies, snakes, spiders, beasts, chases, escapes, lies, truths, passion and miracles.","Category":{"CategoryName":"Classics"}},{"Author":"Eva Hoffman","Name":"Lost In Translation","Price":"11.90","Description":"In 1959 13-year-old Eva Hoffman left her home in Cracow, Poland for a new life in America. This memoir evokes with deep feeling the sense of uprootendess and exile created by this disruption, something which has been the experience of tens of thousands of people this century. Her autobiography is profoundly personal but also tells one of the most universal and important narratives of twentieth century history: the story of Jewish post-war experience and the tragedies and discoveries born of cultural displacement.","Category":{"CategoryName":"Classics"}},{"Author":"Thomas Mann","Name":"Death in Venice","Price":"11.90","Description":"A retranslation of seven stories by Thomas Mann, representing the early part of Mann's literary career. It begins with work he produced in 1896 and culminates with the novella, \"Death in Venice\", a tale of art and self-destruction, written in 1912.","Category":{"CategoryName":"Classics"}},{"Author":"Roald Dahl","Name":"The Best Of Roald Dahl","Price":"12.90","Description":"This title includes stories such as: \"Madame Rosette\", \"Man From the South\", \"The Sound Machine\", \"Taste\", \"Dip in the Pool\", \"Skin\", \"Edward the Conqueror\", \"Lamb to the Slaughter\", \"Galloping Foxley\", \"The Way up to Heaven\", \"Parson's Pleasure\", \"The Landlady\", \"William and Mary\", \"Mrs Bixby and the Colonel's Coat\", \"Royal Jelly\", \"Georgy Porgy\", \"Genesis and Catastrophe\", \"Pig\", \"The Visitor\", and, \"Claud's Dog\".","Category":{"CategoryName":"Classics"}},{"Author":"Roald Dahl","Name":"Charlie and the chocolate factory","Price":"9.90","Description":"\"The ultimate children's story ever.\" (David Walliams). Phizz-whizzing new branding for the world's No. storyteller! Exciting, bold and instantly recognisable with Quentin Blake's inimitable artwork. The famous story of Charlie Bucket and his Golden Ticket, and Willy Wonka and his amazing chocolate factory. Mr Willy Wonka, the most wondrous inventor in the world, opens his gates of his amazing chocolate factory to five lucky children.Gobstoppers, wriggle sweets and a river of melted chocolate delight await - Charlie needs just one Golden Ticket and these delicious treats could all be his! Roald Dahl, the best-loved of children's writers, was born in Wales of Norwegian parents. His books continue to be bestsellers, despite his death in 1990, and total sales are over 100 million worldwide!Quentin Blake is one of the best-known and best-loved children's illustrators and it's impossible now to think of Roald Dahl's writings without imagining Quentin Blake's illustrations. Quentin Blake is one of Britain's most successful illustrators. His first drawings were published in Punch when he was sixteen.He has illustrated nearly three hundred books and he was Roald Dahl's favourite illustrator. He has won many awards including the Whitbread Award and the Kate Greenaway Medal. Besides being an illustrator he taught for over twenty years at the Royal College of Art and in 1999 he became the first ever Children's Laureate! Six years later he was awarded a CBE for services to children's literature and in 2013 he was knighted in the New Year's Honours - which means his full title is Sir Quentin Blake, although we can still all go on calling him Quentin as usual.","Category":{"CategoryName":"Classics"}},{"Author":"Ernest Hemingway","Name":"Islands in the stream","Price":"13.90","Description":"Divided into three parts, Islands in the Stream is Hemingway's last work, originally published posthumously in 1970, nine years after his death. Thomas Hudson is an artist and adventurer. In the 1930s, Hudson is living in the Bimini Islands in the Gulf Stream. Separated from his sons for most of the year by their controlling mother, Hudson lives a life carved out by the rolling waves of the sea and the currents of the tide. When his sons come to visit the island, Hudson is forced to come to terms with his unfamiliar role as a father.This compelling novel follows Hudson's evolution from contemplative artist to antisubmarine adventurer during WWII. Hudson must face the harsh realities of life and death, alongside a cast of colourful and vivid characters, in war-time Cuba and at sea. Drawing on Hemingway's own experiences, Islands in the Stream combines one of his most complex and troubled characters with his most exquisite descriptions of nature, in a novel rich in both reflection and action.","Category":{"CategoryName":"Classics"}},{"Author":"Oscar Wilde","Name":"Lord Arthur Saviles Crime","Price":"12.90","Description":"'He was not blind to the fact that murder, like the religions of the Pagan world, requires a victim as well as a priest...' Wilde's supremely witty tale of dandies, anarchists and a murderous prophecy in London high society. Introducing Little Black Classics: 80 books for Penguin's 80th birthday. Little Black Classics celebrate the huge range and diversity of Penguin Classics, with books from around the world and across many centuries. They take us from a balloon ride over Victorian London to a garden of blossom in Japan, from Tierra del Fuego to 16th-century California and the Russian steppe. Here are stories lyrical and savage; poems epic and intimate; essays satirical and inspirational; and ideas that have shaped the lives of millions. Oscar Wilde (1854-1900). Wilde's works available in Penguin Classics are De Profundis and Other Prison Writings, The Complete Short Fiction, The Importance of Being Earnest and Other Plays, The Picture of Dorian Gray and The Soul of Man Under Socialism and Selected Critical Prose.","Category":{"CategoryName":"Classics"}},{"Author":"Gabriel Garcia Marquez","Name":"One hundred years of solitude","Price":"12.90","Description":"Penguin's commemorative hardback reissue of One Hundred Years of Solitude by late Nobel laureate and author Gabriel Garcia Marquez is a timeless classic and the perfect Christmas gift for any booklover. Gabriel Garcia Marquez has been one of the undisputed literary giants of the past century; his stories are vivid, energetic, tender and unforgettable; they have touched the lives of readers across the globe and earned him countless awards including the Nobel Prize for Literature. In the wake of the author's death, his most beloved novel is reissued in commemorative hardback edition.One Hundred Years of Solitude is endlessly fascinating, an intricately patterned work of fiction and a joyful, irrepressible celebration of humanity. Vibrantly colourful and teeming with life, this timeless tale blends the natural with the supernatural in one of the most magical reading experiences on earth. 'Many years later, as he faced the firing squad, Colonel Aureliano Buendia was to remember that distant afternoon when his father took him to discover ice.' Gabriel Garcia Marquez's great masterpiece is the story of seven generations of the Buendia family and of Macondo, the town they have built. Though little more than a settlement surrounded by mountains, Macondo has its wars and disasters, even its wonders and its miracles.A microcosm of Columbian life, its secrets lie hidden, encoded in a book, and only Aureliano Buendia can fathom its mysteries and reveal its shrouded destiny. Blending political reality with magic realism, fantasy and comic invention, One Hundred Years of Solitude is one of the most daringly original works of the twentieth century.","Category":{"CategoryName":"Classics"}},{"Author":"Bret Easton Ellis","Name":"American Psycho","Price":"13.90","Description":"Patrick Bateman is twenty-six and works on Wall Street; he is handsome, sophisticated, charming and intelligent. He is also a psychopath. Taking us to a head-on collision with America's greatest dream - and its worst nightmare - \"American Psycho\" is a bleak, bitter, black comedy about a world we all recognize but do not wish to confront. \"Serious, clever and shatteringly effective.\" - \"Sunday Times.\" \"\"American Psycho\" is a beautifully controlled, careful, important novel...The novelist's function is to keep a running tag on the progress of the culture; and he's done it brilliantly...A seminal book.\" - Fay Weldon, \"Washington Post.\" \"For its savagely coherent picture of a society lethally addicted to blandness, it should be judged by the highest standards.\" - John Walsh, \"Sunday Times.\" \"That the book's contents are shocking is downright undeniable, but just as Bonfire of the Vanities exposed the corruption and greed engendered in eighties politics and high living, \"American Psycho\" examines the mindless preoccupations of the nineties preppy generation.\" - \"Time Out.\"","Category":{"CategoryName":"Classics"}},{"Author":"Antoine de Saint Exupery","Name":"The Little Prince","Price":"5.90","Description":"Translated by Irene Testot Ferry. The Little Prince is a classic tale of equal appeal to children and adults. On one level it is the story of an airman's discovery, in the desert, of a small boy from another planet   the Little Prince of the title   and his stories of intergalactic travel, while on the other hand it is a thought provoking allegory of the human condition. First published in 1943, the year before the author's death in action, this translation contains Saint Exupery's delightful illustrations.&nbsp;","Category":{"CategoryName":"Classics"}},{"Author":"Leo Tolstoy","Name":"War And Peace","Price":"6.90","Description":"\"War and Peace\" broadly focuses on Napoleon's invasion of Russia in 1812 and follows three of the most well known characters in literature: Pierre Bezukhov, the illegitimate son of a count who is fighting for his inheritance and yearning for spiritual fulfillment; Prince Andrei Bolkonsky, who leaves his family behind to fight in the war against Napoleon; and Natasha Rostov, the beautiful young daughter of a nobleman who intrigues both men. As Napoleon's army invades, Tolstoy brilliantly follows characters from diverse backgrounds peasants and nobility, civilians and soldiers as they struggle with the problems unique to their era, their history, and their culture. And as the novel progresses, these characters transcend their specificity, becoming some of the most moving and human figures in world literature. Translated by Louise and AylmerMaude. Book Jacket Status: Not Jacketed) Three Volume Boxed Set\"","Category":{"CategoryName":"Classics"}},{"Author":"Sir Arthur Conan Doyle","Name":"The Adventures &amp; Memoirs Of Sherlock Holmes","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Sir Arthur Conan Doyle","Name":"The Hound Of The Baskervilles","Price":"5.90","Description":"This volume contains four of the greatest Sherlock Holmes novels penned by Sir Arthur Conan Doyle. \"The Hound of the Baskervilles\" is the classic detective chiller. The Baskerville family is haunted by a phantom beast which roams the mist enshrouded wilds of Dartmoor. Now the hound seems to be stalking the young Sir Henry, new heir to the Baskerville estate. Only Sherlock Holmes can solve the mystery. In \"The Valley of Fear\" a cipher message and a horrible murder begin this dark, powerful tale in which Sherlock Holmes faces his old arch enemy Professor Moriarty once more. \"A Study in Scarlet\" introduced the great scientific detective, Sherlock Holmes, and Dr Watson, his friend and chronicler, to the reading public. \"The Sign of the Four\" presents the detective with one of his greatest challenges   solving the theft of the great Agra treasure in India.","Category":{"CategoryName":"Classics"}},{"Author":"Mary Elizabeth Braddon","Name":"Lady Audley's Secret","Price":"5.90","Description":"With an Introduction and Notes by Esther Saxey The flaxen haired beauty of the childlike Lady Audley would suggest that she has no secrets. But M.E. Braddon's classic novel of sensation uncovers the truth about its heroine in a plot involving bigamy, arson and murder. It challenges assumptions about the nature of femininity and investigates the narrow divide between sanity and insanity, using as its focus one of the most fascinating of all Victorian heroines. Combining elements of the detective novel, the psychological thriller and the romance of upper class life, Lady Audley's Secret was one of the most popular and successful novels of the nineteenth century and still exerts a powerful hold on readers.","Category":{"CategoryName":"Classics"}},{"Author":"The Casebook of Sherlock Holmes &amp; His Last Bow","Name":"Arthur Conan Doyle","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"The House of the Dead &amp; The Gambler","Name":"Fyodor Dostoyevsky","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Fyodor Dostoyevsky","Name":"Devils","Price":"6.90","Description":"Translated by Constance Garnett with an Introduction by A.D.P. Briggs. In 1869 a young Russian was strangled, shot through the head and thrown into a pond. His crime? A wish to leave a small group of violent revolutionaries, from which he had become alienated. Dostoevsky takes this real life catastrophe as the subject and culmination of Devils, a title that refers the young radicals themselves and also to the materialistic ideas that possessed the minds of many thinking people Russian society at the time. The satirical portraits of the revolutionaries, with their naivety, ludicrous single mindedness and readiness for murder and destruction, might seem exaggerated   until we consider their all too recognisable descendants in the real world ever since. The key figure in the novel, however, is beyond politics. Nikolay Stavrogin, another product of rationalism run wild, exercises his charisma with ruthless authority and total amorality. His unhappiness is accounted for when he confesses to a ghastly sexual crime   in a chapter long suppressed by the censor. This prophetic account of modern morals and politics, with its fifty odd characters, amazing events and challenging ideas, is seen by some critics as Dostoevsky's masterpiece.","Category":{"CategoryName":"Classics"}},{"Author":"Sir Walter Scott","Name":"Ivanhoe","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Joseph Conrad","Name":"Three Sea Stories","Price":"5.90","Description":"As these three specially commissioned stories amply demonstrate, Conrad is our greatest writer of the sea. His characters are tested by dramatic events 'that show in the light of day the inner worth of a man, the edge of his temper, and the fibre of his stuff; that reveal the quality of his resistance and the secret stuff of his pretences, not only to others but also to himself'. In Typhoon, Conrad's funniest story, Captain MacWhirr blunders into a hurricane that reveals the sea's treachery, violence and terror. Falk is desperate to get married, but first he must tell of his terrible experiences as sole survivor of a stricken ship that once drifted into the ice caps of Antarctica. The Shadow Line is a poignant and beautiful story. Written during the First World War and based on Conrad's fond evocation of his own first command, it expresses his solidarity with all who were obliged to cross in early youth the shadow line of their war torn generation. Includes a glossary of nautical terms","Category":{"CategoryName":"Classics"}},{"Author":"Fyodor Dostoyevsky","Name":"The Karamazov Brothers","Price":"6.90","Description":"Translated by Constance Garnett, with an Introduction by A. D. P. Briggs. As Fyodor Karamazov awaits an amorous encounter, he is violently done to death. The three sons of the old debauchee are forced to confront their own guilt or complicity. Who will own to parricide? The reckless and passionate Dmitri? The corrosive intellectual Ivan? Surely not the chaste novice monk Alyosha? The search reveals the divisions which rack the brothers, yet paradoxically unite them. Around the writhings of this one dysfunctional family Dostoevsky weaves a dense network of social, psychological and philosophical relationships. At the same time he shows   from the opening 'scandal' scene in the monastery to a personal appearance by an eccentric Devil   that his dramatic skills have lost nothing of their edge. The Karamazov Brothers, completed a few months before Dostoevsky's death in 1881, remains for many the high point of his genius as novelist and chronicler of the modern malaise. It cast a long shadow over D. H. Lawrence, Thomas Mann, Albert Camus, and other giants of twentieth century European literature.","Category":{"CategoryName":"Classics"}},{"Author":"Emily Bronte","Name":"Wuthering Heights","Price":"5.90","Description":"Introduction and Notes by John S. Whitley, University of Sussex. Wuthering Heights is a wild, passionate story of the intense and almost demonic love between Catherine Earnshaw and Heathcliff, a foundling adopted by Catherine's father. After Mr Earnshaw's death, Heathcliff is bullied and humiliated by Catherine's brother Hindley and wrongly believing that his love for Catherine is not reciprocated, leaves Wuthering Heights, only to return years later as a wealthy and polished man. He proceeds to exact a terrible revenge for his former miseries. The action of the story is chaotic and unremittingly violent, but the accomplished handling of a complex structure, the evocative descriptions of the lonely moorland setting and the poetic grandeur of vision combine to make this unique novel a masterpiece of English literature.","Category":{"CategoryName":"Classics"}},{"Author":"Mary Shelley","Name":"Frankenstein","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Sir Doyle Arthur Conan","Name":"Lost World &amp; Other Stories","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Fyodor Dostoyevsky","Name":"The Idiot","Price":"5.90","Description":"Translated by Constance Garnett, with an Introduction and Notes by Agnes Cardinal, Honorary Senior Lecturer in Comparative Literature at the University of Kent. Prince Myshkin returns to Russia from an asylum in Switzerland. As he becomes embroiled in the frantic amatory and financial intrigues which centre around a cast of brilliantly realised characters and which ultimately lead to tragedy, he emerges as a unique combination of the Christian ideal of perfection and Dostoevsky's own views, afflictions and manners. His serene selflessness is contrasted with the worldly qualities of every other character in the novel. Dostoevsky supplies a harsh indictment of the Russian ruling class of his day who have created a world which cannot accomodate the goodness of this idiot.","Category":{"CategoryName":"Classics"}},{"Author":"Herman Melville","Name":"Moby Dick","Price":"5.90","Description":"With an Introduction and Notes by David Herd, Lecturer in English and American Literature at the University of Kent at Canterbury and co editor of 'Poetry Review'. Moby Dick is the story of Captain Ahab's quest to avenge the whale that 'reaped' his leg. The quest is an obsession and the novel is a diabolical study of how a man becomes a fanatic. But it is also a hymn to democracy. Bent as the crew is on Ahab's appalling crusade, it is equally the image of a co operative community at work: all hands dependent on all hands, each individual responsible for the security of each. Among the crew is Ishmael, the novel's narrator, ordinary sailor, and extraordinary reader. Digressive, allusive, vulgar, transcendent, the story Ishmael tells is above all an education: in the practice of whaling, in the art of writing. Expanding to equal his 'mighty theme'   not only the whale but all things sublime   Melville breathes in the world's great literature. Moby Dick is the greatest novel ever written by an American.","Category":{"CategoryName":"Classics"}},{"Author":"Daniel Defoe","Name":"Robinson Crusoe","Price":"5.90","Description":"In Daniel Defoe's fictional autobiogrpahy Robinson Crusoe, originally published in 1719, the titular character escapes a career in law and sets off on a ill fated sea journey. This graphic novel adaptation tells the story that inspired popular culture for centuries, from the 'Swiss Family Robinson' to 'Lost'. Ideal as visual introductions to classic texts, Graffex titles are fast moving, cinematic retellings of wellknown stories. Equally rewarding as comics, graphic novels or learning resources, the series uses specially commissioned full colour artwork to retell some of the most incredible, influential and memorable tales in the canon of English literature. Speech bubbles feature direct quotes from the original text, running captions describe events in a clear manner and detailed footnotes translate challenging vocabulary and provide interesting background information. It's a wealth of key information that, critically, doesn't overwhelm or distract from the original story. Featuring photographs, paintings and maps, Graffex endmatters tell the story of each book in its wider geographical context. Text details the life of the author, the socio political events which influenced the book and the impact the book had on the society of the time. Each title also features a double page opening illustration and a full index.","Category":{"CategoryName":"Classics"}},{"Author":"Jane Austen","Name":"Northanger Abbey","Price":"5.90","Description":"Introduction and Notes by David Blair, University of Kent. Northanger Abbey tells the story of a young girl, Catherine Morland who leaves her sheltered, rural home to enter the busy, sophisticated world of Bath in the late 1790s. Austen observes with insight and humour the interaction between Catherine and the various characters whom she meets there, and tracks her growing understanding of the world about her. In this, her first full length novel, Austen also fixes her sharp, ironic gaze on other kinds of contemporary novel, especially the Gothic school made famous by Ann Radcliffe. Catherine's reading becomes intertwined with her social and romantic adventures, adding to the uncertainties and embarrassments she must undergo before finding happiness.","Category":{"CategoryName":"Classics"}},{"Author":"Sir Betjeman John","Name":"Ghastly Good Taste","Price":"6.00","Description":"This is a straightforward secondhand paperback copy, in good readable condition, No significant flaws We sell high quality books at reasonable prices, shipped regularly from the UK.","Category":{"CategoryName":"Classics"}},{"Author":"James Joyce","Name":"Finnegans Wake","Price":"8.00","Description":"Experimental novel by James Joyce. Extracts of the work appeared as Work in Progress from 1928 to 1937, and it was published in its entirety as&nbsp;Finnegans Wake&nbsp;in 1939. The book is, in one sense, the story of a publican in Chapelizod (near Dublin), his wife, and their three children; but Mr. Humphrey Chimpden Earwicker, Mrs. Anna Livia Plurabelle, and Kevin, Jerry, and Isabel are every family of mankind. Languages merge: Anna Livia has \"vlossyhair\"--wlosy being Polish for \"hair\"; \"a bad of wind\" blows--bad being Persian for \"wind.\" Characters from literature and history appear and merge and disappear. On another level, the protagonists are the city of Dublin and the River Liffey standing as representatives of the history of Ireland and, by extension, of all human history. As he had in his earlier work&nbsp;Ulysses, Joyce drew upon an encyclopedic range of literary works. His strange polyglot idiom of puns and portmanteau words is intended to convey not only the relationship between the conscious and the unconscious but also the interweaving of Irish language and mythology with the languages and mythologies of many other cultures.","Category":{"CategoryName":"Classics"}},{"Author":"Joseph Conrad","Name":"Heart Of Darkness And Other Storiesd","Price":"5.90","Description":"Heart of Darkness is a chilling tale of horror which, as the author intended, is capable of many interpretations. Set in the Congo during the period of rapid colonial expansion in the 19th century, the story deals with the highly disturbing effects of economic, social and political exploitation of European and African societies and the cataclysmic behaviour this induced in some individuals. A very influential story, it provided the plot of the film Apocalpyse Now.","Category":{"CategoryName":"Classics"}},{"Author":"Lewis Carroll","Name":"Alices Adventures in Wonderland (Ilustrations by Helen Oxenbury)","Price":"19.90","Description":"Welcome back to a Wonderland that is as astonishingly new as it is joyously familiar. Helen Oxenbury, one of the worldвЂ™s most acclaimed illustrators, brings her special brand of magic to the Lewis Carroll classic in a handsome volume boasting more illustrations than any other edition - called a \"masterpiece\" by ParentsвЂ™ Choice. Her Wonderland is exuberant, contemporary, and lovingly created, with all the warmth, depth of emotion, humor, and acute observations of people and animals for which the artistвЂ™s work is so highly regarded. An elegant, textured cover with flaps makes this a beautiful gift book.","Category":{"CategoryName":"Classics"}},{"Author":"L Frank Baum","Name":"The wizard of Oz","Price":"11.90","Description":"'We're not in Kansas any more, Toto ...' When a devastating tornado lifts up her house, Dorothy and her faithful dog Toto find themselves transported to a strange and beautiful land. Fearing they may never see home again, they set off on a magical journey to meet the Wizard of Oz, probably the only person who can help Dorothy find her way back to Kansas. Accompanied by a Tin Woodman, a Scarecrow and a Cowardly Lion, Dorothy finds her way onto the Yellow Brick Road, which she must follow all the way to the Emerald City, but many dangers lie ahead, not least the Wicked Witch of the West. The Wonderful Wizard of Oz has delighted generations of children since its initial publication in 1900. It joins the ranks of Alice's Adventures in Wonderland, Peter Pan, and Treasure Island as a genuine children's classic, filled with fantasy and adventure. Born May 15 1856, L Frank Baum is cherished today as the creator of the Land of Oz. The first of his fourteen OZ books, The Wonderful Wizard of Oz, was published in 1900. It has never been out of print since and in 1939 it was made into what would become one of the most beloved films of all time.","Category":{"CategoryName":"Classics"}},{"Author":"Joseph Conrad","Name":"Nostromo","Price":"5.90","Description":"Epic in scope and detail, populated by a vivid cast of characters covering the entire social spectrum, Nostromo is one of the greatest political novels ever written. It chronicles an era of political crisis in an imaginary but archetypal South American state, where the people of Sulaco are caught in a cycle of revolution and counter revolution, while trying to decide whether its wealthy silver mine, funded by Americans but owned by a third generation English immigrant, can be preserved from the hands of avaricious politicians. Greed and corruption are ubiquitous, and Nostromo, the principled Capataz, is tested to his limits. This richly dense picture of an insurrectionary society and the opportunities it provides for corruption is related with Conrad's dry, detached yet compassionate intelligence.","Category":{"CategoryName":"Classics"}},{"Author":"Mark Twain","Name":"Tom Sawyer And Huckleberry Finn","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"George Orwell","Name":"Keep the aspidistra flying","Price":"11.90","Description":"London, 1936. Gordon Comstock has declared war on the money god; and Gordon is losing the war. Nearly 30 and \"rather moth-eaten already,\" a poet whose one small book of verse has fallen \"flatter than any pancake,\" Gordon has given up a \"good\" job and gone to work in a bookshop at half his former salary. Always broke, but too proud to accept charity, he rarely sees his few friends and cannot get the virginal Rosemary to bed because (or so he believes), \"If you have no money ... women won't love you.\" On the windowsill of Gordon's shabby rooming-house room is a sickly but unkillable aspidistra--a plant he abhors as the banner of the sort of \"mingy, lower-middle-class decency\" he is fleeing in his downward flight.","Category":{"CategoryName":"Classics"}},{"Author":"Mario Puzo","Name":"The Godfather","Price":"11.90","Description":"Almost fifty years ago, a classic was born. A searing portrayal of the Mafia underworld, The Godfather introduced readers to the first family of American crime fiction, the Corleones, and their powerful legacy of tradition, blood, and honor. The seduction of power, the pitfalls of greed, and the allegiance to familyвЂ”these are the themes that have resonated with millions of readers around the world and made The Godfather the definitive novel of the violent subculture that, steeped in intrigue and controversy, remains indelibly etched in our collective consciousness.","Category":{"CategoryName":"Classics"}},{"Author":"George Orwell","Name":"Decline of the English Murder","Price":"12.90","Description":"In these timeless and witty essays George Orwell explores the English love of reading about a good murder in the papers (and laments the passing of the heyday of the 'perfect' murder involving class, sex and poisoning), as well as unfolding his trenchant views on everything from boys' weeklies to naughty seaside postcards.","Category":{"CategoryName":"Classics"}},{"Author":"Lewis Carroll","Name":"Alice's Adventures In Wonderland","Price":"15.90","Description":"First published in 1865, Alice's Adventures in Wonderland began as a story told to Alice Liddell and her two sisters on a boating trip in July of 1862. The novel follows Alice down a rabbit-hole and into a surreal world of strange and wonderful characters who constantly turn everything upside-down with their mind-boggling logic and word play, and their fantastic parodies. Carroll's fable illustrates his masterful ability to weave logic with nonsense in a tale that continues to delight all ages.While this great classic is widely available, the Broadview edition is unique. Richard Kelly combines Alice's Adventures in Wonderland not with the later (and largely distinct) work Through the Looking Glass but rather with Alice's Adventures Under Ground, Lewis Carroll's first version of the story. Readers are thus able to trace the literary revisions, and to compare Caroll's own illustrations in the original with the famous John Tenniel illustrations for Alice's Adventures in Wonderland. Among the many other materials included in the Broadview Literary Texts edition are a substantial selection of early reviews, selections from Carroll's diaries and correspondence, Carroll's early nonsense poems, and the originals of the poems parodied in his text.","Category":{"CategoryName":"Classics"}},{"Author":"Jack Kerouac","Name":"Big Sur","Price":"11.90","Description":"In 1960 Jack Kerouac was near breaking point. Driven mad by constant press attention in the wake of the publication of On the Road, he needed to 'get away to solitude again or die', so he withdrew to a cabin in Big Sur on the Californian coast. The resulting novel, in which his autobiographical hero Jack Duluoz wrestles with doubt, alcohol dependency and his urge towards self-destruction, is one of Kerouac's most personal and searingly honest works. Ending with the poem 'Sea: Sounds of the Pacific Ocean at Big Sur', it shows a man coming down from his hedonistic youth and trying to come to terms with fame, the world and himself.","Category":{"CategoryName":"Classics"}},{"Author":"Ray Bradbury","Name":"The Machineries Of Joy","Price":"11.90","Description":"Author of \"Fahrenheit 451\", \"The Martian Chronicles\" and \"Something Wicked This Comes\" amongst others, Ray Bradbury is seen as one of the 20th century's most celebrated writers. He has also written extensively for theatre and cinema - including the screenplay for John Huston's film of \"Moby Dick\".","Category":{"CategoryName":"Classics"}},{"Author":"Mikhail Bulgakov","Name":"White Guard","Price":"12.90","Description":"\"White Guard,\" Mikhail Bulgakov's semi-autobiographical first novel, is the story of the Turbin family in Kiev in 1918. Alexei, Elena, and Nikolka Turbin have just lost their mother--their father had died years before--and find themselves plunged into the chaotic civil war that erupted in the Ukraine in the wake of the Russian Revolution. In the context of this family's personal loss and the social turmoil surrounding them, Bulgakov creates a brilliant picture of the existential crises brought about by the revolution and the loss of social, moral, and political certainties.He confronts the reader with the bewildering cruelty that ripped Russian life apart at the beginning of the last century as well as with the extraordinary ways in which the Turbins preserved their humanity. In this volume Marian Schwartz, a leading translator, offers the first complete and accurate translation of the definitive original text of Bulgakov's novel. She includes the famous dream sequence, omitted in previous translations, and beautifully solves the stylistic issues raised by Bulgakov's ornamental prose. Readers with an interest in Russian literature, culture, or history will welcome this superb translation of Bulgakov's important early work. This edition also contains an informative historical essay by Evgeny Dobrenko.","Category":{"CategoryName":"Classics"}},{"Author":"Ernest Hemingway","Name":"Death In The Afternoon","Price":"11.90","Description":"A fascinating look at the history and grandeur of bullfighting, Death in the Afternoon is also a deeper contemplation on the nature of cowardice and bravery, sport and tragedy, and is enlivened throughout by Hemingway's pungent commentary on life and literature. Seen through his eyes, bullfighting becomes an art, a richly choreographed ballet, with performers who range from awkward amateurs to masters of great grace and cunning.","Category":{"CategoryName":"Classics"}},{"Author":"Ernest Hemingway","Name":"A farewell to arms","Price":"12.90","Description":"Written when Ernest Hemingway was thirty years old and lauded as the best American novel to emerge from World War I, A Farewell to Arms is the unforgettable story of an American ambulance driver on the Italian front and his passion for a beautiful English nurse. Set against the looming horrors of the battlefield - weary, demoralised men marching in the rain during the German attack on Caporetto; the profound struggle between loyalty and desertion - this gripping, semi-autobiographical work captures the harsh realities of war and the pain of lovers caught in its inexorable sweep. Ernest Hemingway famously said that he rewrote the ending to A Farewell to Arms thirty-nine times to get the words right. This edition collects all of the alternative endings together for the first time, along with early drafts of other essential passages, offering new insight into Hemingway's craft and creative process and the evolution of one of the greatest novels of the twentieth century. Featuring the Nobel Prize winner's own 1948 introduction to an illustrated reissue of the novel, a personal foreword by the author's son Patrick Hemingway, and a new introduction by the author's grandson Sean Hemingway, this edition of A Farewell to Arms is truly a celebration.","Category":{"CategoryName":"Classics"}},{"Author":"George Orwell","Name":"Down and out in Paris and London","Price":"12.90","Description":"George Orwell's vivid memoir of his time living among the desperately poor and destitute, Down and Out in Paris and London is a moving tour of the underworld of society. 'You have talked so often of going to the dogs - and well, here are the dogs, and you have reached them.' Written when Orwell was a struggling writer in his twenties, it documents his 'first contact with poverty'. Here, he painstakingly documents a world of unrelenting drudgery and squalor - sleeping in bug-infested hostels and doss houses of last resort, working as a dishwasher in Paris's vile 'Hotel X', surviving on scraps and cigarette butts, living alongside tramps, a star-gazing pavement artist and a starving Russian ex-army captain. Exposing a shocking, previously-hidden world to his readers, Orwell gave a human face to the statistics of poverty for the first time - and in doing so, found his voice as a writer.","Category":{"CategoryName":"Classics"}},{"Author":"Mikhail Bulgakov","Name":"The Master And Margarita","Price":"14.90","Description":"Mikhail Bulgakov's The Master and Margarita is a fiercely satirical fantasy that remained unpublished in its author's home country for over thirty years. This Penguin Classics edition is translated with an introduction by Richard Pevear and Larissa Volokhonsky, the acclaimed translators of Tolstoy's Anna Karenina. In Soviet Moscow, God is dead, but the devil - to say nothing of his retinue of demons, from a loudmouthed, gun-toting tomcat, to the fanged fallen angel Koroviev - is very much alive.","Category":{"CategoryName":"Classics"}},{"Author":"J. D. Salinger","Name":"The catcher in the Rye","Price":"13.90","Description":"J. D. Salinger wrote one of the most famous books ever written, The Catcher in the Rye. Salinger wrote many stories and, in 1941, after several rejections, Salinger finally cracked The New Yorker, with a story, \"Slight Rebellion Off Madison,\" that was an early sketch of what became a scene in \"The Catcher in the Rye.\" The magazine then had second thoughts in part because of World War II in which Salinger was in combat, and held the story for five years before finally publishing it in 1946, buried in the back of an issue. Everyone was surprised when the story and the book that followed it became a bit hit.","Category":{"CategoryName":"Classics"}},{"Author":"Maksim Gorky","Name":"The Mother","Price":"9.90","Description":"Inspired by real events and centring on the figure of Pelageya Vlasova - the \"mother\" of the title - and her son Pavel, Gorky's masterpiece describes the brutal life of ordinary Russian factory workers in the years leading to the 1905 Revolution and explores the rise of the proletariat, the role of women in society and the lower classes' struggle for self-affirmation. \"A book of the utmost importance\", in the words of Lenin, and a landmark in Russian literature, The Mother - here presented in a brilliant new version by Hugh Aplin, the first English translation in almost a century - will enchant modern readers both for its historical significance and its intrinsic value as a work of art.","Category":{"CategoryName":"Classics"}},{"Author":"D.H. Lawrence","Name":"Women In Love","Price":"5.90","Description":"Although D. H. Lawrence's stock has fallen in recent times there are now signs of a revival. Of all his works, Women in Love is widely regarded as the most complex and rewarding. Apart from the classic essay by Joyce Carol Oates, all the items collected in this volume were published after 1990. Written by scholars from the United Kingdom, France, Australia and Canada, as well as the United States, they illustrate both the way recent theoretical developments in literary studies can be made relevant to readings of Lawrence and the healthy persistence of traditional methods of analysis. They also reveal Women in Love as a twentieth century classic that continues to challenge its readers and refuses to be pigeonholed. College students will find this collection an invaluable aid in their efforts to come to terms with the novel and for those of their elders who admire Lawrence it will provide a convenient and interesting way of discovering the kind of reactions he has provoked in the last fifteen years. The collection also contains a photograph of the statuette that was quite clearly the inspiration of Lawrence's description of Loerke's Lady Godiva, along with a note from the scholar who has only very recently announced its discovery.","Category":{"CategoryName":"Classics"}},{"Author":"Kenneth Grahame","Name":"The wind in the willows","Price":"9.90","Description":"In Kenneth Grahame's The Wind in the Willows: A Children's Classic at 100, editors Jackie C. Horne and Donna R. White have assembled a collection of essays that look at the book in terms of class, gender and nationality, as well as its construction of heteronormative masculinity, the very English novel's appeal to Chinese readers, and the meaning of a text in which animals can be human-like, pets, servants, and even food.","Category":{"CategoryName":"Classics"}},{"Author":"T S Elliot","Name":"Old possums book of practical cats","Price":"13.90","Description":"This playful collection is the source of the fantastically successful Broadway musical, \"Cats\".","Category":{"CategoryName":"Classics"}},{"Author":"Marquis de Sade","Name":"The Mystified Magistrate","Price":"12.90","Description":"The Marquis de Sade is known variously to history as the Divine Marquis (the Surrealists) and that monster author (Napoleon)because of the daring originality and scandalous nature of much of his writing. What is less known, or virtually forgotten, is that he also possessed a dark but undeniable sense of humor. Visible in even his most outrageous and somber publications, it burst into full bloom in his shorter works of fiction. The great virtue of this volume is that it reveals that lighter, comic side of Sade. He was a man obsessed, like many great writers, and his obsessions are still present here: his hatred of all things pretentious, his loathing of a corrupt judicial system, his damning of hypocrisy and false piety. One of the great anarchists of all time, he was nevertheless far from mad (as many pretended) and these works of fiction shed another light on this most feverish of minds. But however heavy the subject, \"The Mystified Magistrate\" is infused with a light touch; it is revealing but never offensive. Skyhorse Publishing, as well as our Arcade, Yucca, and Good Books imprints, are proud to publish a broad range of books for readers interested in fictionnovels, novellas, political and medical thrillers, comedy, satire, historical fiction, romance, erotic and love stories, mystery, classic literature, folklore and mythology, literary classics including Shakespeare, Dumas, Wilde, Cather, and much more. While not every title we publish becomes a \"New York Times\" bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.\"","Category":{"CategoryName":"Classics"}},{"Author":"Kipling","Name":"The Best Short Stories","Price":"5.90","Description":"Guy de Maupassant was a master of the short story. This collection displays his lively diversity, with tales that vary in theme and tone, ranging from tragedy and satire to comedy and farce. In a lucidly direct style, he provides unflinching realism and sceptical irony. He depicts the deceptions, hypocrisies and vanities at different levels of society. Prostitution is frankly described, while the harshness of war is deftly exposed. His tales have been televised and have influenced films, operas and rock music. Unillusioned but humane, Maupassant remains our contemporary.&nbsp;","Category":{"CategoryName":"Classics"}},{"Author":"John Buchan","Name":"The Complete Richard Hannay Stories","Price":"9.90","Description":"Major General Sir Richard Hannay is the fictional secret agent created by writer and diplomat John Buchan, who was himself an Intelligence officer during the First World War. The strong and silent type, combining the dour temperament of the Scot with the stiff upper lip of the Englishman, Hannay is pre eminent among early spy thriller heroes. Caught up in the first of these five gripping adventures just before the outbreak of war in 1914, he manages to thwart the enemy's evil plan and solve the mystery of the 'thirty nine steps'. In Greenmantle, he undertakes a vital mission to prevent jihad in the Islamic Near East. Mr Standfast, set in the decisive months of 1917 18, is the novel in which Hannay, after a life lived 'wholly among men', finally falls in love; later, in The Three Hostages, he finds himself unravelling a kidnapping mystery with his wife's help. In the last adventure, The Island of Sheep, he is called upon to honour an old oath. A shrewd judge of men, he never dehumanises his enemy, and despite sharing some of the racial prejudices of his day, Richard Hannay is a worthy prototype hero of espionage fiction.","Category":{"CategoryName":"Classics"}},{"Author":"Alexandre Dumas","Name":"Twenty Years After","Price":"5.90","Description":"With an Introduction by A. M. de Medeiros, University of Kent at Canterbury. A year after the publication of The Three Musketeers,/em&gt;, Alexandre Dumas produced a sequel worthy in every respect of the original. In Twenty Years After the much beloved D'Artaganan, Athos, Porthos and Aramis reunite to fight the forces of evil. In the original novel they defeated Milady, a formidable foe; now they need to face her vengeful son Mordaunt, as well as countering the machinations of the sinister Cardinal Mazarin. Their adventures also take them to England, where Cromwell is about to topple Charles I. Meanwhile, they must overcome the obstacles which the passing of time has placed between them. Rediscovering strength in unity, they fight for Queen and country. The Musketeer novels were a huge success in Dumas' own lifetime, and have lost none of their original appeal. Translated into many languages and adapted for cinema and television, they have helped to make Dumas arguably the most successful exporter of French culture to the wider world. Our edition is based on the William Robson translation first published by Routledge in 1856.","Category":{"CategoryName":"Classics"}},{"Author":"Joseph Conrad","Name":"Almayer'S Folly &amp; The Rover","Price":"5.90","Description":"From the rain forests of Almayer's Folly to the Mediterranean coast of The Rover, Conrad's first and final completed novels are played out against contrasting backgrounds. Almayer, in Borneo, is hopelessly obsessed by his deluded dreams for himself and his daughter, which take no account of her falling in love with a handsome Balinese prince. Peyrol, the rover, returns to a France at war and finds the actions of those around him still overborne by memories of revolutionary terror. For the orphaned Lieutenant Real and Arlette love offers release but their romance seems doomed by the demands of his naval duties. Conrad's acute understanding of human psychology and its application across racial and ideological divides is the life force of both stories.","Category":{"CategoryName":"Classics"}},{"Author":"Mary Shelley","Name":"The Last Man","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"D H Lawrence","Name":"Lady Chatterley's Lover","Price":"5.90","Description":"Notes and Introduction by David Ellis, University of Kent at Canterbury. With its four letter words and its explicit descriptions of sexual intercourse, Lady Chatterley's Lover is the novel with which D.H. Lawrence is most often associated. First published privately in Florence in 1928, it only became a world wide best seller after Penguin Books had successfully resisted an attempt by the British Director of Public Prosecutions to prevent them offering an unexpurgated edition. The famous 'Lady Chatterley trial' heralded the sexual revolution of the coming decades and signalled the defeat of Establishment prudery. Yet Lawrence himself was hardly a liberationist and the conservativism of many aspects of his novel would later lay it open to attacks from the political avant garde and from feminists. The story of how the wife of Sir Clifford Chatterley responds when her husband returns from the war paralysed from the waist down, and of the tender love which then develops between her and her husband's gamekeeper, is a complex one open to a variety of conflicting interpretations. This edition of the novel offers an occasion for a new generation of readers to discover what all the fuss was about; to appraise Lawrence's bitter indictment of modern industrial society, and to ask themselves what lessons there might be for the 21st century in his intense exploration of the complicated relations between love and sex.","Category":{"CategoryName":"Classics"}},{"Author":"The Pilgrim's Progress","Name":"J Bunyan","Price":"11.90","Description":"With an Introduction by Professor Stuart Sim. John Bunyan was variously a tinker, soldier, Baptist minister, prisoner and writer of outstanding narrative genius which reached its apotheosis in this, his greatest work. It is an allegory of the Christian life of true brilliance and is presented as a dream which describes the pilgrimage of the hero   Christian   from the City of Destruction via the Slough of Despond, the Hill of Difficulty, the Valley of the Shadow of Death and Vanity Fair over the River of the Water of Life and into the Celestial City. The Pilgrim's Progress has been translated into 108 languages, was a favourite of Dr Johnson and was praised by Coleridge as one of the few books which might be read repeatedly and each time with a new and different pleasure.","Category":{"CategoryName":"Classics"}},{"Author":"D H Lawrence","Name":"The Virgin And The Gypsy","Price":"5.90","Description":"With an Introduction and Notes by Jeff Wallace, University of Glamorgan. These stories of myth and resurrection, of uncanny events and violent impulse, were with one exception written and published in the latter half of the 1920s, coinciding with the composition of Lawrence's controversial masterpiece Lady Chatterley's Lover. At this time Lawrence declared himself to be 'really awful sick of writing'; yet here we find some of his most beautiful, hauntingly melancholy fictions. In struggling to escape from their thwarted lives and to achieve human 'tenderness', the characters embody and continue the major preoccupations of Lawrence's work as a whole. Love Among the Haystacks provides an early illustration of the intensity and innovation which made Lawrence one of the most distinctive and important of twentieth century writers.","Category":{"CategoryName":"Classics"}},{"Author":"Mark Twain","Name":"Life Of The Mississippi","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Joseph Conrad","Name":"The Secret Agent","Price":"5.90","Description":"The Secret Agent 1907) is a compelling tale of espionage and terrorism set in Edwardian London. This new edition is based on a painstaking comparison of the original manuscript of the work.","Category":{"CategoryName":"Classics"}},{"Author":"Alexandre Dumas","Name":"The Count Of Monte Cristo","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Leo Tolstoy","Name":"The Death Of Ivan Ilyich And Other Stories","Price":"5.90","Description":"With an Introduction and Notes by Dr T.C.B.Cook. Count Leo Tolstoy 1828 1910) is best known for War and Peace and Anna Karenina, commonly regarded as amongst the greatest novels ever written. He also, however, wrote many masterly short stories, and this volume contains four of the longest and best in distinguished translations that have stood the test of time. In the early story Family Happiness, Tolstoy explores courtship and marriage from the point of view of a young wife. In The Kreutzer Sonata he gives us a terrifying study of marital breakdown, in The Devil a powerful depiction of the power of sexual temptation, and, in perhaps the finest of all, The Death of Ivan Ilyich, he portrays the long agony of a man gradually coming to terms with his own mortality. This volume also includes an Introduction and Notes written specially for this Wordsworth edition by Dr Tim Cook, formely lecturer in literature at the Universities of Kingston and Ulster. Previous work contributed by Dr Cook for Wordsworth includes an introduction and notes to Charles Dickens' Nicholas Nickleby.","Category":{"CategoryName":"Classics"}},{"Author":"The Man in the Iron Mask","Name":"Alexandre Dumas","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"D H Lawrence","Name":"The plumed serpent","Price":"5.90","Description":"Introduced by Cedric Watts, Research Professor of English, University of Sussex. In this notorious late novel, Lawrence's pagan imaginings burgeon. Kate Leslie, an Irish widow touring Mexico, becomes gradually involved with a charismatic leader, and she enters a sexual relationship with his dark henchman. As the two men conspire to revive the old Aztec religion and seize power, Kate is increasingly implicated in their 'blood consciousness', phallic propaganda and right wing violence. The Plumed Serpent abounds in the 'politically incorrect': Lawrence retains his power to shock. As a publisher once said, 'Anything to do with D. H. L. is rather dangerous.'","Category":{"CategoryName":"Classics"}},{"Author":"Anthony Trollope","Name":"The Way We Live Now","Price":"6.90","Description":"With an Introduction and Notes by Peter Merchant. Canterbury Christ Church College. The tough mindedness of the social satire in and its air of palpable integrity give this novel a special place in Anthony Trollope's Literary career. Trollope paints a picture as panoramic as his title promises, of the life of 1870s London, the loves of those drawn to and through the city, and the career of Augustus Melmotte. Melmotte is one of the Victorian novel's greatest and strangest creations, and is an achievement undimmed by the passage of time. Trollope's 'Now' might, in the twenty first century, look like some distant disenchanted 'Then', but this is still the yesterday which we must understand in order to make proper sense of our today.","Category":{"CategoryName":"Classics"}},{"Author":"Leo Tolstoy","Name":"The Cossacks And Other Stories","Price":"5.90","Description":"In collecting \"The Cossacks,\" \"Sevastopol Sketches,\" and \"Hadji Murad\" together in \"The Cossacks and Other Stories\" we find several episodes in which Tolstoy draws upon his own experiences and attempts to portray a contemporary Russian society. Tolstoy, who had served as a second lieutenant in an artillery regiment during the Crimean War, recounts his experiences there during the Siege of Sevastopol in the three episodes of \"Sevastopol Sketches.\" In \"The Cossacks\" Tolstoy again draws upon his experiences, this time in the Caucasus during the last stages of the Caucasian War. \"The Cossacks\" is the story of Dmitriy Olenin, a young idealist, who leaves Moscow to start a new life in the Caucasus. Finally in this work we find \"Hadji Murad,\" Tolstoy's final published work, the story of its titular character, an Avar rebel commander who, for reasons of personal revenge, forges an uneasy alliance with the Russians he had been fighting. This collection provides a representative example of Tolstoy's writing and his masterful illustration of his country during the 19th century.","Category":{"CategoryName":"Classics"}},{"Author":"Katherine Mansfield","Name":"The Collected Short Stories of Katherine Mansfield","Price":"5.90","Description":"With an Introduction and Notes by Professor Stephen Arkin, San Francisco State University. Katherine Mansfield is widely regarded as a writer who helped create the modern short story. Born in Wellington, New Zealand in 1888, she came to London in 1903 to attend Queen's College and returned permanently in 1908. her first book of stories, In a German Pension, appeared in 1911, and she went on to write and publish an extraordinary body of work. This edition of The Collected Stories brings together all of the stories that Mansfield had written up until her death in January of 1923. With an introduction and head notes, this volume allows the reader to become familiar with the complete range of Mansfield's work from the early, satirical stories set in Bavaria, through the luminous recollections of her childhood in New Zealand, and through the mature, deeply felt stories of her last years. Admired by Virginia Woolf in her lifetime and by many writers since her death, Katherine Mansfield is one of the great literary artists of the twentieth century","Category":{"CategoryName":"Classics"}},{"Author":"Mark Twain","Name":"The Innocents Abroad","Price":"5.90","Description":"No description available","Category":{"CategoryName":"Classics"}},{"Author":"Anthony Trollope","Name":"The Warden","Price":"7.90","Description":"Should Septimus Harding leave his job as warden of Hiram's Hospital? It seems a simple choice to make, but soon his family, friends, the people of the town and the church, and eventually the whole country are talking about it. \"Penguin Readers\" is a series of simplified novels, film novelizations and original titles that introduce students at all levels to the pleasures of reading in English. Originally designed for teaching English as a foreign language, the series' combination of high interest level and low reading age makes it suitable for both English speaking teenagers with limited reading skills and students of English as a second language. Many titles in the series also provide access to the pre 20th century literature strands of the National Curriculum English Orders. \"Penguin Readers\" are graded at seven levels of difficulty, from \"Easystarts\" with a 200 word vocabulary, to Level 6 Advanced) with a 3000 word vocabulary. In addition, titles fall into one of three sub categories: \"Contemporary\", \"Classics\" or \"Originals\". At the end of each book there is a section of enjoyable exercises focusing on vocabulary building, comprehension, discussion and writing. Some titles in the series are available with an accompanying audio cassette, or in a book and cassette pack. Additionally, selected titles have free accompanying \"Penguin Readers Factsheets\" which provide stimulating exercise material for students, as well as suggestions for teachers on how to exploit the Readers in class.","Category":{"CategoryName":"Classics"}},{"Author":"Anthony Trollope","Name":"The Small House At Allington","Price":"7.90","Description":"Lily Dale, the bewitching heroine of The Small House at Allington, so endeared herself to the novel's first readers that they bombarded Trollope with letters begging him to give her story a happy ending. Lily is the niece of Squire Dale, an embittered old bachelor entrenched in the 'Great House' at Allington. His sister in law lives at the adjacent 'Small House' with her two daughters Lily and Bell, and the romantic entanglements of the two girls, and relations between the two houses, lie at the heart of the novel. The memorable cast of characters includes Sir Raffle Buffle, the bullying head of a government department, the heartless Lady Dumbello, and the shallow Adolphus Crosbie, who gets his just deserts in the form of the frigid Lady Alexandrina de Courcy. In what was to become the fifth of the six Barsetshire novels, Trollope develops his characteristic theme of the invasion of a pastoral, conservative world by brash and progressive forces from London. Gracious country living, with croquet and tea on the lawn, is vividly contrasted with the cut and thrust of London life in the 1860s.","Category":{"CategoryName":"Classics"}},{"Author":"Anthony Trollope","Name":"Doctor Wortle's School","Price":"7.90","Description":"Trollope's most \"subversive\" novel, this is a wide ranging condemnation of group morals, collective prejudice and the devastating power that conventional values have upon well intentioned individuals.","Category":{"CategoryName":"Classics"}}]