[{"Author":"Roger Zelazny","Name":"The hand of Oberon","Price":"11.90","Description":"Corwin and the remaining princes of Amber must call upon all of their superhuman powers to defeat their brother-turned-traitor.","Category":{"CategoryName":"Fantasy"}},{"Author":"Mike Ashley","Name":"The mammoth book of seriously comic fantasy","Price":"13.90","Description":"From Greek goddesses putting down insurrection among unruly mortals to stranded aliens escaping earth in a church converted into a rocket, and an intrepid time traveller attempting to steal the universe, this collection of bizarre comic fantasies come from a range of inventive minds, including: John Cleese, Connie Booth, Tom Holt, and Craig Shaw Gardener.","Category":{"CategoryName":"Fantasy"}},{"Author":"Cassandra Clare","Name":"City of Bones","Price":"12.90","Description":"Irresistibly drawn towards a group of demon hunters, Clary encounters the dark side of New York City and the dangers of forbidden love. Read all the sensational books in The Shadowhunter Chronicles: The Mortal Instruments, The Infernal Devices, Tales from the Shadowhunter Academy, The Bane Chronicles and The Shadowhunter's Codex.","Category":{"CategoryName":"Fantasy"}},{"Author":"Roger Zelazny","Name":"Trumps of Doom","Price":"13.90","Description":"Merle Corey is a brilliant young computer designer in San Francisco, but, he is also Merlin, son of Corwin, vanished prince of Amber, and heir to his father's wonderous powers. And, someone is determined to kill him. Now he will begin a desperate race through Shadow, not only to escape the mysterious force that threatens his life, but to protect the deadly secret that could destroy both his worlds.","Category":{"CategoryName":"Fantasy"}},{"Author":"Ben Okri","Name":"The famished road","Price":"12.90","Description":"Azaro is a spirit child who is born only to live for a short while before returning to the idyllic world of his spirit companions. Now he has chosen to stay in the world of the living.","Category":{"CategoryName":"Fantasy"}},{"Author":"Ursula K. Le Guin","Name":"Gifts","Price":"15.90","Description":"Orrec is the son of the Brantor of Caspromant; Gry the daughter of the Brantors of Barre and Rodd. They have grown up together in neighbouring domains, running half-wild across the Uplands. The people of the domains are like their land: harsh and fierce and prideful; ever at war with each other, raiding cattle, capturing serfs, enlarging their holdings.It is only the gifts that keep a fragile peace. The gifts are powers, running from father to son and from mother to daughter. The Barre gift is calling animals. The women of Cordemant have the power of blinding, or making deaf, or taking away speech. The Rodds can send a spellknife into a man's heart, or cut his throat, or maim as they please, if he's in sight.The Callems can move heavy things by word and gesture - even buildings, even hills. And Brantor Ogge of Drummant has the gift of slow wasting. The Caspro gift is the worst and best of all: it is the gift of undoing: an insect, an animal, a place ...Orrec and Gry are the heirs to Caspro and Barre. Gry's gift runs true, but unlike her mother, she will not use it to call animals for the hunt.Orrec too is a problem, for his gift of undoing is wild: he cannot control it - and that is the most dangerous gift of all ...GIFTS is Ursula Le Guin at her best: an exciting, moving story beautifully told.","Category":{"CategoryName":"Fantasy"}},{"Author":"J.K. Rowling","Name":"Harry Potter And The Chamber Of Secrets","Price":"12.90","Description":"The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"The Last Continent","Price":"11.90","Description":"There's nothing like the issue of evolution to get under the skin of academics. Even if their field of expertise is magic rather than biology. With the best and most interfering minds of Unseen University somehow left in charge at a critical evolutionary turning point, the Discworld's last continent needs a saviour...","Category":{"CategoryName":"Fantasy"}},{"Author":"Andrzej Sapkowski","Name":"The tower of the swallow","Price":"45.90","Description":"The world has fallen into war. Ciri, the child of prophecy, has vanished. Hunted by friends and foes alike, she has taken on the guise of a petty bandit and lives free for the first time in her life. But the net around her is closing. Geralt, the Witcher, has assembled a group of allies determined to rescue her. Both sides of the war have sent brutal mercenaries to hunt her down. Her crimes have made her famous. There is only one place left to run. The tower of the swallow is waiting...","Category":{"CategoryName":"Fantasy"}},{"Author":"Andrzej Sapkowski","Name":"Sword of Destiny","Price":"23.90","Description":"Geralt is a witcher, a man whose magic powers, enhanced by long training and a mysterious elixir, have made him a brilliant fighter and a merciless assassin. Yet he is no ordinary murderer: his targets are the multifarious monsters and vile fiends that ravage the land and attack the innocent. He roams the country seeking assignments, but gradually comes to realise that while some of his quarry are unremittingly vile, vicious grotesques, others are the victims of sin, evil or simple naivety. In this collection of short stories, following the adventures of the hit collection THE LAST WISH, join Geralt as he battles monsters, demons and prejudices alike ...","Category":{"CategoryName":"Fantasy"}},{"Author":"Andrzej Sapkowski","Name":"Time of contempt","Price":"23.90","Description":"Geralt the Witcher has fought monsters and demons across the land, but even he may not be prepared for what is happening to his world. The kings and armies are manoeuvring for position, each fearing invasion from across the river, each fearing their neighbours more. Intrigue, dissent and rebellion are on all sides. The Elves and other non-humans are still suffering under decades of repression, and growing numbers join the commando units hidden deep in the forest, striking at will and then dissolving into the trees. The Magicians are fighting amongst themselves, some in the pay of the kings, some sympathetic to the elves. And against this backdrop of fear and contempt Geralt and his lover Yennefer must protect Ciri, orphaned heir and sought by all sides. For the prophecy rests on her, and whether she lives or dies she has the power to save the world - or perhaps end it.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Truckers","Price":"7.90","Description":"After generations of existing in the human-sized world, a group of four-inch-high nomes discover their true nature and origin, with the help of a black square called the Thing.","Category":{"CategoryName":"Fantasy"}},{"Author":"Isaac Asimov","Name":"Mammoth Book Of Short Fantasy Novels","Price":"13.90","Description":"The Gate of the Flying Knives by Poul AndersonUnicorn Tapestry by Suzy McKee CharnasSleep Well of Nights by Avram DavidsonBlack Heart and White Heart by Sir H. Rider HaggardRed Nails by Robert E. HowardStorm in a Bottle by John Jakes","Category":{"CategoryName":"Fantasy"}},{"Author":"Cassandra Clarke","Name":"The mortal instruments 3 City of Glass","Price":"11.90","Description":"Third in Cassandra Clare's internationally bestselling Mortal Instruments series about the Shadowhunters. Discover more secrets about the Shadowhunters in the third of 6 brand-new collectable editions of the internationally bestselling Mortal Instruments series. Amid the chaos of war, the Shadowhunters must decide to fight with the vampires, werewolves and other Downworlders - or against them. Meanwhile, Jace and Clary have their own decision to make: should they pursue the love they know is a mortal sin? Gorgeous cover illustration by Mila Furstova, the artist who created the album art for Coldplay's Ghost Stories. Read all the sensational books in The Shadowhunter Chronicles: The Mortal Instruments, The Infernal Devices, Tales from the Shadowhunter Academy, The Bane Chronicles, The Dark Artifices, The Last Hours and The Shadowhunter's Codex.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Goodkind","Name":"Naked empire","Price":"12.90","Description":"From internationally bestselling author Terry Goodkind, comes this outstanding epic adventure set in the captivating world of his classic Sword of Truth novels. The Sword of Truth is Terry Goodkind's wonderfully creative, seamless, and stirring epic fantasy set in a fascinating world rich in detail, history and incredible violence. Nakled Empire provides a perfect jumping-in point for new readers.","Category":{"CategoryName":"Fantasy"}},{"Author":"Arthur C Clarke","Name":"Garden of Rama","Price":"11.90","Description":"In the year 2130 a mysterious spaceship, Rama, arrived in the solar system. It was huge, but empty - apparently abandoned. By the time Rama departed for its next unknown destination many wonders had been uncovered, but few mysteries solved. Only one thing was clear: everything the enigmatic builders of Rama did, they did in threes. Eighty years later the second alien craft arrived in the solar system.","Category":{"CategoryName":"Fantasy"}},{"Author":"Luc Besson","Name":"Arthur and the minimoys","Price":"11.90","Description":"Arthur has read all about the tribe in his grandfather's notebooks, but he can hardly believe they are less than an inch tall. Until one day he discovers a secret message and a map to the land of the Minimoys, hidden by his vanished grandfather, which sets him off on a wild adventure. Arthur has three days to discover the Minimoys, recover stolen treasure, fight a force of mosquito-riding warriors, defeat an evil wizard and return to save the family home. All the more difficult if you have been shrunk to the size of a Minimoy...This is the first exciting part of the Minimoys adventure, by the acclaimed writer and film-maker Luc Besson. This and the second are being made into a film, released in 2006.","Category":{"CategoryName":"Fantasy"}},{"Author":"Cassandra Clare","Name":"City of fallen angels","Price":"12.90","Description":"Simon Lewis is having some trouble adjusting to his new life as a vampire, especially now that he hardly sees his best friend Clary, who is caught up in training to be a Shadowhunter - and spending time with her new boyfriend, Jace. Simon decides he needs a break and heads out of the city - only to discover that sinister events are following him. Realizing that the war they thought they'd won might not yet be over, Simon has to call on his Shadowhunter friends to save the day - if they can put their own splintering relationships on hold long enough to rise to the challenge.","Category":{"CategoryName":"Fantasy"}},{"Author":"J.K. Rowling","Name":"Harry Potter and the Deathly Hallows","Price":"15.90","Description":"As he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is now broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves, and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy. These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Goodkind","Name":"The pillars of creation","Price":"13.90","Description":"FAITH OF THE FALLEN took The Sword of Truth into a new decade and onto new heights of intense, thoughtful and meaningful fantasy while never losing sight of the need to tell a compelling and sweeping story. THE PILLARS OF CREATION continues that progression and is written so that new readers to the series can plunge into the richness of his world. Terry Goodkind investigates new depths in his characters and is working to change fantasy and to make The Sword of Truth the dominant fantasy series of the first decade of the new millennium. The new novel introduces a new character, Jennsen, and takes Richard and Kahlan to the ends of the earth as they attempts to track down an unstoppable demon before it kills them and lays waste to the world.","Category":{"CategoryName":"Fantasy"}},{"Author":"Cassandra Clare","Name":"The Mortal Instruments 2: City of Ashes","Price":"12.90","Description":"Second in Cassandra Clare's internationally bestselling Mortal Instruments series about the Shadowhunters. Discover more secrets about the Shadowhunters in the second of 6 brand-new collectable editions of the internationally bestselling Mortal Instruments series. Love and power are the deadliest temptations...Haunted by her past, Clary is dragged deeper into New York City's terrifying underworld of demons and Shadowhunters - but can she control her feelings for a boy who can never be hers? Gorgeous cover illustration by Mila Furstova, the artist who created the album art for Coldplay's Ghost Stories. Read all the sensational books in The Shadowhunter Chronicles: The Mortal Instruments, The Infernal Devices, Tales from the Shadowhunter Academy, The Bane Chronicles, The Dark Artifices, The Last Hours and The Shadowhunter's Codex.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Goodkind","Name":"Faith of the fallen","Price":"11.90","Description":"SOUL OF THE FIRE saw the political machinations that have dogged the midlands reach new heights, as the Chimes ran free and threatened magic everywhere. As the novel ended, Kahlan has narrowly avoided death and now she and Richard Rahl, the Seeker, must strive again to save the world from the resurgent armies of the Emperor Jagang. From the very first page, FAITH OF THE FALLEN pitches Richard and Kahlan into their most desperate fight yet - a fight where worlds once again hang in the balance. Richard must embark on a course of action that will leave his people feeling betrayed and vulnerable, and which will take both he and Kahlan away from the protection of the D'Haran armies. But he has no choice. Richard, who distrusts prophecy more than anyone, has had a vision. It is a vision he is compelled to follow.","Category":{"CategoryName":"Fantasy"}},{"Author":"Michael Alexander","Name":"Beowulf","Price":"12.90","Description":"Finest heroic poem in Old English celebrates the exploits of Beowulf, a young nobleman of southern Sweden. Combines myth, Christian and pagan elements, and history into a powerful narrative. Genealogies.","Category":{"CategoryName":"Fantasy"}},{"Author":"Sergei Lukyanenko","Name":"The night watch","Price":"13.90","Description":"Anton, a young Other, who owes allegiance to the Light, is a Night Watch agent, patrolling the streets and metro of the city, as he protects ordinary people from the vampires of the Dark. On his rounds, Anton comes across a young woman, Svetlana, who he realises is under a curse that threatens the entire city.","Category":{"CategoryName":"Fantasy"}},{"Author":"Philip Pullman","Name":"The Subtle Knife","Price":"11.90","Description":"The world of Cittagazze is an unsettling place: silent, empty streets, the threat of horrible death from the soul-eating Spectres from which only children are safe. Into this world comes Will, a 12 year old boy who has just killed a man. On the run, he meets a strange young girl called Lyra. Their paths take them to the mysterious Torre degli Angeli, where they must somehow acquire Cittagazze's most important secret: an object which people from many worlds would kill to possess. But Will has his own task as well: he must find the father he has never known. Could it be that this quest, and Lyra's, are a part of the same larger one? The Subtle Knife is part 2 of the trilogy His Dark Materials.&nbsp;","Category":{"CategoryName":"Fantasy"}},{"Author":"Ursula K. Le Guin","Name":"A Wizard Of Earthsea","Price":"11.90","Description":"The first book of Earthsea by Ursula Le Guin is a tale of wizards, dragons and terrifying shadows. The island of Gont is a land famous for wizards. Of these, some say the greatest - and surely the greatest voyager - is the man called Sparrowhawk. As a reckless, awkward boy, he discovered the great power that was in him - with terrifying consequences. Tempted by pride to try spells beyond his means, Sparrowhawk lets loose an evil shadow-beast in his land. Only he can destroy it, and the quest leads him to the farthest corner of Earthsea.","Category":{"CategoryName":"Fantasy"}},{"Author":"Christopher Paolini","Name":"Eragon","Price":"11.90","Description":"When Eragon finds a polished stone in the forest, he thinks it is the lucky discovery of a poor farm boy; perhaps it will buy his family meat for the winter. But when the stone brings a dragon hatching, Eragon realises he has stumbled upon a legacy nearly as old as the Empire itself. Overnight his simple life is shattered and he is thrust into a perilous new world of destiny, magic and power. With only an ancient sword and the advice of an old storyteller for guidance, Eragon and the fledgling dragon must navigate the dangerous terrain and dark enemies of an Empire ruled by an evil King. Can Eragon take up the mantle of the legendary Dragon Riders? The fate of the Empire may rest in his hands...The author is Christopher Paolini.","Category":{"CategoryName":"Fantasy"}},{"Author":"J.R.R Tolkien","Name":"The Hobbit","Price":"12.90","Description":"Bilbo Baggins enjoys a quiet and contented life, with no desire to travel far from the comforts of home; then one day the wizard Gandalf and a band of dwarves arrive unexpectedly and enlist his services - as a burglar - on a dangerous expedition to raid the treasure-hoard of Smaug the dragon. Bilbo's life is never to be the same again. The Hobbit became an instant success when it was first published in 1937, and more than 60 years later Tolkien's epic tale of elves, dwarves, trolls, goblins, myth, magic and adventure, with its reluctant hero Bilbo Baggins, has lost none of its appeal. Bilbo Baggins has taken his place among the ranks of the immortals of children's fiction. Written by Professor Tolkien for his own children, The Hobbit met with instant critical acclaim when published - it was the Harry Potter of its generation.","Category":{"CategoryName":"Fantasy"}},{"Author":"J.R.R. Tolkien","Name":"The Silmarillion","Price":"13.90","Description":"Designed to take fans of The Hobbit and The Lord of the Rings deeper into the myths and legends of Middle-earth The Silmarillion is an account of the Elder Days, of the First Age of Tolkien's world. It is the ancient drama to which the characters in The Lord of the Rings look back, and in whose events some of them such as Elrond and Galadriel took part. The tales of The Silmarillion are set in an age when Morgoth, the first Dark Lord, dwelt in Middle-Earth, and the High Elves made war upon him for the recovery of the Silmarils, the jewels containing the pure light of Valinor. Included in the book are several shorter works. The Ainulindale is a myth of the Creation and in the Valaquenta the nature and powers of each of the gods is described. The Akallabeth recounts the downfall of the great island kingdom of Numenor at the end of the Second Age and Of the Rings of Power tells of the great events at the end of the Third Age, as narrated in The Lord of the Rings. This pivotal work features the revised, corrected text and includes, by way of an introduction, a fascinating letter written by Tolkien in 1951 in which he gives a full explanation of how he conceived the early Ages of Middle-earth.","Category":{"CategoryName":"Fantasy"}},{"Author":"J.K. Rowling","Name":"Harry Potter And The Half Blood Prince","Price":"16.90","Description":"J.K. Rowling | Harry Potter And The Half Blood PrinceHarry has yet again spent the summer holidays at the Dursleys'. He has had plenty to think about, though- from the death of his beloved godfather Sirius Black, to the terrifying chase through the Ministry of Magic by the Death Eaters, to the fierce duel he witnessed between Professor Dumbledore and Lord Voldemort. Now he is waiting nervously in his bedroom at the Dursleys' for a visit from his headmaster. Harry can't think why Dumbledore would want to visit him now. What is that cannot possibly wait until the beginning of term? He is also not quite sure how the Dursleys will react to the Headmaster's sudden appearance in their own home.&nbsp;","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book YEARBOOK DIARY Terry Pratchett","Name":"Unknown","Price":"129.90","Description":"Signed Book YEARBOOK DIARY Terry PratchettOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller&nbsp;of limited and exclusive products.One of the splendid miscellany of books about Discworld with no specific novel value, but with background details in that no fan would&nbsp;dream&nbsp;of not knowing, such as the traditions of the Fool's Guild, full lists of teaching staff, high days and holidays, and famous dates and alumni of the Guild.Illustrated by: Mr. Paul KidbyCo-author: Stephen BriggsWarning: Some of the pages have traces of wetting.","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book MAKING MONEY Terry Pratchett","Name":"Unknown","Price":"129.90","Description":"Signed Book MAKING MONEY Terry PratchettOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.ItвЂ™s an offer you canвЂ™t refuse.&nbsp;Who would not to wish to be the man in charge of Ankh-MorporkвЂ™s Royal Mint and the bank next door?&nbsp;ItвЂ™s a job for life. But, as former con-man Moist von Lipwig is learning, the life is not necessarily for long.&nbsp;The Chief Cashier is almost certainly a vampire. ThereвЂ™s something nameless in the cellar (and the cellar itself is pretty nameless), it turns out that the Royal Mintruns at a loss. A 300 year old wizard is after his girlfriend, heвЂ™s about to be exposed as a fraud, but the Assassins Guild might get him first. In fact lot of people want him deadOh. And every day he has to take the Chairman for walkies.&nbsp;Everywhere he looks heвЂ™s making enemies.What he should be doing is... Making Money!","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book MASKERADE Terry Pratchett","Name":"Unknown","Price":"129.90","Description":"Signed Book MASKERADE Terry PratchettOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Granny Weatherwax and Nanny Ogg, the Discworld's greatest witches, are back for an innocent night at the opera. Naturally there's going to be trouble, but at the same time there'll be a good evening's entertainment with murders that you can really hum to.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Thief Of Time","Price":"15.90","Description":"Time is a resource. Everyone knows it has to be managed. You mess with it at your peril. You can let it move fast or slowly but what you mustn't do is allow it to stop. On the Discworld time management is the job of the Monks of History, who store it and pump it from the places where it's wasted (like the underwater - how much time does a codfish need?) to places like cities, where there's never enough time. But the construction of the world's first truly accurate clock starts a race against, well, time for Lu Tze and his apprentice Lobsang Ludd. Because it will stop time. And when time stands still, everything stops with it. Then, there really is no future.","Category":{"CategoryName":"Fantasy"}},{"Author":"J. K. Rowling","Name":"Harry Potter and the cursed child","Price":"46.90","Description":"J. K. Rowling | Harry Potter and the cursed childIt was always difficult being Harry Potter and it isn't much easier now that he is an overworked employee of the Ministry of Magic, a husband, and father of three school-age children. While Harry grapples with a past that refuses to stay where it belongs, his youngest son Albus must struggle with the weight of a family legacy he never wanted. As past and present fuse ominously, both father and son learn the uncomfortable truth: sometimes, darkness comes from unexpected places.","Category":{"CategoryName":"Fantasy"}},{"Author":"C. S. Lewis","Name":"Tales of Narnia","Price":"16.90","Description":"An alternative reading order based solely on the internal chronology of the novels with the exception of&nbsp;The Horse and His Boy&nbsp;which takes place&nbsp;during&nbsp;the time frame of the final few pages of&nbsp;The Lion, the Witch, and the Wardrobe. Note that this reading order only dates from 1994, more than 30 years after C.S. Lewis died.","Category":{"CategoryName":"Fantasy"}},{"Author":"Neil Gaiman","Name":"Stardust","Price":"12.90","Description":"From multi award-winning creator of \"The Sandman\", Neil Gaiman, comes the incredible work that broke new ground in graphic novel storytelling, re-issued in a deluxe hardback edition with a new cover and eight additional pages of bonus material. Together with acclaimed artist Charles Vess, Gaiman returns to the realm of Faerie for a lavishly illustrated tale of an ancient world where magic and humanity mingle in extraordinary ways. Gaiman's exquisitely crafted text and Vess' breathtaking illustrations combine to create a novel with pictures, an adult fairy tale that plunges the reader into the very heart of an enchanting magical land. Tying in with the release of the film, this is your chance to own a piece of \"Stardust\"!","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"The Truth","Price":"11.90","Description":"William must cope with the traditional perils of a journalist's life - people who want him dead, a recovering vampire with a suicidal fascination for flash photography, and, the man who keeps begging him to publish pictures of his humorously shaped potatoes. William just wants to get at THE TRUTH. Unfortunately, everyone else wants to get him.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Lords And Ladies","Price":"11.90","Description":"The fairies are back - but this time they don't just want your teeth. It's Midsummer Night - no time for dreaming. Because sometimes, when there's more than one reality at play, too much dreaming can make the walls between them come tumbling down. Unfortunately there's usually a damned good reason for there being walls between them in the first place - to keep things out. Things who want to make mischief and play havoc with the natural order. Granny Weatherwax and her tiny coven are up against real elves. And even in a world of dwarfs, wizards, trolls, Morris dancers and the odd orang-utan, this is going to cause real trouble. With lots of hey-nonny-nonny and blood all over the place.","Category":{"CategoryName":"Fantasy"}},{"Author":"Eoin Colfer","Name":"Artemis Fowl: The Arctic Incident","Price":"9.90","Description":"Someone has been supplying Class A illegal human power sources to the goblins. Captain Holly Short of the LEPrecon Unit is sure that her arch-enemy, thirteen-year-old Artemis Fowl, is responsible. But is he? Artemis has his own problems to deal with: his father is being held to ransom and only a miracle will save him. Maybe this time a brilliant plan just won't be enough. Maybe this time Artemis needs help...","Category":{"CategoryName":"Fantasy"}},{"Author":"C. S. Lewis","Name":"The last battle","Price":"11.90","Description":"In this, the seventh of the Narnia stories, Jill and Eustice return to help Tirian, last King of Narnia, as the land is once again troubled by the enemies of Aslan. Peter, Edmund and Lucy join in the great battle against the cruel Calormenes, to decide the future of Narnia.&nbsp;","Category":{"CategoryName":"Fantasy"}},{"Author":"C. S. Lewis","Name":"Prince Caspian","Price":"12.90","Description":"HarperCollins is proud to present a celebration of C.S. Lewis' timeless classic, Prince Caspian, lovingly brought to life in the original design and with the original illustrations. \"Look sharp!\" shouted Edmund. \"All catch hands and keep together. This is magic - I can tell by the feeling!\" Prince Caspian is in terrible danger when his wicked uncle, King Miraz, decides to get rid of the young heir to the throne. In desperation, Caspian blows the magic horn, calling on Peter, Susan, Lucy and Edmund in Narnia's hour of need. This is the fourth adventure in the exciting Chronicles of Narnia.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"The Fifth Elephant","Price":"11.90","Description":"The flat world is supported on the backs of four elephants. But aren't there supposed to be five? Indeed there are. So what happened to the fifth elephant? An investigation of an attempted assassination leads Commander Vimes of the Ankh-Morpork constabulary on a wild goose--or rather, elephant--chase that will lead him to discover the truth about the missing pachyderm.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Monstrous Regiment","Price":"11.90","Description":"\"Mate gender politics with geopolitics and you get either a PC nightmare or something very funny. Fortunately, in \"Monstrous Regiment,\" it's the latter.\"--\"Washington Post Book World.\"","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Jingo","Price":"11.90","Description":"In this \"Discworld\" novel, the ravening hordes of Klatch and the patriotic peoples of Ankh-Morpork clash over the sovereignty of a newly risen and quite uninhabitable island.","Category":{"CategoryName":"Fantasy"}},{"Author":"Steve Hockensmith","Name":"Pride And Prejudice And Zombies: Dawn Of The Dreadfuls","Price":"11.90","Description":"Witness the genesis of the zombie plague in early 19th-century England in this terrifying and hilarious prequel to the bestselling \"Pride and Prejudice and Zombies.\" Watch as Elizabeth Bennet evolves from a naive young teenager into a savage slayer of the undead.","Category":{"CategoryName":"Fantasy"}},{"Author":"Jane Austen","Name":"Sense And Sensibility And Sea Monsters (Quirk Classics)","Price":"11.90","Description":"Arriving just in time for Halloween, this strange and terrifying tongue-in-cheek novel marks a new addition to the much-acclaimed literary-occult series featuring \"Pride and Prejudice and Zombies.\"","Category":{"CategoryName":"Fantasy"}},{"Author":"George R.R. Martin","Name":"A Feast For Crows","Price":"16.90","Description":"The war-torn landscape of the Seven Kingdoms is threatened by destruction as vast as any in its violent past. Against a backdrop of alchemy and murder, victory may go to the men and women possessed of the coldest steel and the coldest hearts. Continuing an imaginative epic fantasy, this is the fourth installment of \"A Song of Ice and Fire\".","Category":{"CategoryName":"Fantasy"}},{"Author":"Leo Tolstoy","Name":"Android Karenina","Price":"12.90","Description":"\"Sense and Sensibility and Sea Monsters\" co author Winters is back with an all new collaborator, legendary Russian novelist Tolstoy, and the result is an enhanced edition of the classic love story set in a dystopian world of robots, cyborgs, and interstellar space travel.","Category":{"CategoryName":"Fantasy"}},{"Author":"Suzanne Collins","Name":"The Hunger Games","Price":"9.90","Description":"Sixteen year old Katniss Everdeen regards it as a death sentence when she is forced to represent her district in the annual Hunger Games, a fight to the death on live TV. But Katniss has been close to death before   and survival, for her, is second nature. \"The Hunger Games\" is a searing novel set in a future with unsettling parallels to our present. Welcome to the deadliest reality TV show ever..","Category":{"CategoryName":"Fantasy"}},{"Author":"Patrick Rothfuss","Name":"The slow regard of silent things","Price":"0","Description":"The University, a renowned bastion of knowledge, attracts the brightest minds to unravel the mysteries of enlightened sciences like artificing and alchemy. Yet deep below its bustling halls lies a complex and cavernous maze of abandoned rooms and ancient passageways - and in the heart of it all lives Auri. Formerly a student at the University, now Auri spends her days tending the world around her. She has learned that some mysteries are best left settled and safe. No longer fooled by the sharp rationality so treasured by the University, Auri sees beyond the surface of things, into subtle dangers and hidden names. At once joyous and haunting, THE SLOW REGARD OF SILENT THINGS is a rich, atmospheric and lyrical tale, featuring one of the most beloved characters from Rothfuss' acclaimed fantasy series.","Category":{"CategoryName":"Fantasy"}},{"Author":"Cassandra Clare","Name":"The mortal instruments city of bones","Price":"0","Description":"First in Cassandra Clare's internationally bestselling Mortal Instruments series about the Shadowhunters. Love. Blood. Betrayal. Demons. First in the New York Times No. 1 bestselling series that has swept the globe, City of Bones is also a major movie and Shadowhunters, the TV series based on the book, is currently airing on Netflix. Irresistibly drawn towards a group of demon hunters, Clary encounters the dark side of New York City and the dangers of forbidden love. This edition contains exclusive bonus content as well as a map and a new foreword by Cassandra Clare. Read all the sensational books in The Shadowhunter Chronicles: The Mortal Instruments, The Infernal Devices, Tales from the Shadowhunter Academy, The Bane Chronicles, The Dark Artifices, The Last Hours and The Shadowhunter's Codex.","Category":{"CategoryName":"Fantasy"}},{"Author":"Nigel Cawthorne","Name":"A Brief Guide To J.R.R. Tolkien","Price":"0","Description":"A comprehensive guide that provides an excellent overview and is written by an acclaimed scholar of Tolkien.","Category":{"CategoryName":"Fantasy"}},{"Author":"Derek Landy","Name":"Skulduggery pleasant","Price":"0","Description":"Meet Skulduggery Pleasant. Sure, he may lose his head now and again (in fact, he won his current skull in a poker match), but he is much more than he appears to beвЂ”which is good, considering that he is, basically, a skeleton. Skulduggery may be long dead, but he is also a mage who dodged the grave so that he could save the world from an ancient evil. But to defeat it, he'll need the help of a new partner: a not so innocent twelve-year-old girl named Stephanie. That's right, they're the heroes.","Category":{"CategoryName":"Fantasy"}},{"Author":"J K Rowling","Name":"Fantastic Beasts the original screenplay","Price":"0","Description":"When Magizoologist Newt Scamander arrives in New York, he intends his stay to be just a brief stopover. However, when his magical case is misplaced and some of Newt's fantastic beasts escape, it spells trouble for everyone ...Inspired by the original Hogwart's textbook by Newt Scamander, Fantastic Beasts and Where to Find Them: The Original screenplay marks the screenwriting debut of J.K. Rowling, author of the beloved and internationally bestselling Harry Potter books. A feat of imagination and featuring a cast of remarkable characters and magical creatures, this is epic adventure-packed storytelling at its very best. Whether an existing fan or new to the wizarding world, this is a perfect addition for any film lover or reader's bookshelf. The film Fantastic Beasts and Where to Find Them will have its theatrical release on 18th November 2016.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Guards! Guards!","Price":"0","Description":"This is the story of mysterious night-time prowling in Ankh-Morpork, the greatest city of Discworld: someone is turning the citizens into something resembling small charcoal biscuits.","Category":{"CategoryName":"Fantasy"}},{"Author":"Enid Blyton","Name":"The famous five adventure game book","Price":"0","Description":"Join Enid Blyton's Famous Five at the circus - and choose for yourself how the mystery ends. Help the Five crack the case!","Category":{"CategoryName":"Fantasy"}},{"Author":"Derek Landy","Name":"Skulduggery pleasant playing with fire","Price":"0","Description":"Just when you think you've saved the world! \"You will kill her?\" the Torment asked. Skulduggery sagged. \"Yes.\" He hesitated, then took his gun from his jacket. \"I'm sorry, Valkyrie,\" he said softly. \"Don't talk to me,\" Valkyrie said. \"Just do what you have to do.\" Valkyrie parted her tunic, and Skulduggery pointed the gun at the vest beneath. \"Please forgive me,\" Skulduggery said, then aimed the gun at the girl and pulled the trigger. With Serpine dead, the world is safe once more. At least, that's what Valkyrie and Skulduggery think, until the notorious Baron Vengeous makes a bloody escape from prison, and dead bodies and vampires start showing up all over Ireland. With Baron Vengeous after the deadly armour of Lord Vile, and pretty much everyone out to kill Valkyrie, the daring detective duo face their biggest challenge yet. But what if the greatest threat to Valkyrie is just a little closer to home!?","Category":{"CategoryName":"Fantasy"}},{"Author":"Ursula K. Le Guin  Searoad Chronicles Of Klatsand","Name":"Unknown","Price":"0","Description":"In one of her most deeply felt works of fiction, Le Guin explores the dreams and sorrows of the inhabitants of Klatsand, Oregon, a beach town where ordinary people bring their dreams and sorrows for a weekend or the rest of their lives, and sometimes learn to read what the sea writes on the sand.&nbsp;Searoad&nbsp;is the story of a particular place that could be any place, and of a people so distinctly drawn they could be any of us.","Category":{"CategoryName":"Fantasy"}},{"Author":"Cassandra Clare","Name":"Clockwork Angel","Price":"0","Description":"The Infernal Devices trilogy, a prequel to bestselling The Mortal Instruments trilogy, follows 16-year-old orphan Tessa Gray, whose quiet life is thrown into turmoil when her older brother Nathaniel suddenly vanishes, leaving her alone. Tessa's search for him takes her to England during the reign of Queen Victoria, into London's dangerous underworld, where warlocks throw masked balls for halfdemon Downworlders and vampires and supernatural folk stalk the gaslit streets.When the friendless and hunted Tessa discovers that she herself is a Downworlder, she must learn to trust her natural enemies, the demon-killing Shadowhunters, if she ever wants to learn to control her powers and find her brother. Drawn ever deeper into their world, she finds herself fascinated by - and torn between - two best friends; beautiful Will, a Shadowhunter hiding a deadly secret, and the devoted Jem, whose addiction to a demon drug is slowly destroying him. Tessa quickly realises that love may be the most dangerous magic of all and must draw on all her strength to save her brother and keep herself alive in this deadly new world.","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book MORT Terry Pratchett","Name":"Unknown","Price":"0","Description":"Signed Book MORT Terry PratchettOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.In this Discworld installment, Death comes to Mort with an offer he can't refuse -- especially since being, well, dead isn't compulsory. As Death's apprentice, he'll have free board and lodging, use of the company horse, and he won't need time off for family funerals. The position is everything Mort thought he'd ever wanted, until he discovers that this perfect job can be a killer on his love life.","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book THE LAST CONTINENT Terry Pratchett","Name":"Unknown","Price":"0","Description":"Signed Book THE LAST CONTINENT Terry Pratchett&nbsp;Our signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.There's nothing like the issue of evolution to get under the skin of academics. Especially when those same academics are by chance or bad judgement deposited at a critical evolutionary turning point when one wrong move could have catastrophic results for the future. Unfortunately in the hands of such an inept and cussed group of individuals, the sensitive issue of causality is sadly only likely to receive the same scant respect that they show to one another...","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book SONGS OF THE DYING EARTH George R R Martin","Name":"Unknown","Price":"0","Description":"Signed Book SONGS OF THE DYING EARTH George R R MartinOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Songs of the Dying Earth: Stories in Honor of Jack Vance&nbsp;is a collection of short fiction and shorter essays composed in appreciation of the&nbsp;science fiction&nbsp;and&nbsp;fantasy&nbsp;author&nbsp;Jack Vance, especially his&nbsp;Dying Earth&nbsp;series. Edited by&nbsp;George R.R. Martin&nbsp;and Gardner Dozois, it was published in 2009 by&nbsp;Subtererranean Press.&nbsp;Twenty-two authors contributed short fiction and an Afterword, about thirty pages on average. Fifteen of the stories are novelettes (7500 to 17,500 words), six are shorter, and&nbsp;The Guiding Nose of UlfГ¤nt BanderЕЌz&nbsp;by Dan Simmons is a novella&nbsp;highlighted on the cover of the second U.S. edition.","Category":{"CategoryName":"Fantasy"}},{"Author":"J.K. Rowling","Name":"Harry Potter And The Order Of The Phoenix","Price":"0","Description":"J.K. Rowling | Harry Potter And The Order Of The PhoenixHarry Potter is about to start his fifth year at Hogwarts School of Witchcraft and Wizardry. Unlike most schoolboys, Harry never enjoys his summer holidays. but this summer is even worse than usual. The Dursleys, of course, are making his life a misery, but even his best friends, Ron and Hermione, seem to be neglecting him. Harry has had enough. He is beginning to think he must do something, anything, to change his situation, when the summer holidays come to an end in a very dramatic fashion. What Harry is about to discover in his new year at Hogwarts will turn his world upside down...","Category":{"CategoryName":"Fantasy"}},{"Author":"J K Rowling","Name":"Harry Potter and the Deathly Hallows","Price":"0","Description":"J K Rowling | Harry Potter and the Deathly HallowsAs he climbs into the sidecar of Hagrid's motorbike and takes to the skies, leaving Privet Drive for the last time, Harry Potter knows that Lord Voldemort and the Death Eaters are not far behind. The protective charm that has kept Harry safe until now is now broken, but he cannot keep hiding. The Dark Lord is breathing fear into everything Harry loves, and to stop him Harry will have to find and destroy the remaining Horcruxes. The final battle must begin - Harry must stand and face his enemy. These new editions of the classic and internationally bestselling, multi-award-winning series feature instantly pick-up-able new jackets by Jonny Duddle, with huge child appeal, to bring Harry Potter to the next generation of readers. It's time to PASS THE MAGIC ON ...","Category":{"CategoryName":"Fantasy"}},{"Author":"Neil Gaiman","Name":"The Sandman book of dreams","Price":"0","Description":"Written by NEIL GAIMAN Art by KELLEY JONES, MIKE DRINGENBERG, MATT WAGNER, GEORGE PRATT, P. CRAIG RUSSELL and others Cover by DAVE MCKEAN Volume Four of New York Times' best-selling author Neil Gaiman's acclaimed creation, with updated coloring and new trade dress. Ten thousand years ago, Morpheus condemned a woman who loved him to Hell. Now the other members of his immortal family, The Endless, have convinced the Dream King that this was an injustice. To make it right, Morpheus must return to Hell to rescue his banished love - and Hell's ruler, the fallen angel Lucifer, has already sworn to destroy him.&nbsp;","Category":{"CategoryName":"Fantasy"}},{"Author":"Signed Book THE AMAZING MAURICE Terry Pratchett","Name":"Unknown","Price":"0","Description":"Signed Book&nbsp;THE AMAZING MAURICE Terry PratchettFirst edition!&nbsp;Our signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.The Amazing Maurice and his Educated Rodents&nbsp;is a children's fantasy&nbsp;by Terry Pratchett, published by Doubleday in 2001. It was the 28th novel in the Discoworld&nbsp;series but the first written for children. The story is a new take on the German fairy tale&nbsp;about the&nbsp;Pied Piper of Hamelin and a parody&nbsp;of the folk tale genre.&nbsp;Pratchett won the annual Carnegie Medal&nbsp;from the British librarians, recognising the year's best children's book published in the U.K.&nbsp;It was his first major award.","Category":{"CategoryName":"Fantasy"}},{"Author":"J K Rowling","Name":"Prisoner of Azkaban","Price":"0","Description":"J K Rowling | Prisoner of AzkabanThis is the next title in the \"Harry Potter\" series. Harry Potter is a wizard (just like you and me). He is in his third year at Hogwarts School of Witchcraft and Wizardry. It's always a relief after summer with the Dursleys, however, Harry doesn't realise that this year will be just as eventful as the last two! The atmosphere at Hogwarts is tense. There's an escaped mass murderer on the loose, even the Muggles have been warned. The sinister prison guards of Azkaban have been called in to guard the school and Harry, Ron and Hermione rapidly discover why all witches and wizards live in fear of being sent to Azkaban. Lessons, however, must go on and there are lots of new subjects in third year - Care of Magical Creatures and Divination among others. Plus the delights of Hogsmeade, the only village in the UK entirely populated by the magical community.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Small Gods","Price":"0","Description":"Brutha is a simple lad. He can't read or write, but he's pretty good at growing melons, and his wants are few. He wants peace and justice and brotherly love, but most of all he wants his god, who's currently in the shape of a tortoise, to choose someone else.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"The Colour Of Magic","Price":"0","Description":"On a world supported on the back of a giant turtle (sex unknown), a gleeful, explosive, wickedly eccentric expedition sets out.There's an avaricious but inept wizard, a naive tourist whose luggage moves on hundreds of dear little legs, dragons who only exist if you believe in them, and of course THE EDGE of the planet...\"","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Soul Music","Price":"0","Description":"Discworld is about to rock...Deputising for death was never going to be easy, not least when he has gone walkabout in search of the Meaning of Life - without even leaving a forwarding address. But for his granddaughter, Susan, it becomes even more difficult when she breaks one of the cardinal rules of the family business - don't get involved! All around the Disc, crowds are shouting out for Buddy Celyn and The Band With Rocks In. They are in the grip of a new and dangerous music and Buddy is under its thumb. It's alive, it changes people - and it won't fade away. Grain by grain, Buddy's time is running out and Susan has to save him - it's not going to be easy when she looks more like the Tooth Fairy than the Grim Reaper...Soul Music: The Illustrated Screenplay is the perfect accompaniment to the acclaimed Channel Four / Cosgrove Hall series of Terry Pratchett's bestselling novel and what's more it's got lots of pictures in (154 to be precise).","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Interesting Times","Price":"0","Description":"Mighty battles! Revolution! Death! War! (and his sons Terror and Panic, and daughter Clancy). The oldest and most inscrutable empire on the Discworld is in turmoil, brought about by the revolutionary treatise What I Did On My Holidays. Workers are uniting, with nothing to lose but their water buffaloes. Warlords are struggling for power. War (and Clancy) are spreading throughout the ancient cities. And all that stands in the way of terrible doom for everyone is: Rincewind the Wizard, who can't even spell the word 'wizard' ...Cohen the barbarian hero, five foot tall in his surgical sandals, who has had a lifetime's experience of not dying ...and a very special butterfly","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Thud!","Price":"0","Description":"A seemingly routine day in the life of City Watch commander Sam Vimes is abruptly interrupted by an unsolved murder, an impending war, an unwanted new recruit, and a pesky government inspector.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Moving Pictures","Price":"0","Description":"A Discworld novel in which the alchemists discover the magic of the silver screen, and attempt to unravel the dark secret of Holy Wood Hill.","Category":{"CategoryName":"Fantasy"}},{"Author":"Terry Pratchett","Name":"Unseen Academicals","Price":"0","Description":"Football has come to the ancient city of Ankh-Morpork. And now the wizards of Unseen University must win a football match, without using magic, so they're in the mood for trying everything else. The prospect of the Big Match draws in a street urchin with a wonderful talent for kicking a tin can, a maker of jolly good pies, a dim but beautiful young woman, who might just turn out to be the greatest fashion model there has ever been, and the mysterious Mr Nutt (and no one knows anything much about Mr Nutt, not even Mr Nutt, which worries him, too). As the match approaches, four lives are entangled and changed forever. Because the thing about football - the important thing about football - is that it is not just about football. Here we go! Here we go! Here we go! This is a playtext suitable for all ages, adapted from the novel.","Category":{"CategoryName":"Fantasy"}},{"Author":"J. Tolkien","Name":"The Lord Of The Rings","Price":"0","Description":"One Ring to rule them all, One Ring to find them, One Ring to bring them all and in the darkness bind them In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, The Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth still it remained lost to him. After many ages it fell, by chance, into the hands of the hobbit, Bilbo Baggins. From his fastness in the Dark Tower of Mordor, Sauron's power spread far and wide. He gathered all the Great Rings to him, but ever he searched far and wide for the One Ring that would complete his dominion. On his eleventy-first birthday, Bilbo disappeared bequeathing to his young cousin, Frodo, the Ruling Ring, and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord and destroy the Ring by casting it into the Cracks of Doom. The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the wizard, Merry, Pippin and Sam, Gimli the Dwarf, Legolas the Elf, Boromir of Gondor, and a tall, mysterious stranger called Strider.","Category":{"CategoryName":"Fantasy"}},{"Author":"John Gisby","Name":"New Zealand with a hobbit botherer","Price":"0","Description":"What should you do if your spouse becomes addicted to the Lord of the Rings movies and swoons at the very mention of Orlando Bloom's name? (Thud. Quick, fetch the smelling salts.) How about taking the advice of a strange apparition that reveals itself in a dream? An apparition that looks remarkably like the director of the movies, Peter Jackson, but not quite remarkably enough to prompt legal action. An apparition that recommends touring New Zealand in an effort to prove that its sheep pastures aren't really filled by frolicking Hobbits. Just sheep and the occasional zorbing local. This is the hilarious tale of such a tour, featuring snow capped mountains and turquoise lakes, flightless birds and flying cattle, bungy jumping grannies and the carrot mafia, strange yellow eyes peering up from a road map and hotel receptionists always desperate to know win you are living","Category":{"CategoryName":"Fantasy"}},{"Author":"Veniss Underground","Name":"Jeff VanderMeer","Price":"0","Description":"On a far future Earth, where vast deserts   ecological disaster areas   surround walled city states slowly losing their grip on advanced technology, the mysterious Quin manipulates biological engineering to create sentient species as both toys and manual labour. When Nicholas, a failed holo artist, decides to visit Quin, he   along with his programmer sister Nicola and her former lover, Shadrach   will discover just how dangerous it is to know Quin   in the place known as Veniss Underground. 'Visionary episodes come thicker and faster, and at times the author only barely controls his own invention ...The denouement is as powerful as any I have read'   \"Michael Moorcock\", \"Guardian\". 'An outstanding first novel brimming with startling ideas'   \"Scotsman\". 'A dark, phantasmagoric tale that echoes Dante's Divine Comedy, the myth of Orpheus and Eurydice, and the landscapes of Hieronymus Bosch'   \"Publishers Weekly\"","Category":{"CategoryName":"Fantasy"}},{"Author":"Beautiful Creatures Film Tie In","Name":"Kami Garcia","Price":"0","Description":"This edition features exclusive movie cover art. A brand new film tie in edition of the bestselling love story, Beautiful Creatures   a romance that is bound to capture the hearts of Twilight fans everywhere. This edition ties in to the major new Warner Brothers and Alcon Entertainment blockbuster film starring Emma Thompson, Jeremy Irons, Alice Englert and Alden Ehrenreich. In Ethan Wate's hometown there lies the darkest of secrets...There is a girl. Slowly, she pulled the hood from her head. Green eyes, black hair. Lena Duchannes. There is a curse. On the Sixteenth Moon, the Sixteenth Year, the Book will take what it's been promised. And no one can stop it. In the end, there is a grave. Lena and Ethan become bound together by a deep, powerful love. But Lena is cursed and on her sixteenth birthday, her fate will be decided. Ethan never even saw it coming. Praise for Beautiful Creatures: \"Watch out Twilight and Hunger Games\". The Guardian). \"Move over Twilight, there's a new supernatural saga in town\". E!). \"This novel has been generating Twilight level buzz\". Teen Vogue). About the authors: @kamigarcia is a superstitious American southerner who can make biscuits by hand and pies from scratch! She attended George Washington University and is a teacher and reading specialist. She lives in Los Angeles, California with her family. @mstohl has written and designed many successful video games, which is why her two beagles are named Zelda and Kirby. She has degrees from Yale and Stanford Universities in the US and has also studied in the prestigious creative writing department at UEA, Norwich. She lives in Santa Monica, California with her family. Also available in the Beautiful Creatures series: Beautiful Darkness, Beautiful Chaos and Beautiful Redemption. Don't miss the brand new Dangerous Creatures series, set in the world of Beautiful Creatures. Exclusive ebook novellas also available: Dream Dark Dangerous Dream.","Category":{"CategoryName":"Fantasy"}}]