[{"Author":"Signed Book Happy Days With the Naked Chef Jamie Oliver","Name":"Unknown","Price":"79.90","Description":"Signed Book Happy Days With the Naked Chef Jamie Oliver&nbsp;Our signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Signed CopyCertificate of OriginPlease Note : The books we sell are second hand and range in condition from 'as new' to 'well-read' . But all are un-torn, complete and with no loose pages. Books that have had a harder life are offered at a discount in the store only.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Top Tips For Hungry Students","Name":"Unknown","Price":"19.90","Description":"Top Tips For Hungry StudentsTop tips for hungry \r\nstudents! This is cookbook is a great gift for any hungry student (a.k.a every student) requiring \r\nsome sound but entertaining advice in the kitchen. It is stuffed full of\r\n practical tips to help you be a star in the kitchen and aspire way \r\nbeyond the instant noodle! Includes breakfasts, pasta, meat dishes, vegetarian dishes and of course... deserts! Learn how to use your leftovers!191 pages","Category":{"CategoryName":"Health & Cookery"}},{"Author":"David Kenning","Name":"350 Beers of the world","Price":"19.90","Description":"All about beers","Category":{"CategoryName":"Health & Cookery"}},{"Author":"David Kenning","Name":"The Complete Guide to Beer","Price":"19.90","Description":"The Complete Guide to Beer is a comprehensive guide to more than 200 of the finest beers brewed around the globe, from the traditional ales of England, through Belgium's trappist monasteries and pure German lagers, to America's microbreweries and Japanese rice beers. Each beer is illustrated with full color photography, accompanied by historical information about the beer and its brewery. Detailed testing notes describe the beer's appearance, style, and distinctive flavors. A fact box details essential information including alcohol content, serving temperature, and suggested food accompaniments.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Christine Green","Name":"28-Day Plan: Detox &amp; Energise","Price":"5.90","Description":"28-Day Plan: Detox &amp; Energise","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Sarah Litvinoff","Name":"The Essential Quit Guide To Stopping Smoking","Price":"4.90","Description":"This essential guide to giving up smoking will be an invaluable tool for all those who want to quit. Written with the collaboration of Quit, it will combine succinct information, tips and practical help with the real voice of experience: ex-smokers who have surmounted all the hurdles. Long-serving Quitline counsellors will add their practical knowledge, experience and wisdom throughout. The book will be structured similarly to the Quit Group Session Workshops: Thinking about Stopping, Planning to Stop, Stopping, Coping with Withdrawal, Staying Stopped, Being a Support, What Works? Covering all the working methods, rather than recommending 'the only way', it will be tailored to everyone's needs.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Hiromitsu Nozaki","Name":"World Cuisine: Japan","Price":"9.90","Description":"When you think of Japanese food, sushi and ramen are probably the top ones on your list. However, Japanese cuisine is actually more than that. Beyond the popular notions of what Japanese food is, their traditional, home-cooking cuisine is actually a celebration of the natural, delicate and simple taste of food. This is part of the traditions of real and authentic Japanese cooking.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Jane Brocket","Name":"Cherry cake and ginger beer","Price":"12.90","Description":"If as a child you devoured Enid Blyton's classics like the Famous Five or Malory Towers, or loved to lose yourself in the adventures of Pippi Longstocking or What Katy Did, then CHERRY CAKE AND GINGER BEER is the book for you. A wonderfully nostalgic cookery book, it will take you straight back to your favourite children's books and show you how to cook the feel-good foods that feature so strongly in them. So, you'll find recipes for Swallows and Amazons Squashed-Fly Biscuits, the Famous Five's Gorgeous Ginger Beer, and Gloriously Sticky Marmalade Roll from The Lion, the Witch and the Wardrobe amongst others. Divided into appropriate sections like Proper Elevenses, Picnic Treats and Lessons in the Kitchen each recipe is introduced with an evocative description of the book that inspired it. Guaranteed to take you straight back to your childhood, the book is an escapist treat for grown-ups and will encourage you to re-visit much-loved classics and share them with the next generation.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Anne Webb","Name":"Dictionary of Beer: CAMRA's A-Z of Beer and Brewing Terms","Price":"11.90","Description":"A reference work to beer and brewing terms, foreign beers, useful beer-related words in European languages, British real ale breweries, famous beer-related companies and characters. This Dictionary is a unique reference work. Where else would you find definitions of the following words grouped together: parachute, Paradise, paraflow and paralytic? Or skull-dragged, slummage and snob screen? Inside are useful definitions for beer drinkers, students, brewers, historians and language lovers.&nbsp;","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Hugh Fearnley Whittingstall","Name":"The river cottage cookbook","Price":"19.90","Description":"First published in the United Kingdom in 2001, THE RIVER COTTAGE COOKBOOK quickly became a hit among food cognoscenti around the world. Now tailored for American cooks, this authoritative and animated ode to eating well is one part manifesto and one part guidebook for choosing and storing food grown in the garden, butchered from prize animals, or foraged or caught locally.Fearnley-Whittingstall writes with humor, wit, and clarity, bringing American readers what his legions of British fans have enthusiastically embraced: the best techniques and recipes for getting the most out of simple, superior food, while supporting the environment, vibrant local economies, and resourceful use of plants and animals.&nbsp;A groundbreaking book on eliminating the \"rubbish\" from your diet and maximizing the pleasures of the table, from British food personality Hugh Fearnley-Whittingstall. Original edition has sold 300,000 copies in Europe. Throroughly Americanized for a North American audience.Reviews\"There's something delightful about considering what it would mean to raise animals and then eat them nose to tail, close to the land.\"вЂљГ„Г®New York Times Book Review Summer Reading issue, cookbook roundup\"Fearnley-Whittingstall is on a mission, determined to persuade us that the life he writes about is within our reach...Whatever the topic, he is consistently entertaining.\"вЂљГ„Г®New York Times MagazineIncluded in the Summer Reading Issue, Cookbook Roundup 6/1/08 in the New York Times Book Review\"An intense and heartfelt almanac of raising and eating organic plants and animals without the intrusive use of slaughterhouses, packaging plants, or grocery stores.\"вЂљГ„Г®Publishers Weekly STARRED reviewвЂљГ„ГєLocavore Bible: Cooks so intent on eating locally that they grow their own food will have a definitive tome.вЂљГ„Г№вЂљГ„Г®Food &amp; Wine, 100 to Taste List&nbsp;","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Tim Hampson","Name":"The beer book","Price":"25.90","Description":"Your drinking companion to over 1,700 beers from around the world The Beer Book is a comprehensive guide to the best beers in the world, exploring more beers than any other book. Beer, the drink to taste, savour, talk about and travel for. Explore its astonishing variety and rapidly expanding new tastes - thirst-quenching lagers, \"meal-in-a-glass\" stouts, peppery white beers, tangy fruit-based brews, and classic ales and bitters - with this updated guide to every good beer in the world.Tim Hampson, Chairman of the British Guild of Beer Writers, takes you from Brazil to Slovakia, Japan to Belgium, to features every significant brewery in every significant brewing nation. Visit over 800 breweries, such as Guinness or Kronenburg and read detailed tasting notes for over 1,700 beers from a team of local specialists.Whet your appetite with five beer trails with trail maps that take you round key beer regions to experience the best breweries and brewpubs. With this updated edition of The Beer Book (previous ISBN 9781405333016) you can discover all the best beers of the world, which brands of beers to try and how best to enjoy them, with brews that are anything but 'a pint of the usual'. A perfect gift for beer lovers.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Richard C Morais","Name":"The hundred foot journey","Price":"12.90","Description":"'I have never experienced that most subtle of senses - smell - captured so well in print. The aroma of fine cooking just floats off the pages. Don't read this book if you're hungry. You might eat it.' - Simon Beaufoy, Oscar-Award-winning screenwriter, Slumdog Millionaire Abbas Haji is the proud owner of a modest family restaurant in Mumbai. But when tragedy strikes, Abbas propels his boisterous family into a picaresque journey across Europe, finally settling in the remote French village of Lumiere, where he establishes an Indian restaurant - Maison Mumbai. Much to the horror of their neighbour, a famous chef named Madame Mallory, the Indian establishment opposite her own begins to garner a following.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Gordon Ramsay","Name":"Gordon Ramsay Makes it Easy","Price":"18.90","Description":"Gordon Ramsay Easy sees Britain's most celebrated chef moving out of the restaurant and into the home kitchen. Having reached his zenith in the culinary establishment, Gordon is now focusing on making his food accessible to a wider audience. This book features dishes which have all the hallmarks of Gordon's cooking - the best ingredients, great taste combinations, superb culinary skill - but the overall feel is more informal and the emphasis is on ease of preparation and simple techniques. Arranged around actual meals - Breakfast &amp; Brunch, Great Fast Food, Family Lunches and Posh Dinners, Summer Bar-B-Qs and Cooking for Crowds, Bellinis &amp; Blinis and Romantic Dinners for Two, High Teas and Midnight Feasts - each chapter contains 6-10 recipes either arranged as a selection or as menus.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Heather Lamont","Name":"The Vegan Gourmet","Price":"11.90","Description":"A collection of gourmet vegan recipes, from the simple to the sophisticated. Low in cholesterol and high in fibre, recipes such as black olive pate, spicy cauliflower and aubergine stuffed with nuts, are intended for both family cooking and entertaining.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Jeff Evans","Name":"Good bottled beer guide","Price":"14.90","Description":"The Good Bottled Beer Guide focuses on bottl e-conditioned beers, which contain yeast and continue to mat ure in the bottle for a fuller, fresher taste, just as real ales mature in the cask at the pub.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Angelika Taschen","Name":"London Restaurants &amp; More","Price":"20.90","Description":"English food is much more varied than fish 'n' chips (though we can tell you where to get the best London has to offer). Indeed, England's capital city is home to a dizzying array of culinary options and of course Angelika Taschen has selected the finest London eateries where you'll delight in a meal, tea, or simply hobnobbing with the jet-set. Highlights of this book include descriptions of: The Golden Hind with its art deco interior and delectable fish 'n' chips - a fixture on Marylebone Lane since 1914; The Wolseley, classic grand cafe and perfect place for afternoon tea and scones; the same classic British cooking as Charles Dickens once did at the city's oldest restaurant, Rules; London's first gastropub, The Eagle; La Fromagerie, a cheese Mecca and delicatessen with fresh groceries; celebrity chef Jamie Oliver's restaurant, Fifteen. Special features of this book include: exclusive hand-illustrated cover; exclusive hand-illustrated map for each area; information such as opening hours, history, and signature dishes; hand-illustrated tear-out postcard; and, softcover with a sturdy PVC jacket.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Anthony Capella","Name":"The Various Flavours Of Coffee","Price":"12.90","Description":"It is 1895. Robert Wallis, would-be poet, bohemian and impoverished dandy, accepts a commission from coffee merchant Samuel Pinker to categorise the different tastes of coffee - and encounters Pinker's free-thinking daughters, Philomenia, Ada and Emily. As romance blossoms with Emily, Robert realises that the Muse and marriage may not be incompatible after all. Sent to Abyssinia to make his fortune in the coffee trade, he becomes obsessed with a negro slave girl, Fikre. He decides to use the money he has saved to buy her from her owner - a decision that will change not only his own life, but the lives of the three Pinker sisters ...","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Dave Broom","Name":"The Complete Encyclopedia of Wine, Beer and Spirits","Price":"26.90","Description":"A comprehensive guide to the world of wine, spirits and beer.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Jeff Evans","Name":"A beer a day","Price":"19.90","Description":"No ordinary collection of must-taste beers, \"A Beer a Day\" looks to unearth the links between beer and the world we live inour history, traditions, customs, and culture. Readers areguided through the maze of labels, selecting beers that don't just taste great, but also have a story to tell. The simple page-a-day diary format includes an easy reference for the beer, its country of origin, the day's date, and its linked event. For each day, a beer is recommended that draws attention to events that have taken place or that still take place on that day. From seasonal beersproduced to celebrate such occasions as Valentine's Day and Halloween, to those honoring the good and the great from history, \"A Beer a Day \"has a beer for every story and a story for every beer.\"","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Peter Mayle","Name":"Bon Appetit","Price":"15.90","Description":"Gastronomy is a wonderful starting point to study France and the French. As the retired schoolmaster from Provence says 'The religion of France is food. And wine, of course.' And they put their money where their mouth is, spending a greater proportion of their income on food and drink than any other nation in the world. Literally hundreds of gastronomic fairs and festivals take place throughout the year all over France - a frog fair, an hommage to the sausage, to the turnip, to the quiche and the noble Camembert. What kind of person is a snail-fancier? Is there a brotherhood of sausage connoisseurs? How can you devote an entire weekend to the French fry? Peter Mayle finds out and brings hilariously and affectionately to life the people who can get passionate about a frog's leg or a well-turned omelette. Over ten years ago he transformed our feelings about Provence, now he captures the irresistible essence of France herself - and her food.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Elizabeth David","Name":"A book of mediterranean food","Price":"12.90","Description":"A Book of Mediterranean Food is Elizabeth David first book, and made her a favourite with foodies everywhere. Originally published in 1950 A Book of Mediterranean Food is based on a collection of recipes she made while living in France, Italy, the Greek islands and Egypt. She gives us hearty pasta and polenta dishes from Italy; aromatic and tangy salads from Turkey and Greece; and tasty seafood and saffron dishes from Spain. Whether it is the simplicity of hummus or the delicious blending of flavours found in plates of ratatouille or paella, Elizabeth David's wonderful recipes in A Book of Mediterranean Food are imbued with all the delights of the sunny south. 'Not only did she transform the way we cooked but she is a delight to read' Express on Sunday 'Britain's most inspirational food writer' Independent 'When you read Elizabeth David, you get perfect pitch. There is an understanding and evocation of flavours, colours, scents and places that lights up the page' Guardian 'Not only did she transform the way we cooked but she is a delight to read' Express on Sunday Elizabeth David (1913-1992) is the woman who changed the face of British cooking. Having travelled widely during the Second World War, she introduced post-war Britain to the sun-drenched delights of the Mediterranean and her recipes brought new flavours and aromas into kitchens across Britain. After her classic first book Mediterranean Food followed more bestsellers, including French Country Cooking, Summer Cooking, French Provincial Cooking, Italian Food, Elizabeth David's Christmas and At Elizabeth David's Table.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Helen Arthur","Name":"The single malt whisky companion","Price":"19.90","Description":"This is a directory of more than 100 single malt whiskies, featuring expert tasting notes on each. There are photographs of labels and bottles, plus detailed maps of the area they originate from. There is information on every major Scottish distillery, in addition to selective coverage of the best whiskies from countries relatively new to single malt whisky production, such as Japan and New Zealand. Helen Arthur also discusses the differences between malts, grains and blends and how to identify them, and how to buy, serve and store single malt whisky.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Jamie Oliver","Name":"Cook with Jamie","Price":"19.90","Description":"This is my guide to making you a better cook and it's the biggest book I've ever done! I think it looks beautiful and is full of simple and accessible recipes (160 of them!) that will blow the socks off your family and any guests you might have round for dinner.And that's not all ... thereвЂ™s information on the equipment that I think you should have in your kitchen, advice on how to recognize and cook loads of different cuts of meat, as well as on how to get the best value and quality when youвЂ™re out shopping.With Britain consuming more processed food than the rest of Europe put together, itвЂ™s a sad fact that most people just arenвЂ™t confident enough to cook any more. I'm hoping that with this new book, everyone will get stuck in and reclaim our fantastic cooking heritage!","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Catherine Brown","Name":"The taste of Britain","Price":"21.90","Description":"For too long Britain has failed to celebrate its culinary heritage. But from the introduction of borage to the British Isles by the Romans to the nation's love-hate relationship with Marmite, Britain has always played host to an astonishing range of gustatory traditions.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Nick Sandler","Name":"Preserved","Price":"15.90","Description":"A panoramic introduction to a world that will consume and seduce you with its intensity of flavors.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Georg Feuerstein","Name":"Yoga for Dummies","Price":"16.90","Description":"Once considered the exclusive domain of Eastern mystics, Yoga is, in reality, a practical mind and body discipline that can enrich the lives of everyone - physically and spiritually. Today, Yoga is employed by atheletes in training, recovering heart patients, chronic back pain sufferers' and new mothers, before and after delivery. In \"Yoga For Dummies, \" George Feuerstein and Larry Payne draw on their comprehensive, expert knowledge of Yoga to demonstrate, in simple and plain language, that anyone can use Yoga for improved health and greater peace of mind.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Hugh Fearnley Whittingstall","Name":"Hugh fearlessly eats it all","Price":"17.90","Description":"To some Hugh Fearnley-Whittingstall's concept of 'good eating' might seem a bit skewed, but to others he is a shining and shaggy beacon of good sense in a food world gone mad. Armed with a broad mind, a quick wit and a ready appetite, Hugh covers almost every area of global food culture.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Ed McCarthy","Name":"Wine for dummies","Price":"34.90","Description":"This friendly, unpretentious guide has been revised to cover all the latest developments in the wine world. As always, the authors deliver just what ordinary mortals need to know to navigate the wine list at a restaurant or the wine aisle at a store, select a great bottle, and truly enjoy it.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"D. Ealy","Name":"The Woman's Book Of Creativity","Price":"14.90","Description":"Ealy discusses the social attitudes that have obstructed women's creativity for years, providing simple activities, examples and explanations to illustrate and nurture the holistic, spiral process that is the hallmark of feminine creativity. Included are: Letting your dreams create for you Quieting the inner critic Learning to change your perception of reality Altering your sense of time Becoming more spontaneous Loving your creative self Learning to accept nurturance.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Andrew W. Ellis","Name":"Reading, Writing And Dyslexia","Price":"9.90","Description":"Research in cognitive psychology has contributed much to our understanding of reading and spelling. Most of this work has concentrated on the processes used by literate adults to comprehend and produce written language, but there is a growing interest in applying cognitive theories to the development of literacy, and to the understanding of disorders of reading and writing. Such disorders may be acquired as a consequence of a brain injury to a previously literate adult, or may be developmental, occurring in otherwise normal children. This textbook attempts to present this work to a non-specialist audience. Though written primarily with students of psychology and education in mind, it is accessible also to parents and teachers. The broad organization of the first edition is retained. The book opens with a consideration of the history and nature of writing, then moves on to deal with the nature of skilled reading. Other chapters deal with: the different ways that brain injury in adulthood can disrupt the mature reading skill the 'acquired dyslexias'; spelling and writing processes, both in skilled writers and in patients with 'acquired dysgraphia'; the way children develop the skills of reading and writing; and developmental reading and writing problems.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Dr. Ryuta Kawashima","Name":"Train Your Brain","Price":"9.90","Description":"Designed for readers who want to keep their minds sharp and stave off the mental effects of aging, this book presents a 60-day program that consists of daily worksheets of simple mathematical calculations that take less than five minutes to complete.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Chris Idzikowski","Name":"Beating Insomnia","Price":"9.90","Description":"You toss and turn all night, worrying and fretting, to wake up tired and bad-tempered the next day. This is bad enough, but persistent sleeplessness and insomnia can lead to tension, irritability, breakdown in relationships and accidents, especially on the roads. And sleeping pills are not a long-term solution. Now you hold the answer. 'Beating Insomnia' has been specially devised to help you understand the mechanisms controlling your sleep. It teaches sleep management techniques, helps you identify particular sleep problems and is packed with ideas and advice to help you cope with your own disturbed sleep. A 28 day Sleep Diary helps you analyse your sleep patterns so that you can decide on the best way to tackle your sleep problems. The 60 minute CD will lull you into deep and refreshing sleep to help focus your mind and relax your body. A Unique Internet Link will bring you to an on-line diary devised by the author that will enhance the data you have already collected in the book's diary.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Vivianne Crowley","Name":"Wicca","Price":"9.90","Description":"Wicca is said to be the oldest religion in the world. Today, growing numbers of people are becoming attracted to the old way. In this bestselling, introductory book, Vivianne Crowley explains the way of the Witch and shows the relevance of modern Wicca in today's world.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Gerti Samel","Name":"Tibetan medicine","Price":"11.90","Description":"The Tibetan people have developed an approach to medical science drawn from thousands of years of accumulated wisdom and intuition about the nature of health and illness. Tibetan medical theory acknowledges how health and illness result both from the relationship between the mind and body, and people's connection to the natural world. The author of this book worked closely with a renowned Tibetan doctor and pharmacologist to create this beautifully illustrated guide, bringing readers a vivid pictureof both the practical and spiritual dimensions of Tibetan medicine.\"","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Westwood","Name":"Aromatherapy","Price":"9.90","Description":"This is an excellent book that takes a down to earth and genuinely holistic approch to aromatherapy. It is a most useful reference and is easy to read. The author covers every aspect of aromatherapy, including essential oil extraction, massage, safety and specific information on many oils. She also promotes a holistic and uncommercial outlook on aromatherapy, which is a real change from many books on the market. This book is a must read for any one who is interested in understanding the true art and benefits of aromatherapy.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Huge Fearnley Whittingstall","Name":"Home Grown","Price":"14.90","Description":"Accompany woodsman Ben Law as he celebrates the amazing diversity of craft products made from materials sourced directly from the woods. Including brooms, rakes, pegs, spoons, chairs, baskets, fencing, yurts and even a caravan, the items are hewn from freshly cut green wood, shaped by hand and infused with a simple, rustic beauty. Detailed instructions and advice are given for each craft, along with essential knowledge about tools and devices. With fascinating information on the history, language and traditions of the crafts, coppice management and tree species, this book teaches about all aspects of the low-impact woodland way of life.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Dr. Penny Stanway","Name":"The Miracle of Lemons: Practical Tips for Health, Home &amp; Beauty","Price":"9.90","Description":"Penny Stanway debunks the myths surrounding lemons and reveals which health claims are backed by evidence-based research and which are not. She provides an A-Z section of ailments that can respond to lemons - each entry outlines possible causes of the ailment, discusses how lemons can help, and suggests how to use them as a remedy.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Jamie Oliver","Name":"The Naked Chef","Price":"0","Description":"Jamie Oliver's classic bestselling book, with simple recipes that combine bold flavours and nutritious fresh ingredients The Naked Chef teaches you how to make beautiful dishes from scratch, whether you're cooking for guests or simply enjoying good food with your family. Host a dinner party your friends won't forget with light Vegetable Tempura, followed by melt-in-the-mouth spiced Slow-Cooked Lamb Shank. Or why not try the Chilli, Tomato, Oregano and Pancetta Pizza; perfect for getting the family stuck in.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Gordon Ramsay","Name":"Cooking for friends","Price":"0","Description":"The way Gordon cooks here embodies his strongly held views: use in-season, fresh ingredients at their peak; support local producers and farmers' markets whenever possible; and celebrate the food culture and its many influences.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Adrian Tierney Jones","Name":"The big book of beer","Price":"0","Description":"The Big book of beer","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Roger Protz","Name":"300 beers to try before you die","Price":"0","Description":"From Belgian fruit beers to hoppy cask ales, small-production microbrews to Czech Republic lagers, this is a personal and comprehensive portfolio of international beers compiled by one of the world's leading beer writers. In this unique and beautifully illustrated collection, he has distilled decades of beer knowledge into an entertaining and indispensable guide to the ales that no beer lover should miss.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Kevin Forbes","Name":"Home brewing","Price":"0","Description":"Home brewing is a creative, productive and rewarding hobby that is soaring in popularity. With beer, wine, cider and more to choose from, there's something for everyone to enjoy. The satisfaction of brewing at home can be achieved by anyone with a little bit of effort. This book provides a practical guide to fun and successful home brewing, with detailed information on the brewing process, equipment, ingredients and techniques. The reader actually gets three books in one: a guide to home brewing, a guide to at-home winemaking, and a guide to making cider. Home Brewing is an invaluable resource for both novices with no experience and accomplished brewers who are looking to expand their repertoire.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Roger Protz","Name":"The ultimate encyclopedia of beer","Price":"0","Description":"An illustrated reference book to beers of the world, from British bitter to the designer beers of Mexico and Japan. In this country-by-country guide more than 1000 brews are evaluated, with tasting notes and information on alcoholic strength.","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Jamie Oliver","Name":"Jamies kitchen","Price":"0","Description":"Jamie's Kitchen-the television show-began as an experiment and turned into a phenomenon. It started when Jamie took in 15 unemployed, enthusiastic kids, trained them to be chefs, and helped them open a restaurant, Fifteen, that has become the hottest dining spot in London. When England's Channel 4 launched a tie-in series, more than four million people tuned in.The show premiers this fall in the U.S. Jamie's Kitchen-the book-is laid out as a cooking course and will inspire readers of all levels. Some of the cooking techniques included are making salads, cooking without heat, poaching and boiling, steaming, stewing and braising, roasting, grilling, and baking. In the process, Jamie shares one-of-a-kind, delicious recipes, such as prosciutto and pecorino, citrus-seared tuna with crispy noodles, herbs, and chili; smoked haddock risotto; and baked chocolate pudding.Jamie includes tips on how to take recipes in new directions and how to be an inspired grocery shopper-spotting what's good, what's in season, and what's a good value. Most important, Jamie encourages budding cooks to have confidence and a sense of independence, and to be master of the kitchen!","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Frederick W. Hackwood","Name":"Inns, Ales and Drinking Customs of Old England","Price":"0","Description":"Find out what they used to drink in Old England.&nbsp;","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Hugh Fearnley-Whittingstall","Name":"Soup Kitchen","Price":"0","Description":"The finest soup recipes from the top chefs of today, from Rick Stein and Delia Smith to Giorgio Locatelli and Jamie Oliver. The book is supported by Hugh Fearnley-Whittingstall, the highly acclaimed presenter of Channel 4's River Cottage and Return to River Cottage. Few foods make us feel as good as soup. From the thick tomato soup of childhood to restorative spicy concoctions on chilly evenings, soup and well-being go hand in hand. Now this fantastic collection brings together 100 recipes from top food writers and chefs at work today. From Delia Smith's Butternut Squash Soup with Toasted Sweetcorn to Jamie Oliver's Chickpea, Leek and Parmesan Soup, there are soups here for every need, whether quick post-work suppers or more sophisticated ideas to serve friends. Headed up by Hugh Fearnley-Whittingstall, who introduces the book and gives his practical advice on stocks and key soup-making techniques, it takes a seasonal approach so you can get the best from fresh ingredients. Quirky, interesting photography and design make this a book with real personality, and royalties will go to homeless charities, including the Salvation Army and Crisis. Turner / Delia Smith / Sam Clarke / Marco Pierre-White / Mary Contini / Giorgio Locatelli / Richard Corrigan / Michel Roux Jnr / Prue Leith / Jamie Oliver","Category":{"CategoryName":"Health & Cookery"}},{"Author":"Chris Mitchell","Name":"The breaking bad cookbook","Price":"0","Description":"Cook like New Mexico's finest TV familyвЂ”from the Whites' celebrated cooked breakfast and Hank Schrader's delicious barbecue, to Walter's mouth-watering Heisenburger and Gus Fring's delectable Los Pollos Hermanos Fried Chicken. All recipes are crystal meth-free.","Category":{"CategoryName":"Health & Cookery"}}]