[{"Author":"E H Carr","Name":"The Bolshevik revolution 1917-1923","Price":"13.90","Description":"In Volume I, E. H. Carr begins with an analysis of the events in Russian history from 1898 to 1917 that shaped the course of the Revolution. He examines the constitutional structure erected by the new government and then turns to the multifarious problems facing the Bolsheviks as they took possession of a rapidly disintegrating Russian empire.","Category":{"CategoryName":"History"}},{"Author":"Paul Adair","Name":"Hitlers greatest defeat","Price":"13.90","Description":"\"Provides more than ample strategic and operational detail and context about the operation...The human view of combat... is most revealing and significant.\"--\"Journal of Slavic Military \"Studies. It was a battle worse than the one at Stalingrad, and World War II's turning point, thanks to Hitler's strategic miscalculations. Succinct and groundbreaking, this analysis of the largely ignored, bloody conflict in Byelorussia reveals how the Nazis lost the Eastern Front. Their defeat cost 350,000 casualities--and left the war effort doomed and broken.","Category":{"CategoryName":"History"}},{"Author":"J G Ballard","Name":"Empire of the sun","Price":"11.90","Description":"The classic, heartrending story of a British boy's four year ordeal in a Japanese prison camp during the Second World War. Newly reissued with an introduction by John Lanchester. Based on J. G. Ballard's own childhood, this is the extraordinary account of a boy's life in Japanese-occupied wartime Shanghai - a mesmerising, hypnotically compelling novel of war, of starvation and survival, of internment camps and death marches. It blends searing honesty with an almost hallucinatory vision of a world thrown utterly out of joint.","Category":{"CategoryName":"History"}},{"Author":"Randall Baker","Name":"Bulgariana","Price":"24.90","Description":"A light-hearted view of life in todayвЂ™s Bulgaria written during two long stays in the country in 2008. The author brings a British sense of humor to bear on the many small things that make this a unique place. He does this through the lives of a number of Bulgarians dealing with life and the Global Financial Crisis. The book provides a unique insight by an outsider of the many things that Bulgarians take for granted, and reflects on the daily remark by Bulgarians вЂњвЂ¦if this was a вЂњnormal&nbsp;countryвЂќ but it wouldnвЂ™t be the Bulgaria the author loves if it were a normal countryвЂ”whatever that is. The book is well-illustrated and is written as the events unfold, giving a real sense of вЂњbeing there.вЂќ","Category":{"CategoryName":"History"}},{"Author":"Trisha Ziff","Name":"Che Guevara revolutionary and icon","Price":"19.90","Description":"Ziff offers a revealing look at the incredibly varied ways a 1960s photo and Che Guevara have been appropriated. The image has become an ideal of abstraction, and this text vividly demonstrates the diverse ways in which it has been used.","Category":{"CategoryName":"History"}},{"Author":"David Shipman","Name":"The story of cinema","Price":"21.90","Description":"First US edition. Book in very good condition; spine has no creases, binding is tight, pages are clean and bright. Illus. w b/w photos throughout. Cover shows minimal shelf wear.","Category":{"CategoryName":"History"}},{"Author":"Herbert Read","Name":"A concise history of modern sculpture","Price":"17.90","Description":"Drawing on the knowledge of a lifetime of study, and the understanding of one who himself participated in the creative adventure of modern art, the late Sir Herbert Read traces the development of modern sculpture from Rodin to the present day and brings order into the apparently chaotic proliferation of styles and techniques during this period. 339 illus., 49 in color.","Category":{"CategoryName":"History"}},{"Author":"Kumiko Kakehashi","Name":"Letters from Iwo Jima","Price":"12.90","Description":"Based on the letters that inspired Clint Eastwood's film LETTERS FROM IWO JIMA reveals the true story of the Battle of Iwo Jima, the subject of two films directed by Clint Eastwood. FLAGS OF OUR FATHERS tells the story of the US Marines who raised the flag above the island: the iconic image of the war with Japan. His other film, LETTERS FROM IWO JIMA tells the story from Japanese point of view. At the heart of the story is the maverick general Tadamichi Kuriyabashi, devoted family man, brilliant leader and the first man on the island to know they were all going to die.As Clint Eastwood comments, 'General Kuribayashi was a unique guy. He liked America. He thought it was a mistake to go to war. . America was too big an industrial complex.' Unlike most Japanese officers, he had travelled abroad, spent time in America, and was under no illusions as to the ultimate end. He fought and died to delay the Americans for as long as he could. He knew that once the island fell, it would be used as an airbase by US bombers to strike at Tokyo. His unorthodox methods made this the fiercest battle the US Marines have ever faced, and he sustained resistance far longer than anyone believed possible. Kumiko Kakehashi's heart-rending account is based on the letters written home by the doomed soldiers on the island, mostly family men, conscripted late in the war. She reveals a very different Japanese army from the popular image. It is an incredibly moving portrayal of men determined to resist to the last breath, despite their profound opposition to the regime that led them into war.","Category":{"CategoryName":"History"}},{"Author":"Tim Flannery","Name":"The life and adventures of John Nicol mariner","Price":"12.90","Description":"In his many voyages, the Scottish-born sailor John Nicol (1755 - 1825) twice circumnavigated the globe, visiting every inhabited continent while participating in many of the greatest events of exploration and adventure of the eighteenth century. During his career Nicol battled pirates, traded with Native Americans, and fought for the British navy in the American and French revolutions. In Hawaii, he was entertained by the King's court mere days after the murder of Captain James Cook. In Jamaica, he saw firsthand the horrors of the slave system and befriended slaves who invited him to join in their dance celebrations. En route to Australia, he would meet the love of his life, Sarah Whitlam, a convict bound for the Botany Bay prison colony, who would bear his son before duty forced them apart forever. An international best-seller, The Life and Adventures of John Nicol, Mariner is a rousing memoir of an ordinary man's extraordinary life, a gripping true adventure tale. \"[Nicol has] made a lasting place for himself in the literature of the sea and ships he loved so deeply.\" -- Jonathan Yardley, The Washington Post","Category":{"CategoryName":"History"}},{"Author":"Rupert Matthews","Name":"Hitler military commander","Price":"12.90","Description":"\"Hitler\" examines Hitler's key military decisions during the Second World War, and assesses how far these decisions were militarily justified in light of the intelligence available at the time. The book gives fascinating insights into Hitler's relationships with his generals, and how opinion of the Fuhrer's grasp of military strategy was shaped by his personality.","Category":{"CategoryName":"History"}},{"Author":"Alan Bullock","Name":"Hitler and Stalin","Price":"15.90","Description":"Forty years after his Hitler: A Study in Tyranny set a standard for scholarship of the Nazi era, Lord Alan Bullock gives readers a breathtakingly accomplished dual biography that places Adolf Hitler's origins, personality, career, and legacy alongside those of Joseph Stalin--his implacable antagonist and moral mirror image.","Category":{"CategoryName":"History"}},{"Author":"Raymond Lamont-Brown","Name":"Japan's Suicide Samurai","Price":"13.90","Description":"Japan's kamikaze pilots sacrificed their lives for the possibility of destroying the enemy's vessels and offered the last, best hope of victory in a war they had begun to lose. A major expert on Japanese culture uncovers the psychology, myth, and reality of this deadly strategy. Original records and personal testimonies describe the organization and operation of the kamikaze on every front. An incomparable portrait.","Category":{"CategoryName":"History"}},{"Author":"Jan Morris","Name":"Pax Britannica","Price":"13.90","Description":"This is the second instalment of the Pax Britannica Trilogy by Jan Morris, recreates the British Empire at its dazzling climax - the Diamond Jubilee of Queen Victoria in 1897, celebrated as a festival of imperial strength, unity, and splendour. This classic work of history portrays a nation at the very height of its vigour and self-satisfaction, imposing on the rest of the world its traditions and tastes, its idealists and rascals. The Pax Britannica Trilogy also includes Heaven's Command: An Imperial Progress and Farewell the Trumpets: An Imperial Retreat. Together these three works of history trace the dramatic rise and fall of the British Empire, from the accession of Queen Victoria in 1837 to the death of Winston Churchill in 1965. Jan Morris is world-renowned for her collection of travel writing and reportage, spanning over five decades and including such titles as Venice, Coronation Everest, Hong Kong, Spain, A Writer's World and most recently, Contact!&nbsp;","Category":{"CategoryName":"History"}},{"Author":"Ted Enever","Name":"Britains best kept secret","Price":"12.90","Description":"This book traces the Park's early history and provides a guide to the key wartime buildings and what went on behind the scenes. In this fully revised new edition, Enever describes the Bletchley Park Trust's battle to acquire the Park and thus preserve this historic site for the nation.","Category":{"CategoryName":"History"}},{"Author":"Witold Rybczynski","Name":"One good turn","Price":"13.90","Description":"The seeds of Rybczynski's elegant and illuminating new book were sown by&nbsp;The New York Times,&nbsp;whose editors asked him to write an essay identifying \"the best tool of the millennium.\" The award-winning author of&nbsp;Home,&nbsp;A Clearing in the Distance, and&nbsp;Now I Sit Me Down, Rybczynski once built a house using only hand tools. His intimate knowledge of the toolbox -- both its contents and its history -- serves him beautifully on his quest.","Category":{"CategoryName":"History"}},{"Author":"Katherine Higgins","Name":"Collecting the 1970s","Price":"19.90","Description":"Miller's Collecting the 1970s (Miller's Collectables Handbook)","Category":{"CategoryName":"History"}},{"Author":"James Schefter","Name":"The race","Price":"17.90","Description":"As incredible as the \"official\" story of the space program is, the true, behind-the-scenes tale is more thrilling. From feuds and practical jokes to near-fatal accidents, \"The Race\" reveals the colorful characters who pulled off the greatest exploration in the history of humankind. of photos.","Category":{"CategoryName":"History"}},{"Author":"Anton Chekhov","Name":"A journey to the end of the Russian empire","Price":"11.90","Description":"Overwhelmed by what he felt was the worthlessness of his great success as a writer, Chekhov (1860-1904) decided to leave everything behind him and go to the far reaches of Siberia - to the terrible Russian penal colony on Sakhalin Island. This book mixes his witty, charming letters back to friends on his long journey with his grim account of the reality of life in one of the worst places on earth. \"Great Journeys\" allows readers to travel both around the planet and back through the centuries - but also back into ideas and worlds frightening, ruthless and cruel in different ways from our own. Few reading experiences can begin to match that of engaging with writers who saw astounding things: great civilisations, walls of ice, violent and implacable jungles, deserts and mountains, multitudes of birds and flowers new to science. Reading these books is to see the world afresh, to rediscover a time when many cultures were quite strange to each other, where legends and stories were treated as facts and in which so much was still to be discovered.","Category":{"CategoryName":"History"}},{"Author":"Robert Beddard","Name":"A kingdom without a king","Price":"17.90","Description":"This is the day by day journal of the Provisional Government as they debated their offer to William and Mary. The editing highlights the conservative Tory and church influence, which is a nice counterpoint to Whig history and the modernized spelling and notes on names and events is well-done and useful.","Category":{"CategoryName":"History"}},{"Author":"Anthony Aveni","Name":"Stairways to the stars","Price":"15.90","Description":"Many ancient societies commanded an elaborate grasp of the movements of the sun, moon, stars and planets, using little or no technology. They saw the sky as an interconnected realm of the natural and spiritual world. This text brings to light recent studies about three ancient cultures. It surveys findings, and delves into the beliefs and astronomy of the three cultures. The research offers conclusions about the hieroglyphic writing about astronomy, known as the \"Mayan Code\", how the Incan city of Cuzco was built as a vast observatory and why Stonehenge was built.","Category":{"CategoryName":"History"}},{"Author":"Peter Lowe","Name":"The Korean War","Price":"11.90","Description":"This is the first title in a new series, Twentieth Century Wars, and is published for the fiftieth anniversary of the outbreak of the Korean War. Peter Lowe provides an overview of the origins, nature and aftermath of the war that was fought in the Korean peninsula between 1950 and 1953. Attention is focused particularly on the extraordinary first year of the war, which witnessed profound variations in the fortunes of both sides. This includes the initial North Korean attack, China's dramatic entry into the war, and the controversy surrounding the conduct and dismissal of General MacArthur. Lowe also discusses why the signing of an armistice in July 1953 failed to secure a full peace settlement. He brings his discussion right up-to-date with the developments in Korea since the death of Kim Il Sung in 1994.","Category":{"CategoryName":"History"}},{"Author":"Sebastian Barry","Name":"A long long way","Price":"13.90","Description":"Told in Sebastian Barry's characteristically beautiful prose, \"A Long Long Way\" evokes the camaraderie and humour of Willie and his regiment, the Royal Dublin Fusiliers, but also the cruelty and sadness of war, and the divided loyalties that many Irish soldiers felt. Tracing their experiences through the course of the war, the narrative brilliantly explores and dramatises the events of the Easter Rising within Ireland, and how such a seminal political moment came to affect those boys off fighting for the King of England on foreign fields - the paralysing doubts and divisions it caused them.","Category":{"CategoryName":"History"}},{"Author":"Gordon Williamson","Name":"The SS","Price":"28.90","Description":"The definitive account of the Nazi's most notorious organization and its role in the Third Reich's internal security forces. Filled with rare historical photos and color maps and illustrations.","Category":{"CategoryName":"History"}},{"Author":"Norman Stone","Name":"The Russian chronicles","Price":"24.90","Description":"The story of Russia, a vast empire straddling Europe and Asia, is enigmatic and tangled, rife with paradox and mystery. In The Russian Chronicles, the people themselves speak out and tell the story of their troubled land from its beginnings to the momentous upheaval of the Revolution in 1917. These first-hand accounts are complemented by vividly illustrated texts written by a team of eminent historians that unravel the complex political and social background the origins of the Slavic people, the horrors of serfdom, the life of the nomadic Cossacks, the Orthodox Church, and other aspects of Russian life through the ages","Category":{"CategoryName":"History"}},{"Author":"Joachim C. Fest","Name":"Plotting Hitler's Death: The German Resistance To Hitler, 1933 45","Price":"12.90","Description":"Time and again, small numbers of Germans, civilian and military, noble and ignoble, scheme to topple the Fuhrer, and on several occasions they came within minutes - or inches - of succeeding. Fest explores why they tried, why they found so little support either in Germany or outside it, and why they failed.","Category":{"CategoryName":"History"}},{"Author":"Duncan Townson","Name":"The New Penguin Dictionary Of Modern History, 1789 1945","Price":"15.90","Description":"This well-written dictionary covers the period 1789-1945. It has longer articles on keywords than most of its competitors and has been well reviewed: 'There is one book on my study desk that I cherish more than any other. It is \"The Penguin Dictionary of Modern History\"' - Brian MacArthur, \"The Times\". 'An invaluable, user-friendly reference book, designed to appeal to all ages' - \"Radio Times\".","Category":{"CategoryName":"History"}},{"Author":"Caroline Taggart","Name":"A Classical Education: The Stuff You Wish You'd Been Taught At School","Price":"11.90","Description":"How many times have you wished that you'd been taught Latin at school? Or that your history stretched all the way back to Greek and Roman myths and legends? Or perhaps you wish you knew all about the great inventions and medical developments that have made our world what it is today? A Classical Education provides all of these classical facts that modern schooling leaves out and many more. Perfect for parents who wish to teach their children and for those who would like to learn or relearn the facts themselves, A Classical Education is informative and educational, but in a completely accessible way, including: . Latin and Greek . Logic and philosophy . Natural sciences . Art and architecture . Poetry and drama . History and Classical literature Also including suggestions for further reading and entertaining tit-bits of information on the classics, A Classical Education is a must for anyone feeling let down by modern schooling.","Category":{"CategoryName":"History"}},{"Author":"Signed Book SWORDS AND PLOUGHSHARES Paddy Ashdown","Name":"Unknown","Price":"19.90","Description":"Signed Book SWORDS AND PLOUGHSHARES Paddy AshdownOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Bringing peace to the 21st century:&nbsp;The men and women of the British armed forces are currently engaged in Afghanistan, Iraq and the Balkans in 'peacekeeping operations'. How do we avoid these missions turning into long-term entanglements, like the current disaster that is Iraq? How do we bring our soldiers home? And what do we do about 'failed states' that are havens for gangsters and terrorists? Paddy Ashdown fears we will soon see major wars between nation states. Many will begin as minor conflicts that will expand into full-scale wars unless the international community intervenes. The war to stop the big wars is to deal promptly with the small ones.Hardcover","Category":{"CategoryName":"History"}},{"Author":"Werner Keller","Name":"Bible As History","Price":"5.90","Description":"Tells the story of the 19th and 20th century discoveries in biblical archaeology, showing how these often confirm the Bible's historical accuracy. Topics and areas of discovery discussed include Abraham and the patriarchs, the Queen of Sheba, Palestine, Babylon and Egypt.","Category":{"CategoryName":"History"}},{"Author":"Rosemary Lambert","Name":"The Twentieth Century","Price":"11.90","Description":"The twentieth century has seen great and rapid changes in society and in art. Artists have challenged all the traditional ways of seeing and depicting the world. They have grouped together in a bewildering series of movements, or followed individual and sometimes baffling preoccupations. In Rosemary Lambert's The Twentieth Century, the art lover is helped through the maze. Key works from Cubism and Fauvism to Pop Art and Photo Realism, from Picasso and Braque to the Bauhaus and beyond, are explored in non-technical language. The reader is conveyed by the author's own enthusiasm towards the discovery of many fascinating parallels in the painting, sculpture and architecture of this century.","Category":{"CategoryName":"History"}},{"Author":"Solomon Northup","Name":"12 years a slave","Price":"12.90","Description":"\"The retelling of Solomon Northup's true story is a valuable contribution to black history. Readers of all ages will enjoy . . . this important account.\" --Dr. Charles A. Hicks, former Arkansas state supervisor of education The best firsthand account of the slavery experience, this autobiographical story, originally published in 1853, has been rewritten to make it accessible to younger readers.Northup, a family man and hack driver in upstate New York, was kidnapped, whisked away from his home, and sold into slavery. His remarkable telling of the epic journey from free man of color to slave to free man again is even more astonishing because it was written entirely from memory. As a slave, Northup was permitted neither pen nor paper, yet he was able to recall his ordeal in exacting detail. Written for children aged nine through thirteen, this story of perseverance presents to children a personal side to the detached history of slavery.","Category":{"CategoryName":"History"}},{"Author":"George Pendle","Name":"A history of Latin America","Price":"12.90","Description":"An authoritative and concise introduction to an area of such great economic potential is certainly needed. This history has been written by a specialist who was closely connected with Latin America for over 40 years. His text emphasizes how many races and classes have contributed to the civilization of this great land-mass, with its vast mountain ranges, rivers, prairies, forests, and deserts: Indians, European conquistadores, priests, planters, African slaves, caudillos, liberal intellectuals, and commercial pioneers.","Category":{"CategoryName":"History"}},{"Author":"Jung Chang","Name":"Mao the unknown story","Price":"17.90","Description":"The most authoritative life of the Chinese leader every written,&nbsp;Mao: The Unknown Story&nbsp;is based on a decade of research, and on interviews with many of Mao s close circle in China who have never talked before and with virtually everyone outside China who had significant dealings with him. It is full of startling revelations, exploding the myth of the Long March, and showing a completely unknown Mao: he was not driven by idealism or ideology; his intimate and intricate relationship with Stalin went back to the 1920s, ultimately bringing him to power; he welcomed Japanese occupation of much of China; and he schemed, poisoned, and blackmailed to get his way. After Mao conquered China in 1949, his secret goal was to dominate the world. In chasing this dream he caused the deaths of 38 million people in the greatest famine in history. In all, well over 70 million Chinese perished under Mao s rule in peacetime.","Category":{"CategoryName":"History"}},{"Author":"Hugh Brogan","Name":"Penguin history of the USA","Price":"15.90","Description":"This new edition of Brogan's superb one-volume history - from early British colonisation to the Reagan years - captures an array of dynamic personalities and events. In a broad sweep of America's triumphant progress. Brogan explores the period leading to Independence from both the American and the British points of view, touching on permanent features of 'the American character' - both the good and the bad. He provides a masterly synthesis of all the latest research illustrating America's rapid growth from humble beginnings to global dominance.","Category":{"CategoryName":"History"}},{"Author":"Michael Glenny","Name":"The other Russia","Price":"21.90","Description":"This book is the product of many years research and interviewing. Michael Glenny travelled throughout the world to track down the eyewitness accounts reproduced here of the 1905 Revolution, the 1917 Revolution, and life in Soviet Russia in the time of Lenin and Stalin. The stories told here are the stories of those who left, emigres fleeing from Bolshevism, Stalinism and most recently, anti-Jewish discrimination. The book is both a picture of a world that has been lost and an account of the lives of some of the centuries most famous refugees.","Category":{"CategoryName":"History"}},{"Author":"Norman Stone","Name":"The Makers of English History: Forty-Five Great English Men and Women","Price":"19.90","Description":"What has made English history what it is? Who are its leading characters? This book examines these questions by presenting the lives of 45 extraordinary individuals who have contributed the most to England's history, whether in art, politics, economics or the armed forces. They include not only the traditional giants of English history, such as Alfred the Great, William Shakespeare and Winston Churchill, but also less familiar figures like the 14th-century financier William de la Pole and Virginia Woolf.","Category":{"CategoryName":"History"}},{"Author":"Barry Miles","Name":"Jack Kerouac: King of the Beats","Price":"15.90","Description":"Drawing on Kerouac's close friendship and conversations with Ginsberg and Burroughs, the author offers provocative new insights into the world of the Beat Generation and its exuberant king.","Category":{"CategoryName":"History"}},{"Author":"Christopher Priest","Name":"The Separation","Price":"11.90","Description":"THE SEPARATION is the story of twin brothers. Rowers in the 1936 Olympics, they meet Rudolf Hess, Hitler's deputy; one joins the RAF, and captains a Wellington; he is shot down after a bombing raid on Hamburg and become's Churchill's aide-de-camp; his twin brother, a pacifist, works with the Red Cross, rescuing bombing victims in London. But this is not a straightforward story of the Second World War: this is an alternate history: the two brothers - both called J.L. Sawyer - live their lives in alternate versions of reality.In one, the Second World War ends as we imagine it did; in the other, thanks to efforts of an eminent team of negotiators headed by Hess, the war ends in 1941. THE SEPARATION is an emotionally riveting story of how ordinary people can make a difference; it's a savage critique of Winston Churchill, the man credited as the saviour of Britain and the Western World, and it's a story of how one perceives and shapes the past. THE SEPARATION was originally published by Simon &amp; Schuster as a trade paperback, with a very small print run; it went out of print almost immediately and was never reprinted. Gollancz will publish initially as a price-promoted hardcover, as a platform for reviews and national newspaper coverage, prior to lead title paperback publication in 2004.","Category":{"CategoryName":"History"}},{"Author":"Herbert Asbury","Name":"The Gangs Of New York","Price":"11.90","Description":"The Gangs of New York is a tour through a now unrecognisable city of abysmal poverty and habitual violence centred around the infamous slum of Five Points, with its rival Irish and American gangs. Cobbled from legend, memory, police records, the self-aggrandizements of aging crooks, popular journalism, and solid historical research, this is a powerful account of New York City's tumultuos past. Asbury presents the definitive work on this subject, an illumination of the gangs of old New York that ultimately gave rise to the modern Mafia and its depiction in cult films like The Godfather.","Category":{"CategoryName":"History"}},{"Author":"Philip Glazebrook","Name":"Journey To Kars (Travel Library)","Price":"12.90","Description":"For Victorian travellers a trip to Turkey was a leap into the dark of Islam. Fascinated by their accounts of the far-flung, down-at-heel Ottoman Empire, novelist and traveller Philip Glazebrook followed in their footsteps. His destination was Kars, the city within view of Mount Ararat where the Ark was stranded. Through the old Serbian and Greek provinces and islands, through the ruined cities of Asia Minor, to Kars and then back to Trebizond, Istanbul and the Balkan capitals - this book recounts his adventures.","Category":{"CategoryName":"History"}},{"Author":"Humphrey Carpenter","Name":"That Was Satire, That Was: The Satire Boom Of The 1960s","Price":"9.90","Description":"Forty years ago, at the 1960 Edinburgh Festival, four young men - Peter Cook, Dudley Moore, Jonathan Miller and Alan Bennett - walked on to a stage and changed the face not merely of British comedy but of social attitudes in this country. BEYOND THE FRINGE was iconoclastic, fracturing the 'culture of deference' which had predominated in the 1950s. It was the forerunner of an explosion of satire which included The Establishment Club, PRIVATE EYE and the BBC's daring weekly satire show, THAT WAS THE WEEK THAT WAS. Award-winning biographer Humphrey Carpenter evokes the atmosphere of 60's Britain and the social and political conditions which enraged and inspired the satirists, and brings vibrantly alive this amusing but also key period of British cultural life.","Category":{"CategoryName":"History"}},{"Author":"Scriptura Mundi Writings Of The World","Name":"Unknown","Price":"39.90","Description":"This thorough, and almost breathtaking, collection appears as \"The First International Review on Writing and Written Cultures of the World.\" The editor explains that \"Scriptura Mundi is an initiative of the NGO for international cultural and media cooperation Balkanmedia Association, founded in 1990 in Sofia,&nbsp;Bulgaria.&nbsp;Scriptura Mundi for the first time presents a wide international and multi perspective, panoramic view on writing and written cultures of the world. It includes the studies of 38 leading national experts from 24 countries on the relevant alphabets and writing systems\" .&nbsp;The very&nbsp;scope and complexity of the book&nbsp;makes it impossible to summarize beyond a brief overview of the contents, though even this brief summary gives a good sense of the scope of the work.","Category":{"CategoryName":"History"}},{"Author":"Mark Mazower","Name":"The Balkans","Price":"0","Description":"Focusing on the emergence of nation-states in the 19th and 20th centuries, out of the collapsing Ottoman and Hapsburg empires, \"The Balkans\" takes the story of Europe's most volatile and strategically important region through the world wars, cold war, the disintegration of Yugoslavia, and the continuing search for stability in southeastern Europe.","Category":{"CategoryName":"History"}},{"Author":"Nora Chadwick","Name":"The Celts","Price":"0","Description":"Although there is no written record of their prehistoric culture, the Celtic people left behind much archaeological and anthropological evidence of a way of life that was highly evolved. Here a Celtic scholar takes us beyond Stonehenge in a new edition of a classic work about one of history's most intriguing and influential cultures. 3 maps. photos.","Category":{"CategoryName":"History"}},{"Author":"Gwyn Jones","Name":"A history of the Vikings","Price":"0","Description":"An utterly splendid book.' Scandinavian Studies . Hardback reissued 1987.","Category":{"CategoryName":"History"}},{"Author":"Robin Sommer","Name":"Wars of the 20th century","Price":"0","Description":"Wars Of The 20th Century","Category":{"CategoryName":"History"}},{"Author":"Hilda Ellis Davidson","Name":"Scandinavian mythology","Price":"0","Description":"Scandinavian mythology reflects the Norsemen's love of battle &amp; conflict. Here are stories of mighty warriors, ruthless gods, giants, dwarfs, elves, and monsters, reflecting a world ruled by conflict &amp; powerful magic. 8\" x 11\". Color &amp; b&amp;w illus.","Category":{"CategoryName":"History"}},{"Author":"Laurence Rees","Name":"War of the century","Price":"0","Description":"The fall of Communism provided access to Russian archives never before available to the international community, making it possible to find and question many of those who experienced the вЂњwar of the century.вЂќ Laurence Rees, author and producer of the Peabody AwardвЂ“winning&nbsp;The Nazis: A Warning from History, uses previously unpublished material and photographs, dramatic interviews with witnesses who knew Hitler or Stalin, and the voices of soldiers and civilians on the Eastern Front to shed new light on HitlerвЂ™s вЂњwar of annihilation.вЂќ","Category":{"CategoryName":"History"}},{"Author":"Richard Gordon Smith","Name":"The Japan diaries","Price":"0","Description":"The diaries of Richard Gordon Smith, an Edwardian explorer, naturalist and sportsman, are a fascinating personal record of the forty years he spent traveling throughout the world. With an unbound sense of adventure and curiosity, his journeys took him from the wilds of Quebec, to the exotic beauty of Burma, Ceylon and Singapore to Shanghai Korea and finally Japan, a country for which he formed a lasting passion.","Category":{"CategoryName":"History"}},{"Author":"Magnus Magnusson","Name":"Vikings","Price":"0","Description":"First published in 1980 to accompany a major BBC Television series, this book explores the myth and the reality of Viking culture. The Vikings have a traditional image as fierce sea-warriors, but recent archaeological discoveries in Europe and America show them in a new light - as the greatest traders of their day and as explorers who extended the boundaries of what was to Europe the known world.","Category":{"CategoryName":"History"}},{"Author":"Brian Catchpole","Name":"The Korean war","Price":"0","Description":"From the American attempts to take back Pusan from the North Korean communist forces at the outset of the war in 1950, to the U.S. assault on Inchon and capture of Seoul, to the final bloody battles of Pork Chop, Old Baldy, and the Hook in 1953, this military history authoritatively chronicles the conflict that became America's first unwinnable foreign war and gravely demonstrated the limits of the West's power in the East.","Category":{"CategoryName":"History"}},{"Author":"Anthony Pagden","Name":"Peoples and empires","Price":"0","Description":"Written by one of the worldвЂ™s foremost historians of human migration,&nbsp;Peoples and Empires&nbsp;is the story of the great European empiresвЂ”the Roman, the Spanish, the French, the BritishвЂ”and their colonies, and the back-and-forth between вЂњusвЂќ and вЂњthem,вЂќ culture and nature, civilization and barbarism, the center and the periphery. ItвЂ™s the history of how conquerors justified conquest, and how colonists and the colonized changed each other beyond all recognition.&nbsp;","Category":{"CategoryName":"History"}},{"Author":"Peter G Tsouras","Name":"Rising sun victorious","Price":"0","Description":"In war, victory can be held hostage to seemingly insignificant incidents-chance events, opportunities seized or cast aside-that can derail the most brilliant military strategies and change the course of history. What if the Japanese had conquered India and driven out the British? What if the strategic link between the United States and Australia had been severed? What if Vice Admiral Nagumo had launched a third attack on Pearl Harbor? What if the U.S. Navy's gamble at Midway had backfired?","Category":{"CategoryName":"History"}},{"Author":"Steve Jones","Name":"Darwins Island","Price":"0","Description":"The Origin of Species may be the most famous book in science but its stature tends to obscure much of Charles Darwin's other works. His visit to the Galapagos lasted just five weeks and on his return he never left Britain again. Darwin spent forty years working on the plants, animals and people of his native land and wrote over six million words on topics as different as dogs, insect-eating plants, orchids, earthworms, apes and human emotion. Together they laid the foundations of modern biology. In this beautifully written, witty and illuminating book, Steve Jones explores the domestic Darwin, tracing the great naturalist's journey across Britain: a voyage not of the body, but of the mind.","Category":{"CategoryName":"History"}},{"Author":"Alex de Waal","Name":"Darfur","Price":"0","Description":"The humanitarian tragedy in Darfur has stirred politicians, Hollywood celebrities and students to appeal for a peaceful resolution to the crisis. Beyond the horrific pictures of sprawling refugee camps and lurid accounts of rape and murder lies a complex history steeped in religion, politics, and decades of internal unrest. \"Darfur\" traces the origins, organization and ideology of the infamous Janjawiid and other rebel groups, including the Sudan Liberation Army and the Justice and Equality Movement. It also analyzes the confused responses of the Sudanese government and African Union. This thoroughly updated edition also features a powerful analysis of how the conflict has been received in the international community and the varied attempts at peacekeeping","Category":{"CategoryName":"History"}},{"Author":"Thomas Cahill","Name":"How the Irish saved civilisation","Price":"0","Description":"From the fall of Rome to the rise of Charlemagne - the \"dark ages\" - learning, scholarship, and culture disappeared from the European continent. The great heritage of western civilization - from the Greek and Roman classics to Jewish and Christian works - would have been utterly lost were it not for the holy men and women of unconquered Ireland.&nbsp;","Category":{"CategoryName":"History"}},{"Author":"Hugh Gough","Name":"The terror in the French revolution","Price":"0","Description":"Why has the guillotine become one of the best known symbols of the French Revolution? Why did a revolution, which set out to provide French people with constitutional government and freedom in 1789, end up with a dictatorship that executed tens of thousands of them in 1793-4? Such questions have fascinated observers of the French Revolution since the 1790s and those concerning the Terror have remained the most controversial. This book examines the arguments, analyses the Terror's background and plots a path through the historical minefield that lies between the fall of the Bastille in 1789 and the work of the guillotine during the Terror. It puts the Terror into context and shows how events and ideas interacted to create an event that has haunted the political imagination of Europe ever since.","Category":{"CategoryName":"History"}},{"Author":"Tim Flannery","Name":"The explorers","Price":"0","Description":"In this lively collection of stories of adventure and discovery, \"The Explorers\" tells the epic saga of the conquest and settlement of Australia. Flannery presents 67 accounts that convey the sense of wonder along with the dimensions of struggle.","Category":{"CategoryName":"History"}},{"Author":"Andrew Wheatcroft","Name":"Infidels","Price":"0","Description":"How did we learn to hate or despise? Simply, because we were taught to. In 638 the Christian Patriarch of the Holy city of Jerusalem called the Muslim Caliph's presence an abomination in the sight of God. Christians and Muslims have since regarded each other warily and have silently thought of each other as 'infidels.' This book traces the long history of this troubled relationship. It was a campaign without end, waged with the pen, through the printing press, by the power of the human voice and on sublte and insidious suggestions with paintings, drawings and engravings. In this brilliant book we see how and why a battle is still being waged today, through the press, books, television, radio and the internet.","Category":{"CategoryName":"History"}},{"Author":"Chris Chant","Name":"Warfare and the third reich","Price":"0","Description":"Warfare and the Third Reich is divided into three parts, which consider separately the German land and naval forces, the generals, and the Luftwaffe. Each is examined with the aim of explaining why it ultimately failed. In a departure from many World War II books, Chant examines the economic measures, propaganda, coercion, technology and political skills which also formed an important part of the Third Reich's arsenal.","Category":{"CategoryName":"History"}},{"Author":"Philip Longworth","Name":"Russia's empires","Price":"0","Description":"\"Russia's Empires\" explores the dynamics of Russia's past through time and space, from the nameless adventurers who first penetrated this vast, inhospitable terrain to a cast of dynamic characters that includes Ivan the Terrible, Catherine the Great and Stalin. The narrative takes in the magnficent, historic cities of Kiev, Moscow and St. Petersburg; it stretches to Alaska in the east, to the Black Sea and the Ottoman Empire to the south, to the Baltic in the west and to Archangel and the Artic Ocean to the north. The book asks such tantalizing questions as: Who are the Russians and what is the source of their imperialistic culture? Why was Russia so driven to colonize and conquer? From Kievan Rus'-the first ever Russian state, which collapsed with the invasion of the Monguls in the thirteenth century-to ruthless Muscovy, the Russian Empire of the eighteenth century and finally the Soviet period, this groundbreaking study analyzes the growth and dissolution of each vast empire as it gives way to the next.","Category":{"CategoryName":"History"}},{"Author":"Gavan Daws","Name":"Prisoners of the Japanese","Price":"0","Description":"Gavan Daws combined ten years of documentary research and hundreds of interviews with POWs on three continents to write this shattering re-creation of the experience of Allied POWs of the Second World War in the Pacific -- British, Australian, American and Dutch.","Category":{"CategoryName":"History"}},{"Author":"Andrew West","Name":"Rolling Thunder in a gentle land","Price":"0","Description":"From the Introduction In the end, then, the Vietnam War was a conflict of myriad complexities. It was a colonial war and a regional war. It was a total war and a limited war. It was a civil war, an insurgency and a conventional war - and indeed it varied from one form to another at different times and in different places. It was a war in mountains, jungles or open rice paddies depending on the location of the battlefield. It was a war of high technology and no technology. It was a war of airpower and a war of footpower. It was a helicopter war and a brown-water war. It was a war won on the battlefield and lost on the homefront. One thing that the Vietnam War was not was simply an American War.","Category":{"CategoryName":"History"}},{"Author":"Susannah Handley","Name":"Nylon","Price":"0","Description":"Beginning in a test tube and ending on the catwalk, Nylon brings together social history and the story of fashion.","Category":{"CategoryName":"History"}},{"Author":"E J Hobsbawm","Name":"The age of empire 1875-1914","Price":"0","Description":"This title is about the death of the 19th century, the world made by and for liberal middle classes in the name of universal progress and civilization. It is about hopes realized which turned into fears: an era of unparalled peace engendering an era of unparalled war; revolt and revolution inevitably emerging on the outskirts of a stable and flourishing Western society; an era of profound identity crises for bourgeois classes whose traditional moral foundations crumbled under the pressure of their own accumulations of wealth and comfort, among a new and sudden mass labour movement which rejected capitalism, new middle classes which rejected liberalism. It is about world empires built and held with almost contemptuous ease by small bodies of Europeans, which were to last barely a human lifetime, and a European domination of world history never more confident than at the moment when it was about to disappear forever.","Category":{"CategoryName":"History"}},{"Author":"Peter L Bernstein","Name":"The power of gold","Price":"0","Description":"From mines to myths, worship to war, art museums to financial markets, the role of gold has been engraved in the annals of human civilization. In the narrative style of his bestselling \"Against the Gods\", Bernstein reveals a record of human nature in the ubiquity of gold.","Category":{"CategoryName":"History"}},{"Author":"Magnus Magnusson","Name":"Iceland Saga","Price":"0","Description":"Magnus Magnusson relates the world-famous Icelandic sagas to the spectacular living landscapes of today, taking the reader on a literary tour of the mountains, valleys, and fjords where the heroes and heroines of the sagas lived out their eventful lives. He also tells the story of the first Viking settler, Ingolfur Anarson.","Category":{"CategoryName":"History"}},{"Author":"Noam Chomsky","Name":"Power And Terror: Post 9 11 Talks And Interviews","Price":"0","Description":"In this, his first new book since the international bestseller \"9-11,\" Noam Chomsky presents his latest thinking on terrorism and U.S. foreign policy, focusing on alternatives to the current course of armed provocation. Noam Chomsky is the author of, among many other books, \"Profit over People,\" and the international anti-war bestseller \"9-11,\" which has sold over 300,000 copies worldwide.","Category":{"CategoryName":"History"}},{"Author":"David Shipman","Name":"Cinema the first hundred years","Price":"0","Description":"In 1893 Thomas Alva Edison built the first film studio, a hut on a pivot which could be rotated to follow the sun. The first film came later the same year, when a camera caught one of Edison's assistants mid-sneeze. From inauspicious, low-budget start has grown a medium that has influenced world history as powerfully as history has influenced it. In \"Cinema: The First Hundred Years\", David Shipman takes a year-by-year look at cinema's phenomenal growth. He describes the best - and worst - films from each year, charts the rise and fall of the stars, and records the staggering technical developments. He shows, too, how the century's films reflect our attitudes towards sex, religion, politics and racism.","Category":{"CategoryName":"History"}},{"Author":"Magnus Magnusson","Name":"Viking hammer of the north","Price":"0","Description":"The Vikings hold a particular place in the history of the West, both mythologically and in the significant impact they had on Northern Europe. Magnus MagnussonвЂ™s indispensable study of this great people presents a rounded and fascinating picture of a nation who, in modern eyes, would seem to embody striking contradictions. They were undoubtedly pillagers, raiders, and terrifying warriors, but they were also great pioneers, artists, and tradersвЂ”a dynamic people, whose skill and daring in their exploration of the world has left an indelible impression a thousand years on.","Category":{"CategoryName":"History"}},{"Author":"Richard Leigh","Name":"Secret Germany: Stauffenberg and the True Story of Operation Valkyrie","Price":"0","Description":"From the bestselling authors of \"The Holy Blood and the Holy Grail\" and \"The Dead Sea Scrolls Deception\" comes a stunning revelation of Hitler's secret enemy and the plot to kill him.","Category":{"CategoryName":"History"}},{"Author":"Masuji Ibuse","Name":"Black rain","Price":"0","Description":"A novel which treats the atom-bombing of Hiroshima in an unsentimental and un-sensational way. On publication the book won two Japanese literary awards, the Noma Prize and the Cultural Prize.","Category":{"CategoryName":"History"}},{"Author":"Christian Wolmar","Name":"The subterranean railway","Price":"0","Description":"Since the Victorian era, London's Underground has had played a vital role in the daily life of generations of Londoners. In The Subterranean Railway, Christian Wolmar celebrates the vision and determination of the nineteenth-century pioneers who made the world's first, and still the largest, underground passenger railway: one of the most impressive engineering achievements in history. From the early days of steam to electrification, via the Underground's contribution to twentieth-century industrial design and its role during two world wars, the story comes right up to the present with its sleek, driverless trains and the wrangles over the future of the system. The Subterranean Railway reveals London's hidden wonder in all its glory and shows how the railway beneath the streets helped create the city we know today.","Category":{"CategoryName":"History"}},{"Author":"Max Hastings","Name":"The Korean war","Price":"0","Description":"'A brilliant and compelling book which must rank, even by the standards Max Hastings has set, as a masterpiece' - Professor Michael Howard, London Review of Books. On 25 June 1950, the invasion of South Korea by the Communist North launched one of the bloodiest and most devastating conflicts of our battle-scarred century. The seemingly limitless power of the Chinese-backed North was thrown against the ferocious firepower of the UN-backed South in a war that can be seen today as the stark prelude to Vietnam. Max Hastings, the acclaimed author of \"Overlord and Bomber Command\", has drawn on first-hand accounts of those who fought on both sides to produce this vivid and incisive reassessment of the Korean War, bringing the military and human dimensions of the conflict into sharp focus. 'Excellent, readable history by a master of the genre' - \"Daily Mail.\" 'The description of the stand of the Gloucesters on the Imjin is exemplary. Hastings has spared no pains to dig deep in search of the real truth, and to seek out and interview those who took part in the events he chronicles with such finely balanced judgement' - Field Marshall Lord Carver, \"Times Literary Supplement.\"","Category":{"CategoryName":"History"}},{"Author":"Robert Service","Name":"Russia: Experiment With A People","Price":"0","Description":"The first history of modern Russia from 1991 to the present day by one of the leading historians of the 20th century USSR and Russia. In 1991, in a huge experiment with a people and in a state of euphoria, Boris Yeltsin abolished the USSR and recreated the Russian nation. At the point of its declaration is was in a state of economic and social disarray and yet there were high hopes. Hopes which have subsequently been dashed.Robert Service brings to bear his vast knowledge of the people and the country to put the recent upheavals into context and he shows that not everything changed for the worst 1991. The Gorbachev years have allowed the Russian people to give a priority to living a private life and shutting the door on the state. They could think what they liked. The could enjoy intellectual and religious freedom, and indulge in recreations their income would allow. Gays and Lesbians could come 'out'. The Youth culture could finally be loosed from contraints. This is a broad political, social and cultural history of one of the newest nations ever to be formed.","Category":{"CategoryName":"History"}},{"Author":"Sterling Seagrave","Name":"The Yamato dynasty","Price":"0","Description":"The author who exposed China's ruthless roots in his bestselling \"The Soong Dynasty\" now reveals the closely guarded, controversial secrets of the shoguns, financiers, emperors, and empresses who have shrouded and controlled the world's longest-reigning dynasty.","Category":{"CategoryName":"History"}},{"Author":"Michael Smith","Name":"The emperors codes","Price":"0","Description":"In this gripping, previously untold story from World War II, Michael Smith examines how a group of eccentric codebreakers cracked Japan's secret codes and turned the tide of the war in the Pacific. Drawing upon recently declassified British files, privileged access to Australian secret official histories, and interviews with many of the men involved,&nbsp;The Emperor's Codes&nbsp;takes the reader step-by-step through the codebreaking process, explaining exactly how the codebreakers went about their daunting task-made even more difficult by the vast linguistic differences between Japanese and English. It details the grueling work and almost unfathomable dedication demonstrated by these relatively unsung heroes, without whose extraordinary exploits the outcome of World War II might have been very different.","Category":{"CategoryName":"History"}},{"Author":"Joshua Piven","Name":"The worst case scenario almanac History","Price":"0","Description":"Best-seller history repeats itself with this dynamic new \"almanac\" format that broadens the scope and content of the \"Worst-Case Scenario\" handbooks. \"The Worst-Case Scenario Almanac: History\" offers step-by-step illustrated scenarios on how to win a joust, survive in a dungeon, and overcome other plights of yesteryear, but the volume also features hundreds of pages of additionaland hilariousinformation in the form of lists (the worst jobs to have during the Industrial Revolution), offbeat profiles (Attila the Hun, Idi Amin), Worst-Case Wisdom (bad advice), descriptions of disasters narrowly averted, and much more. Packed with charts, graphs, maps, and timelines, \"The Worst-Case Scenario Almanac: History\" is an invigorating look at all that's gone wrong in the past and the best way to prepare for the future.","Category":{"CategoryName":"History"}},{"Author":"Signed Book NOBODYS PERFECT Anthony Lane","Name":"Unknown","Price":"0","Description":"Signed Book NOBODYS PERFECT Anthony LaneOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Those who have long awaited this compilation of Lane's most memorable pieces will not be disappointed. He is intellectual, witty, entertaining, and, without a doubt, one of the finest reviewers of our time. Compared frequently to Edmund Wilson and Kenneth Tynan, Lane exercises his expansive knowledge on a seemingly endless number of topics in this delightful group of commentaries, originally published in his New Yorker column.Hardcover","Category":{"CategoryName":"History"}},{"Author":"Maldwyn A. Jones","Name":"The limits of liberty","Price":"0","Description":"This is a major survey of the American past from the earliest colonial settlements to the present day. It traces the political, intellectual, economic, and cultural development of a distinctive American society, without losing sight of its continued connections with the Old World. Swelled by a continuous flux of immigration, the population of the United States spread with astonishing rapidity over a vast continent, evolving a new system of government and creating extraordinary wealth. Maldwyn A. Jones assesses not only the epic achievements of the nation, but also the tensions and limitations of the society behind the 'American dream'. In this second edition Professor Jones has continued his study to the present, with a new chapter examining the conservative revival of the 1980s and the presidential election of 1992. He has included an additional map, incorporated the most recently available statistics into the population tables, and completely revised and updated the Bibliography.","Category":{"CategoryName":"History"}},{"Author":"David Bodanis","Name":"Passionate minds","Price":"0","Description":"It was 1733 when the poet and philosopher Voltaire met Emilie du ChГўtelet, a beguilingвЂ”and marriedвЂ”aristocrat who would one day popularize NewtonвЂ™s arcane ideas and pave the way for EinsteinвЂ™s theories. In an era when women were rarely permitted any serious schooling, this twenty-seven-year-oldвЂ™s nimble conversation and unusual brilliance led Voltaire, then in his late thirties, to wonder, вЂњWhy did you only reach me so late?вЂќ They fell immediately and passionately in love.","Category":{"CategoryName":"History"}},{"Author":"J. D. Fage","Name":"A short history of Africa","Price":"0","Description":"Dramatic alterations in political power have corrected the once prevalent vision of a European-centered world. While the centers of European culture flourished, decayed and sprouted in turn, empires in Africa rose, ruled, resisted, and succumbed. Much of Africa's past has now been excavated from ignorance and error, revealing a rich and previously little-known human heritage.This classic work draws on the whole range of literature about Africa as well as evidence provided by archaeology, oral traditions, language relationships, and social institutions. It marshals the most authoritative views of African specialists into an absorbing narrative and puts forward original conclusions that take the study of Africa a stage further.","Category":{"CategoryName":"History"}},{"Author":"Frederick W. Hackwood","Name":"Inns, Ales and Drinking Customs of Old England","Price":"0","Description":"Find out what they used to drink in Old England.&nbsp;","Category":{"CategoryName":"History"}},{"Author":"Norman Stone","Name":"World War One: A Short Story","Price":"0","Description":"In 1914 a new kind of war, and a new kind of world, came about. Fourteen million combatants died, a further twenty million were wounded, four empires were destroyed and even the victors' empires were fatally damaged. The First World War marked a revolution in the technology of slaughter as trench warfare, artillery barrages, tanks and chemical warfare made their mark on the battlefield for the first time.The sheer complexity and scale of the war have encouraged historians to write books on a similar scale. But in only 140 pages, Norman Stone distils a lifetime of teaching, arguing and thinking to reframe the overwhelming disaster whose aftershocks shaped the rest of the twentieth century.","Category":{"CategoryName":"History"}},{"Author":"Liza Picard","Name":"Dr Johnsons London","Price":"0","Description":"The practical realities of everyday life are rarely described in history books. To remedy this, and to satisfy her own curiosity about the lives of our ancestors, Liza Picard immersed herself in contemporary sources - diaries and journals, almanacs and newspapers, government papers and reports, advice books and memoirs - to examine the substance of life in mid-18th century London. The fascinating result of her research,&nbsp;Dr. Johnson's London&nbsp;introduces the reader to every facet of that period: from houses and gardens to transport and traffic; from occupations and work to pleasure and amusements; from health and medicine to sex, food, and fashion. Stops along the way focus on education, etiquette, public executions as popular entertainment, and a melange of other historical curiosities.This book spans the period from 1740 to 1770-very much the city of Dr. Johnson, who published his great&nbsp;Dictionary&nbsp;in 1755. It starts when the gin craze was gaining ground and ends just before America ceased being a colony. In its enthralling review of an exhilarating era,&nbsp;Dr. Johnson's London&nbsp;brilliantly records the strangeness and individuality of the past--and continually reminds us of parallels with the present day.","Category":{"CategoryName":"History"}},{"Author":"Felipe Fernandez-Armesto","Name":"The Americas","Price":"0","Description":"In this groundbreaking work, leading historian Felipe FernГЎndez-Armesto tells the story of our hemisphere as a whole, showing why it is impossible to understand North, Central, and South America in isolation without turning to the intertwining forces that shape the region. With imagination, thematic breadth, and his trademark wit, FernГЎndez-Armesto covers a range of cultural, political, and social subjects, taking us from the dawn of human migration to North America to the Colonial and Independence periods to the вЂњAmerican CenturyвЂќ and beyond. FernГЎndez-Armesto does nothing less than revise the conventional wisdom about cross-cultural exchange, conflict, and interaction, making and supporting some brilliantly provocative conclusions about the AmericasвЂ™ past and where we are headed.","Category":{"CategoryName":"History"}},{"Author":"Friedrich Katz","Name":"Ancient American civilisations","Price":"0","Description":"Tracing the development of ancient civilizations of the pre-Columbian Americas, this is a fascinating account of how these civilizations culminated in the magnificent empires of the Aztecs and Incas.","Category":{"CategoryName":"History"}},{"Author":"Alan Palmer","Name":"The decline and fall of the Ottoman empire","Price":"0","Description":"Like Charles II, the sick man of Europe was 'an unconscionable time dying.' Time and time again from the seventeenth century observers predicted the collapse of the Ottoman Empire, yet it outlived all its rivals. As late as 1910 it straddled three continents. Unlike the Romanovs, Hohenzollerns or Habsburgs, the House of Osman was still recognised as an imperial dynasty during the peacemaking which followed the First World War. This book offers a fascinating overview of the Ottoman Empire's decline from the failure to take Vienna in 1683 to the abolition of the Sultanate in 1922 by Mustafa Kemal, after a revolutionary upsurge of Turkish national pride. It deals with constantly recurring problems: competing secular and religious authority; acceptance or rejection of Western ideas; greedy neighbours; population movements; and the strength or weakness of successive Sultans.The book also emphasises the challenges of the early twentieth century, when railways and oilfields gave new importance to Ottoman lands in the Middle East. Recent events have put the problems that faced the later Sultans back upon the world agenda. Names like Basra and Mosul again make the headlines. So, too, do the old empire's outposts in Albania and Macedonia in the west and the mountainous Caucasus in the east. Alan Palmer's narrative reminds us of the long, sad continuity of conflict in the Lebanon. We read of the Kurdish struggle for survival, of Armenian aspirations for independence, of the lingering interests of the Ottomans in their Libyan provinces, and of the Muslim character of Sarajevo in the troubled country that was once Yugoslavia. The Ottoman past has great relevance to the changing patterns of eastern Europe and western Asia in the twentieth century.","Category":{"CategoryName":"History"}},{"Author":"Suzanne Bailey","Name":"Essential history of American art","Price":"0","Description":"American artists are among the most innovative and groundbreaking in the entire history of art. They have introduced new forms and styles and have helped to further push out the boundaries of artistic development.&nbsp;Written with a comprehensive introduction,&nbsp;Essential History of American Art&nbsp;looks in detail at the range of art that has been produced by American artists, with detailed commentary on 120 works. Some of these are considered the most important pieces; others may be less well known, but they are all essential to the development of American Art.","Category":{"CategoryName":"History"}},{"Author":"Vera Brittan","Name":"Testament of youth","Price":"0","Description":"Much of what we know and feel about the First World War we owe to Vera Brittain's elegiac yet unsparing book, which set a standard for memoirists from Martha Gellhorn to Lillian Hellman. Abandoning her studies at Oxford in 1915 to enlist as a nurse in the armed services, Brittain served in London, in Malta, and on the Western Front. By war's end she had lost virtually everyone she loved.&nbsp;Testament of Youth&nbsp;is both a record of what she lived through and an elegy for a vanished generation. Hailed by the&nbsp;Times Literary Supplement&nbsp;as a book that helped вЂњboth form and define the mood of its time,вЂќ it speaks to any generation that has been irrevocably changed by war.","Category":{"CategoryName":"History"}},{"Author":"Misha Glenny","Name":"Eastern Europe in the Age of Democracy; 2nd Edition","Price":"0","Description":"This book explains the changes that will be in place as a result of the 1992 democratic elections throughout Eastern Europe. For 40 years Eastern Europe has been erroneously considered a political monolith but beneath apparently identical structures of power, old political tensions continued to ferment. Glenny shows how these traditions have broken out into newly legitimized political parties, offering the reader a comprehensive map of this turbulent area's traditions and prospects. He provides some understanding of the crucial inter-war years that still shape so much of the region's politics. There are biographical portraits of the major political personalities.","Category":{"CategoryName":"History"}},{"Author":"Ahmed Rashid","Name":"Jihad: The Rise Of Militant Islam In Central Asia","Price":"0","Description":"Biological diversity is considered one of today's most urgent environmental concerns, yet the term was first coined only twenty-five years ago. Why did the concept of biological diversity so quickly capture public attention and emerge as a banner issue for the environmental movement? In this book, Timothy J. Farnham explores for the first time the historical roots of biological diversity, tracing the evolution of the term as well as the history of the conservation traditions that contributed to its rapid acceptance and popularity.Biological diversity is understood today as consisting of three components--species diversity, genetic diversity, and ecosystem diversity. Farnham finds that these three tiers coincided with three earlier, disparate conservation traditions that converged when the cause of preserving biological diversity was articulated. He tells the stories of these different historical foundations, recounts how the term came into the environmental lexicon, and shows how the evolution of the idea of biological diversity reflects an evolution of American attitudes toward the natural world.","Category":{"CategoryName":"History"}},{"Author":"Norman Stone","Name":"Europe transformed","Price":"0","Description":"This book provides readers with an introduction to the complex era from 1878 to the end of World War I.","Category":{"CategoryName":"History"}},{"Author":"H. G. Wells","Name":"A short history of the world","Price":"0","Description":"The book tells of the history of the world, starting with the believed origins of the Earth, then goes on to explain the development of the Earth and life on Earth as understood in Well's time, until reaching primitive thought and the development of humankind from the Cradle of Civilisation. The book ends with the outcome of the First World War, the Russian famine of 1921, and the League of Nations in 1922.","Category":{"CategoryName":"History"}},{"Author":"Tim Judah","Name":"The Serbs","Price":"0","Description":"This history of the Serbs opens with the medieval kings of Serbia and a battle lost six centuries ago that still profoundly influences the Serbs. It then describes the idea of Serbdom and examines the tenuous ethnic balance fashioned by Tito and its drastic unravelling after his death.","Category":{"CategoryName":"History"}},{"Author":"Friedman","Name":"A mind of its own","Price":"0","Description":"Whether enemy or ally, demon or god, the source of satisfaction or the root of all earthly troubles, the penis has forced humanity to wrestle with its enduring mysteries. Here, in an enlightening and entertaining cultural study, is a book that puts into context the central role of the penis within Western civilization. David M. Friedman shows that the penis is more than a body part. It is an idea, a conceptual but flesh-and-blood measuring stick of a man's place in the world.Deified by the pagan cultures of the ancient world and demonized by the early Roman church, the penis was later secularized by pioneering anatomists such as Leonardo da Vinci. After being measured 'scientifically' in an effort to subjugate some races while elevating others, the organ was psychoanalysed by Sigmund Freud. Now, after being politicized by feminism and exploited in countless ways by pop culture, the penis has been medicalized.As no one has before him, Friedman shows how the arrival of erection industry products such as Viagra is more than a health of business story. It is the latest - and perhaps final - chapter in one of the longest sagas in human history: the story of man's relationship with his penis.","Category":{"CategoryName":"History"}},{"Author":"Bertrand Patenrude","Name":"Stalin's Nemesis: The Exile and Murder of Leon Trotsky","Price":"0","Description":"Leon Trotsky was the charismatic intellectual of the Russian Revolution, a brilliant writer and orator who was also an authoritarian organizer. He might have succeeded Lenin and become the ruler of the Soviet Union. But by the time the Second World War broke out he was in exile, living in Mexico in a villa borrowed from the great artists Diego Rivera and Frida Kahlo, guarded only by several naive young Americans in awe of the great theoretician. The household was awash with emotional turmoil - tensions grew between Trotsky and Rivera, as questions arose over his relations with Frida Kahlo. His wife was restless and jealous. Outside of the villa, Mexican communists tried to storm the house and kill the man they regarded as a traitor, the Trotskys' sons were being persecuted and killed in Europe, and in Moscow, Stalin personally ordered his secret police to kill his fiercest left-wing critic - at any cost. By the summer of 1940, they had found a man who could penetrate the tight security around the house in far-away Mexico. This title offers a brilliant reconstruction of one of the most infamous state crimes, and a panoramic view of Trotsky's incredible life. Here is all the squalor, glory, fanaticism and bloodshed of a deadly rivalry.","Category":{"CategoryName":"History"}},{"Author":"Richard Webster","Name":"A brief history of blasphemy","Price":"0","Description":"What is blasphemy? Who is guilty? Why the Satanic Verses should be banned, and why liberals are the cause of the anti-Islamic backlash.","Category":{"CategoryName":"History"}}]