[{"Author":"Joshua Piven","Name":"The worst case scenario: holidays","Price":"11.90","Description":"The authors of the best-selling \"The Worst-Case Scenario Survival Handbook\" help you survive the dangers of the holiday season. Illustrated, step-by-step instructions guide you through dozens of festive scenarios.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Simon Rose","Name":"Ultimate Dad stuff","Price":"13.90","Description":"Children expect the earth from their fathers. They have to be able to conjure up games from thin air, to answer every question under the sun, to skim stones, and tell bedtime stories. ULTIMATE DAD STUFF is the book every father needs to keep up with their kids. Bringing together two separates volumes, it is the one stop shop for games, useful knowledge, puzzles and activities. ULTIMATE DAD STUFF is packed with great things to do with the kids. Some new, some traditional: how to learn to ride a bike without tears; how to play the spoons; a rainy afternoon's supply of knock knock jokes; a selection of magic tricks and how to answer 'Dad, where do babies come from?' There is a range of ideas to suit all situations -- games, puzzles, practical jokes and spooky urban myths. A father's work is never done and ULTIMATE DAD STUFF supplies even more fun, with magic, puzzles, things to make and games to play. All guaranteed to stave off the cry of 'Dad, are we there yet?","Category":{"CategoryName":"Home and Garden"}},{"Author":"Aubrey Smith","Name":"Screw it","Price":"12.90","Description":"Have you ever wondered how you'd survive without a man to attend to the odd jobs around the house? Have you ever wished you knew how to put up a shelf or check the oil in your car? And, more importantly, not have to call a man round? Then this is the book for you! From changing a car tyre and checking brake fluid and coolant to building a campfire and making a compost bin, Screw It! features all the traditionally male skills that a woman should learn to make her life that much easier. Divided into sections focusing on vehicle maintenance, the home, the garden and the great outdoors, each task is succinctly explained and accompanied by beautifully illustrated instructions with a traditional feel. Never again will you need to rely on the man in your life!","Category":{"CategoryName":"Home and Garden"}},{"Author":"Witold Rybczynski","Name":"One good turn","Price":"13.90","Description":"The seeds of Rybczynski's elegant and illuminating new book were sown by&nbsp;The New York Times,&nbsp;whose editors asked him to write an essay identifying \"the best tool of the millennium.\" The award-winning author of&nbsp;Home,&nbsp;A Clearing in the Distance, and&nbsp;Now I Sit Me Down, Rybczynski once built a house using only hand tools. His intimate knowledge of the toolbox -- both its contents and its history -- serves him beautifully on his quest.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Tamara Staples","Name":"The Magnificent Chicken: Portraits of the Fairest Fowl","Price":"17.90","Description":"Today's love affair with urban farming and backyard poultry coops means Tamara Staples' stunning photographs are more apropos than ever. Featuring glorious photos and informative text about more than forty unique breeds (many of them new to this edition), an introduction by Ira Glass, and a new resources section, this fully refreshed hardcover truly earns its new title: The Magnificent Chicken. The book features 50% new content: 24 new photos, including 12 all-new birds!","Category":{"CategoryName":"Home and Garden"}},{"Author":"Everard","Name":"Wild flowers of the world","Price":"18.90","Description":"This book is an essential guide for experts and amateurs alike in identifying more than 1000 of the worlds exotic and colorful plants. It describes and illustrates the wild flowers of many regions of the world including: Europe, The Arctic and Antarctic, The Middle East, China, North America and more. The vast number of known plants is estimated at a quarter of a million species. Wild Flowers of the World provides a sampling of these on a regional basis.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Charles R. Phillips","Name":"Colour For Life","Price":"12.90","Description":"Charles Phillips reveals hundreds of ways to use color in every aspect of your life to promote your physical and spiritual well-being- Colorful topics include how to combine colors for harmonious outfits, what the color of food tells us about its nutritional value, and ancient secrets of using colored gems, color-vitalized drinks, and colored light for healing.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Tessa Evelegh","Name":"Essential Shaker Style","Price":"9.90","Description":"The Shaker phrase \"beauty in utility\" is startlingly evident in their style of home furnishing. Capture this harmonious style to create an atmosphere of calm and order, making the most of natural materials and colors. Straightforward step-by-step projects and color photographs of beautiful interiors offer inspiration and guidance, providing all that's needed to add a Shaker touch to any home.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Linda Barker","Name":"Jazz Up Your Junk With Linda Barker","Price":"15.90","Description":"Transform garage sale finds, family cast-offs, and other junk into uniquely personal decorative pieces. Let a notable interior design star teach you everything you need to turn trash into treasure. Full-color photographs detail every step of twenty fabulous projects that range in style from traditional country floral to contemporary chic. A battered floor lamp gets a new lease on life with fake silver gilding; a plain single bed becomes a young gifts fantasy mini four-poster; a dull, double-fronted wardrobe gets a face-lift to become a French-style armoire. Other projects include chairs, cupboards, tables, a writing desk, screen, footstool, washstand, and more. Many popular decorative techniques are used, such as gilding, mosaic, paint effects, stenciling, applique, and etching to create stunning effects on wood, glass, metal, and fabric. Home decorators will enjoy learning new craft skills, gaining creative inspiration, and ending up with fantastic furnishings for next to nothing! A Selection of BOMC's Country Book Club.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Millers","Name":"Sci fi and fantasy collectibles","Price":"19.90","Description":"Following an introduction to the subject of collecting sci-fi and fantasy and a timeline of the key events in the development of the genre and interest in the subject, the book is then divided into the main types of collectible, such as comics and annuals, movie posters and ephemera.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Malcolm Gluck","Name":"Brave new world","Price":"13.90","Description":"Known for his irreverent and witty writing style, Malcolm Gluck has been at the cutting edge of the explosion of the New World wine scene. Taking a tour around Australia, California, New Zealand, and South Africa Gluck covers over sixty regions and features more than 150 exclusive colour photographs taken on his travels to these areas. Gluck enlightens the reader on why the wines taste the way do and he introduces the personalities behind the wines and describes the places, lifestyles, and cultures of the names that can be found on wine store shelves around the world today. He also reveals the winemakers' passion for the vines, the land, and the wine, to argue that in these areas the soul of the winemaker is more important than the soil in the vineyard. Useful checklists are also included giving details of all the wineries that are covered in the book.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Piers Warren","Name":"How to store your garden produce: The Key to Self-Sufficiency","Price":"12.90","Description":"This modern guide to storing and preserving your garden produce enables you to eat home-grown goodness all year round. The easy-to-use reference section provides storage and preservation techniques for the majority of plant produce commonly grown in gardens and allotments. Storing your garden produce is the key to self-sufficiency because, with less than an acre of garden, you can grow enough produce to feed a family of four for a year. Much of the produce will ripen simultaneously in the summer; without proper storage most of it will go to wasten. Simple and enjoyable techniques for storing your produce are provided so you can embrace the wonderful world of self-sufficiency. In the A-to-Z list of produce, each entry includes recommended varieties, suggested methods of storage, and a number of recipes, from how to make your own cider and pickled gherkins to how to string onions and dry your own apple rings. You'll know where your food has come from, you'll save money, there won't be any packaging, and you'll be eating tasty local food while feeling good about it.\"\"","Category":{"CategoryName":"Home and Garden"}},{"Author":"Quick Feng Shui Cures","Name":"Sarah Shurety","Price":"13.90","Description":"Most Western homes and office buildings are not ideal in Feng Shui terms, yet their defects can often be removed simply by introducing the appropriate cure. This informative guide, packed with creative suggestions and helpful advice, illustrates some common problems and features an extensive gallery of readily obtainable, easy-to-apply solutions that will revitalise your living or working space. Using the structure of the bagua template, all areas of the home are considered, including those related to finances, family, career and health, and a range of straightforward, fast-acting strategies proposed.","Category":{"CategoryName":"Home and Garden"}},{"Author":"Herb Gustafson","Name":"The art of Japanese gardens","Price":"0","Description":"\"The author discusses the function of cedar and bamboo fences, safety rails, retaining walls, gates, and tile roofs. In a chapter on rocks, boulders, and stones, he writes about their uses in bridges, walkways, and paths. Water is a large part of Japanese gardens, and Gustafson focuses on...ponds, waterfalls, and streams.\"--\"Booklist.\"","Category":{"CategoryName":"Home and Garden"}},{"Author":"Melody Fortier","Name":"The little guide to vintage shopping","Price":"0","Description":"A Modern Guide to Vintage Vintage clothing offers couture quality at a fraction of the price. But how can you spot a Dior original in a rack stuffed with Little Black Dresses? Vintage-clothing dealer Melody Fortier demystifies the entire process so you'll know just what to look for, what to avoid, and what to pay. The \"Little Guide to Vintage Shopping \"shares insider tips for evaluating quality, selecting problem-free pieces, ensuring the perfect fit and silhouette, and caring for your unique finds. With this savvy guide tucked in your handbag, you'll be ready to hit the streets. From fashion boutiques to flea markets, the hunt for treasures is on!","Category":{"CategoryName":"Home and Garden"}}]