[{"Author":"Roald Dahl","Name":"Book of ghost stories","Price":"11.90","Description":"Fourteen terrifying ghost stories chosen by the master of the macabre, Roald Dahl. 'Spookiness is the real purpose of the ghost story. It should give you the creeps and disturb your thoughts ...' Who better to choose the ultimate in spine-chillers than Roald Dahl, whose own sinister stories have teased and twisted the imagination of millions? Here are fourteen of his favourite ghost stories, including Sheridan Le Fanu's The Ghost of a Hand, Edith Wharton's Afterward, Cynthia Asquith's The Corner Shop and Mary Treadgold's The Telephone. Roald Dahl, the brilliant and worldwide acclaimed author of Charlie and the Chocolate Factory, James and the Giant Peach, Matilda, and many more classics for children, also wrote scores of short stories for adults. These delightfully disturbing tales have often been filmed and were most recently the inspiration for the West End play, Roald Dahl's Twisted Tales by Jeremy Dyson. Roald Dahl's stories continue to make readers shiver today.","Category":{"CategoryName":"Horror"}},{"Author":"Brian Aldiss","Name":"Moreaus other island","Price":"11.90","Description":"Welcome to Dr Moreau's other island. Place of untold horros. Home of the Beast Men...Available for the first time in eBook. He stands very tall, long prosthetic limbs glistening in the harsh sun, withered body swaying, carbine and whip clasped in artificial hands. Man-beasts cower on the sand as he brandishes his gun in the air. He is Dr Moreau, ruler of the fabulous, grotesque island, where humans are as brutes and brutes as humans, where the future of the entire human race is being reprogrammed. The place of untold horrors. The place of the New Man.","Category":{"CategoryName":"Horror"}},{"Author":"Richard Matheson","Name":"I am legend","Price":"12.90","Description":"Matheson's classic novel of fear and vampirism--the tale of the last human on an Earth overrun by the undead--returns to graphic novel format in a single volume collection of four long out-of-print books.","Category":{"CategoryName":"Horror"}},{"Author":"Michael Pye","Name":"Taking lives","Price":"12.90","Description":"Martin Arkenhout, a seventeen-year-old Dutchman travelling across the States, kills his young American travelling companion, Seth Goodman, and adopts his identity. Some months later he takes - and takes on - other lives, adopting another passport, set of credit cards and identity. A decade and many lives later, now back in the Netherlands, he kills and becomes a young British art historian, Christopher Hart, and follows his plans to go to Portugal. But Christopher is being followed from the London by Costas, another art historian, investigating the disappearance of a series of valuable prints from a priceless book, and before he leaves the Netherlands, Martin runs into his own mother on a tram. In the confusion of the moment he identifies himself as Hart and for the first time Martin's series of seamless killings and identities runs into trouble...","Category":{"CategoryName":"Horror"}},{"Author":"H.P. Lovecraft","Name":"The Lurker At The Threshold","Price":"11.90","Description":"The old mansion in the woods north of Arkham had stood empty and shunned for more than 100 years - until Ambrose Dewart arrives to claim his family inheritance. But a terrible legacy awaits him there including a window offering glimpses into some dimension of earthly horror.","Category":{"CategoryName":"Horror"}},{"Author":"Stephenie Meyer","Name":"The Short Second Life Of Bree Tanner","Price":"9.90","Description":"Fans of The Twilight Saga will be enthralled by the riveting story of Bree Tanner, a character introduced in Eclipse, and the darker side of the newborn vampire world she inhabits. In another irresistible combination of danger, mystery and romance, Stephenie Meyer tells the devastating story of Bree and the newborn army as they prepare to close in on Bella Swan and the Cullens, following their encounter to its unforgettable conclusion. 'I'm as surprised as anyone about this novella,' said Stephenie Meyer. 'When I began working on it in 2005, it was simply an exercise to help me examine the other side of Eclipse, which I was editing at the time. I thought it might end up as a short story that I could include on my website. Then, when work started on The Twilight Saga: The Official Guide, I thought the Guide would be a good fit for my Bree story. However, the story grew longer than I anticipated, until it was too long to fit into the Guide.","Category":{"CategoryName":"Horror"}},{"Author":"Shaun Hutson","Name":"Purity","Price":"5.90","Description":"Ex model Amy has her own radio show with a popular phone in slot. When two prostitutes are murdered after a caller admits to fantasies of rape, Amy begins to suspect that the man she loves, who lives beneath her flat, may be a murderer. A call to her programme informs her that she is next.","Category":{"CategoryName":"Horror"}},{"Author":"Stephfordy Mayo","Name":"New Moan","Price":"8.00","Description":"Heffa Lump is just a typical, pale and interesting seventeen-year-old. But then she moves to Spatula and meets Teddy Kelledy, an impossibly gorgeous boy who eats rare meat, is super-strong and never goes out in sunlight. Could he--just maybe--be a vampire? (Hint: totally.) --Cover p. [4]","Category":{"CategoryName":"Horror"}},{"Author":"Ray Bradbury","Name":"The small assassin","Price":"12.90","Description":"Here is a fantastic journey into a world of terror with thirteen of Bradbury's very best. A baby born with the irge to kill... the couple who leave for a honeymoon - in a cemetery... a husband and wife who have an unpleasant experience with some mummified Mexican corpses... the tombstone in the bedroom... a little boy who examines the macabre entrails of the man upstairs...","Category":{"CategoryName":"Horror"}},{"Author":"Steve Hockensmith","Name":"Pride And Prejudice And Zombies: Dawn Of The Dreadfuls","Price":"11.90","Description":"Witness the genesis of the zombie plague in early 19th-century England in this terrifying and hilarious prequel to the bestselling \"Pride and Prejudice and Zombies.\" Watch as Elizabeth Bennet evolves from a naive young teenager into a savage slayer of the undead.","Category":{"CategoryName":"Horror"}},{"Author":"James Herbert","Name":"Domain","Price":"9.90","Description":"The long-dreaded nuclear conflict is here. The city is torn apart, shattered, its people destroyed or mutilated beyond hope. For just a few, survival is possible only beneath the wrecked streets - if there is time to avoid the slow-descending poisonous ashes. But below, the rats, demonic offspring of their irradiated forebears, are waiting. They know that Man is weakened, become frail. Has become their prey...Remember with fear.","Category":{"CategoryName":"Horror"}},{"Author":"James Herbert","Name":"The Dark","Price":"5.90","Description":"It came like a malignant shadow with seductive promises of power. And somewhere in the night ...a small girl smiled as her mother burned ...Asylum inmates slaughtered their attendants ...in slimy tunnels once-human creatures gathered. Madness raged as the lights began to fade and humanity was attacked by an ancient, unstoppable evil ...","Category":{"CategoryName":"Horror"}},{"Author":"Jane Austen","Name":"Sense And Sensibility And Sea Monsters (Quirk Classics)","Price":"11.90","Description":"Arriving just in time for Halloween, this strange and terrifying tongue-in-cheek novel marks a new addition to the much-acclaimed literary-occult series featuring \"Pride and Prejudice and Zombies.\"","Category":{"CategoryName":"Horror"}},{"Author":"Kristin Cast","Name":"Marked","Price":"9.90","Description":"When sixteen-year-old Zoey Redbird gets Marked as a fledgling vampire she must join the House of Night school where she will train to become an adult vampire. That is, if she makes it through the Change. But Zoe is no ordinary fledgling. She has been chosen as special by the Goddess Nyx and discovers her amazing new power to conjure the elements: earth, air, fire, water and spirit. When Zoey discovers that the leader of the Dark Daughters, the school's most elite group, is misusing her Goddess-given gifts, Zoey must look within herself to embrace her destiny - with a little help from her new vampire friends. - Not suitable for younger reader","Category":{"CategoryName":"Horror"}},{"Author":"Charlaine Harris","Name":"Dead As A Doornail","Price":"9.90","Description":"Sookie Stackhouse is a cocktail waitress in a little bar in a small town deep in Louisiana. She's funny and pretty and well mannered, but she doesn't have that many close friends   mind you, that's not so surprising when you consider how few people can appreciate her abilities as a mind reader. It's not a quality that has the guys beating down her door   well, unless they're vampires or werewolves or the like ...but they're not just supernatural freaks, some of them are friends, even family ...And much as Sookie might want a quiet life, when she's around, things just seem to happen ...like her brother, who appears to be changing into a were panther. He's not that bothered, but someone doesn't like it   someone's trying to wipe him out, as well as the rest of the shape changing population, and that mean's Sookie's got just a month, before the next full moon, to find out who wants her brother dead, and stop the fiend.","Category":{"CategoryName":"Horror"}},{"Author":"Karen Macinerney","Name":"Howling At The Moon","Price":"7.90","Description":"This fabulous, funny debut novel kicks off a new series featuring Sophie Garou, a sexy, successful heroine who's got it all: a hunky guy, hot designer duds, a high powered career, and a habit of sprouting fangs and fur during every full moon. Original.","Category":{"CategoryName":"Horror"}},{"Author":"Vampire Diaries","Name":"Volume 5 | L J Smith","Price":"13.90","Description":"Trust has never come easily to Stefan and Damon, but now that ruthless vampire Samuel is determined to ruin their lives, the Salvatores must join forces to defeat their foe. Samuel has already ruined Stefan's chances at a normal life, and now he's framing Damon for the Jack the Ripper murders, too. With the help of Cora, a human girl, Stefan and Damon track Samuel from the glittering ballrooms of London to the city's asylum, which Samuel uses for his own nefarious purposes. However, while finding Samuel is easy, Damon and Stefan quickly learn that stopping him may be impossible. Full of dark shadows and surprising twists, the fifth book in the Stefan's Diaries series raises the stakes for the Salvatore brothers as they face unimaginable threats.","Category":{"CategoryName":"Horror"}},{"Author":"Stephenie Meyer","Name":"Breaking Dawn","Price":"9.90","Description":"To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, a tumultuous year of temptation, loss, and strife have led her to the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or to pursue a fully human life has become the thread from which the fates of two tribes hangs. Now that Bella has made her decision, a startling chain of unprecedented events is about to unfold with potentially devastating, and unfathomable, consequences. Just when the frayed strands of Bella's life   first discovered in TWILIGHT, then scattered and torn in NEW MOON and ECLIPSE   seem ready to heal and knit together, could they be destroyed ...forever? The astonishing, breathlessly anticipated conclusion to the Twilight Saga, Breaking Dawn illuminates the secrets and mysteries of this spellbinding romantic epic that has entranced millions.","Category":{"CategoryName":"Horror"}},{"Author":"Rebecca Maizel","Name":"Infinite Days","Price":"9.90","Description":"For 500 years Lenah Beaudonte has been a vampire. 500 years of seduction, blood and destruction. But she is sickened by her dark powers    and longs to feel the sun on her skin, grass under her bare feet, and share the breath of a human kiss. She wants to be mortal again. But is she really capable of being human, after her long years of darkness? Waking up as a sixteen year old girl brings Lenah many things    the life she has missed, taste, touch, love. But a vampire soul is not easily shed. And her coven    the four vampires she led in decadence and thrilling destruction    want their queen back ...","Category":{"CategoryName":"Horror"}},{"Author":"The Essential","Name":"Clive Barker","Price":"18.90","Description":"With a special introduction by Armistead Maupin, author of Tales of the City, this is a unique selection of the author's best short stories and extracts from his novels, chosen by Clive and accompanied by a personal commentary which reveals the man behind the art. Clive Barker takes us on a personal tour through the dark and fantastic land of his imagination. Huge in scope, this unique collection examines the work of a man who has taken us further than any other writer of modern fiction: from the fantastic lands of The Fugue Weaveworld) and the Dominions Imajica) to the uncharted waters of the dream sea, Quiddity The Great and Secret Show and Everville). His peerless imagination has only been matched by both his storytelling    from the groundbreaking series of short stories, the Books of Blood, which served as a wake up call to a floundering horror industry, to the grand metaphysical vision of Galilee    and his ability to create memorable characters such as Will Rabjohns Sacrament), Shadwell the salesman Weaveworld) and Judith Imajica). In addition to this, The Essential Clive Barker includes an introduction by the renowned Armistead Maupin, author of Tales of the City, and a specially written commentary by Clive which gives a brand new insight to the man and his Art. A unique project by a unique author, The Essential Clive Barker will appeal both to long time fans of his work, and anyone with an interest in great fiction.","Category":{"CategoryName":"Horror"}},{"Author":"Vampire Diaries","Name":"The Compelled | L. J. Smith","Price":"13.90","Description":"When Damon is taken captive by ruthless vampire Samuel, Stefan is determined to rescue him before it is too late...even if it means seeking help from the most unlikely of places. Stefan forms a tentative alliance with a coven of witches in order to save his brother, only to learn that Samuel's end game is far more sinister then they could have imagined. With Samuel on the brink of securing unlimited power, the brothers are in for their deadliest battle yet. Full of dark shadows and surprising twists, the final book in the latest arc of Stefan's Diaries series raises the stakes for the Salvatore brothers as they face unimaginable threats.","Category":{"CategoryName":"Horror"}},{"Author":"Dean Koontz","Name":"Mr. Murder","Price":"7.90","Description":"For author Martin Stillwater, life couldn't be more perfect. He and Paige are happy together; their two daughters, Emily and Charlotte, are intelligent and healthy; and his novels are achieving long hoped for levels of success. So why does he feel such dread, experience sudden blackouts? The killer doesn't know his own name, only the name he uses. He has no family, no friends, no home. He cannot recall who gives him his assignments, and he doesn't know why his targets must die. Now, however, he senses that in a town he can't yet envision, a life awaits him, a place to call home, with family and friends. Charlotte knows something is wrong: the man moves and sounds like Daddy, but he doesn't smile as quickly or as often as usual. And when he does smile, he seems to be pretending. Daddy isn't Daddy.","Category":{"CategoryName":"Horror"}},{"Author":"Dean Koontz","Name":"The Face Of Fear","Price":"7.90","Description":"No description available","Category":{"CategoryName":"Horror"}},{"Author":"Dean Koontz","Name":"Odd Thomas","Price":"9.90","Description":"The 400 million copy worldwide bestseller Dean Koontz is at his very best in this critically acclaimed page turner   soon to be a major motion picture. Find out why Odd Thomas is the master storyteller's most loved creation. Odd by name, a hero by nature. He's Odd. Odd Thomas, to be precise. Genius fry cook at the Pico Mundo grill; boyfriend to the gorgeous Stormy Llewellyn   and possibly the only person with a chance of stopping one of the worst crimes in the bloody history of murder...Something evil has come to the desert town that Odd and Stormy call home. It comes in the form of a mysterious man with a macabre appetite, a filing cabinet full of information on the world's worst killers, and strange, hyena like shadows following him wherever he goes. Odd is worried. He knows things, sees things   about the living, the dead and the soon to be dead. Things that he has to act on. Now he's terrified for Stormy, himself and Pico Mundo. Because he knows that on Wednesday August 15, a savage, blood soaked whirlwind of violence and murder will devastate the town. Today is August 14. And Odd is far from sure he can stop the coming storm...","Category":{"CategoryName":"Horror"}},{"Author":"Stephanie Meyer","Name":"Breaking dawn","Price":"11.90","Description":"To be irrevocably in love with a vampire is both fantasy and nightmare woven into a dangerously heightened reality for Bella Swan. Pulled in one direction by her intense passion for Edward Cullen, and in another by her profound connection to werewolf Jacob Black, she has endured a tumultuous year of temptation, loss and strife to reach the ultimate turning point. Her imminent choice to either join the dark but seductive world of immortals or pursue a fully human life has become the thread from which the fate of two tribes hangs. Now that Bella has made her decision, a startling chain of unprecedented events is about to unfold with potentially devastating and unfathomable consequences. Just when the frayed strands of Bella's life   first discovered in TWILIGHT, then scattered and torn in NEW MOON and ECLIPSE   seem ready to heal and knit together, could they be destroyed...forever?","Category":{"CategoryName":"Horror"}},{"Author":"Charlaine Harris","Name":"Club Dead","Price":"9.90","Description":"There's only one vampire Sookie Stackhouse is involved with   at least voluntarily   and that's Bill. But recently he's been a little distant   in another state distant. His sinister and sexy boss Eric has an idea where to find him, and next thing Sookie knows she's off to Jackson, Mississippi, to mingle with the underworld at Club Dead. It's a dangerous little haunt where the elusive vampire society can go to chill out and suck down some Type O   but when Sookie finally finds Bill caught in an act of serious betrayal she's not sure whether to save him, or to sharpen some stakes. The Sookie Stackhouse books are delightful Southern Gothic supernatural mysteries, starring Sookie, the telepathic cocktail waitress, and a cast of increasingly colourful characters, including vampires, werewolves and things that really do go bump in the night.","Category":{"CategoryName":"Horror"}},{"Author":"Lauren Kate","Name":"Passion","Price":"9.90","Description":"\"Every single lifetime, I'll choose you. Just as you have always chosen me. Forever.\" Before Luce and Daniel met at Sword &amp; Cross, before they fought the Immortals, they had already lived many lives. And so Luce, desperate to unlock the curse that condemns their love, must revisit her past incarnations in order to understand her fate. Each century, each life, holds a different clue. But Daniel is chasing her throughout the centuries before she has a chance to rewrite history. How many deaths can one true love endure? And can Luce and Daniel unlock their past in order to change their future?","Category":{"CategoryName":"Horror"}},{"Author":"Becca Fitzpatrick","Name":"Crescendo","Price":"9.90","Description":"Nora should know better than to think her life can return to normal after falling in love with a fallen angel. And Nora's life isn't normal   her dad was murdered, and the facts about his death just don't add up. Now Nora's own life is in imminent danger. Are she and Patch strong enough for the battle ahead?","Category":{"CategoryName":"Horror"}},{"Author":"Justin Cronin","Name":"The passage","Price":"11.90","Description":"The Passage begins in the near future and details an apocalyptic and, later, post apocalyptic world that is overrun by vampire like beings who are infected by a highly contagious virus. What begins as a project to develop a new immunity boosting drug based on a virus carried by an unnamed species of bat in South America eventually becomes the virus that transforms the world. The novel begins in 2016 and spans more than ninety years, as colonies of humans attempt to live in a world filled with superhuman creatures who are continually on the hunt for fresh blood.","Category":{"CategoryName":"Horror"}},{"Author":"Kate Cary","Name":"Bloodline","Price":"9.90","Description":"The original paranormal romance: go back to where the bloodlust began ...with Bram Stoker's Dracula. 'Blood from last night's raid has hardly dried on my uniform, still the familiar craving builds in my belly, I long to wield my sword. I can feel the blade slicing through the air then skin then flesh then bone.'   Captain Quincy Harker. When nineteen year old John Shaw returns from World War I, he is haunted by nightmares   not only of the horrors of battle, but of the brutal midnight exploits of his superior, Captain Quincey Harker. When Harker appears unexpectedly in England and lures John's sister, Lily, to Transylvania. John must confront the truth. Only the love of pure Mary can save him from Count Dracula's poisonous bloodline. But the line goes further than John and Mary can possibly imagine. A new seductive evil walks among the living in this heady vampire romance combined with chilling horror   Bloodline is the gripping sequel to Bram Stoker's Dracula. Read the next instalment of Kate Cary's paranormal romance series in The Reckoning.","Category":{"CategoryName":"Horror"}},{"Author":"Paul Doherty","Name":"Murder's Immortal Mask","Price":"11.90","Description":"September 314 AD and once more death strikes the sprawling streets of Imperial Rome. When two prostitutes are found murdered   their bodies ripped open and their right eyes gouged out   it's feared a notorious killer, the Nefandus, has returned. Rumoured to be an imperial officer, he once waged bloody murder amongst Rome's prostitutes but vanished before his identity could be discovered. Has he reappeared, or is someone working in his guise? Desperate to retain order, the Empress Helena turns to her most trusted agent, Claudia. Helena commands her to discover the truth behind the Nefandus, before Rome descends further into chaos and confusion.","Category":{"CategoryName":"Horror"}},{"Author":"The Subtle Knife","Name":"Philip Pullman","Price":"11.90","Description":"Will is twelve, and he's just killed a man. Now he's on the run, determined to discover the truth about the father he's never known. Then he steps through a window into another world   where soul eating Spectres haunt the streets of a city, and a strange girl called Lyra is searching for Dust. His mission and hers are mysteriously linked, and together they must find a powerful and secret object that people from many worlds would kill to possess.","Category":{"CategoryName":"Horror"}},{"Author":"Ian McEwan","Name":"The Innocent","Price":"0","Description":"The setting is Berlin. Into this divided city, wrenched between East and West, between past and present; comes twenty-five-year-old Leonard Marnham, assigned to a British-American surveillance team. Though only a pawn in an international plot that is never fully revealed to him, Leonard uses his secret work to escape the bonds of his ordinary life - and to lose his unwanted innocence. The promise of his new life begins to be fulfilled as Leonard becomes a crucial part of the surveillance team, while simultaneously being initiated into a new world of love and sex by Maria, a beautiful young German woman. It is a promise that turns to horror in the course of one terrible evening - a night when Leonard Marnham learns just how much of his innocence he's willing to shed.","Category":{"CategoryName":"Horror"}},{"Author":"H.P. Lovecraft","Name":"The Loved Dead","Price":"0","Description":"H.P. Lovecraft, aside from devising his own works in his Cthulhu Mythos cycle, also collaborated in his day with many younger writers of the uncanny and eerie. Available for the first time in paperback, this collection features stories to which the master of horror added his own ingenious touch.","Category":{"CategoryName":"Horror"}},{"Author":"Mary Shelley","Name":"Frankenstein","Price":"0","Description":"The Original Gothic-Horror Literary Classic! Mary Shelley's deceptively simple story of Victor Frankenstein and the creature he brings to life, first published in 1818, is now more widely read-and more widely discussed by scholars-than any other work of the Romantic period. From the creature's creation to his wild lament over the dead body of his creator in the Arctic wastes, the story retains its narrative hold on the reader even as it spins off ideas in rich profusion.About the Author: Mary Shelley (30 August 1797 - 1 February 1851) was a British novelist, short story writer, dramatist, essayist, biographer, and travel writer, best known for her Gothic novel Frankenstein: or, The Modern Prometheus (1818). She also edited and promoted the works of her husband, the Romantic poet and philosopher Percy Bysshe Shelley. Her father was the political philosopher William Godwin, and her mother was the philosopher and feminist Mary Wollstonecraft. She died in London in 1851.This is the definitive collectors edition and is a stunning and impressive uanabridged representation of a classic literary work. - Publisher's Weekly","Category":{"CategoryName":"Horror"}},{"Author":"Cook Coleridge","Name":"Franz Kafka","Price":"0","Description":"One morning, as Gregor Samsa was waking up from anxious dreams, he discovered that he had been changed into an adorable kitten. Thus begins \"The Meowmorphosis\"   a bold, startling, and fuzzy wuzzy new edition of Kafka's classic nightmare tale, from the publishers of \"Pride and Prejudice\" and \"Zombies!\" Meet Gregor Samsa, a humble young man who works as a fabric salesman to support his parents and sister. His life goes strangely awry when he wakes up late for work and discovers that, inexplicably, he is now a man sized baby kitten. His family freaks out: Yes, their son is OMG so cute, but what good is cute when there are bills to pay? And how can Gregor be so selfish as to devote all his attention to a scrap of ribbon? As his new feline identity threatens to eat away at his personality, Gregor desperately tries to survive this bizarre, bewhiskered ordeal by accomplishing the one thing he never could as a man: He must flee his parents' house.&nbsp;","Category":{"CategoryName":"Horror"}},{"Author":"Darren Shan","Name":"The Vampire's assistant","Price":"0","Description":"Darren Shan has been made a half vampire by Mr Crepsley, but the Cirque Du Freak holds more unpleasant surprises for the vampire's assistant. Darren joins the vampire, Mr Crepsley, as his assistant and they return to the Cirque Du Freak. There, Darren makes friends with the snake boy, Evra Von who knows what Darren is) and a local boy, Sam, and RV, an eco warrior and animal lover who do not). Darren begins to enjoy his life among the Cirque performers as the youngest half vampire in existence, but he defiantly refuses to drink human blood   the whole idea sickens him   and he tries desperately to cling on to the part of him which is human. Darren comes face to face with pure evil in the form of Mr Tiny, the leader of the Little People who join the Cirque Du Freak, and who eat anything   including human flesh. When he discovers animal bones, RV frees the wolf man from his cage   and no one could possibly guess how truly terrible the whole effect would be.","Category":{"CategoryName":"Horror"}},{"Author":"James Herbert","Name":"The Fog","Price":"0","Description":"The peaceful life of a village in Wiltshire is suddenly shattered by a disaster which strikes without reason or explanation, leaving behind it a trail of misery and horror. A yawning, bottomless crack spreads through the earth, out of which creeps a fog that resembles no other. Whatever it is, it must be controlled; for wherever it goes it leaves behind a trail of disaster as hideous as the tragedy that marked its entry into the world. The fog, quite simple, drives people insane.&nbsp;","Category":{"CategoryName":"Horror"}},{"Author":"James Herbert","Name":"Once","Price":"0","Description":"Remember the fairy stories you were told as a child? Tales of tiny, magical, winged beings and elves, wicked witches and goblins. Demons ...What if one day you found out they were true? What if, when you became an adult, you discovered they were all based on fact? What if you met the fantasy and it was all so very real? That's what happened to Thom Kindred. The wonders were revealed to him. But so were the horrors, for not far behind the Good, there always lurks the Bad. And the Bad had designs on Thom. The Bad would show him real evil. He would see the hellhagges and the demons. He would be touched by perverted passion. And corruption. And he would encounter his own worst nightmare. The Bad would seek to destroy him. And only the magic of the little beings would be able to help him. \"Once\", James Herbert's masterful novel of erotic love and darkest horror, will take you to a realm where fantasy and reality collide, where fairytales really can come true.","Category":{"CategoryName":"Horror"}},{"Author":"Gena Showalter","Name":"The Darkest Lie","Price":"0","Description":"Forced to his knees in agony whenever he speaks the truth, Gideon can recognize any lie until he captures Scarlet, a demon possessed immortal who claims to be his long lost wife. He doesn't remember the beautiful female, much less wedding or bedding her. But he wants to...almost as much as he wants her. But Scarlet is keeper of Nightmares, too dangerous to roam free. A future with her might mean ultimate ruin. Especially as Gideon's enemies draw closer and the truth threatens to destroy all he's come to love...&nbsp;","Category":{"CategoryName":"Horror"}},{"Author":"Dean Koontz","Name":"Icebound","Price":"0","Description":"A widespread drought is causing murderous famine. There is one possible solution: Arctic ice could be moved south to parched coastlines and melted for water. In an Arctic icefield, a special team of scientists has planted bombs that will detonate automatically at midnight to break away some of the ice. Before they withdraw to the safety of their base camp, a shattering tidal wave breaks loose the ice on which they are working. Now they are marooned on an iceberg during the worst winter storm of the decade. The bombs in the ice beneath them are buried irretrievably deep...and ticking. Abruptly thrown into a desperate struggle for survival, the scientists are plagued by the discovery that one of them is a ruthless killer on a strange mission of his own...","Category":{"CategoryName":"Horror"}},{"Author":"Anne Rice","Name":"Vittorio, The Vampire","Price":"0","Description":"A VAMPIRE IN THE ITALIAN AGE OF GOLD...Sixteen years old, Vittorio is the sole survivor of a bizarre and violent massacre at his father's Tuscan palazzo. Escaping to the Florence of Cosimo de Medici, he seeks vengeance and retribution. But though he has been saved from death by a mysterious woman, he finds himself at the mercy of demonic, bloody nightmares, war and political intrique. And, beyond even these perils, Vittorio faces being torn apart by a dangerous love. Against a backdrop of the wonders   both sacred and profane   of Rennaisance Italy, with it's art and ferocity, angels and demons, Anne Rice introduces a seductive new character and creates a passionate traggic legend of doomed young love and lost innocence.&nbsp;","Category":{"CategoryName":"Horror"}},{"Author":"Elizabeth Vaughan","Name":"Warprize","Price":"0","Description":"Xylara is a Daughter of Xy, brought up to do her duty to her country, her king and her people. Her father, the Warrior King Xyron, is dead and her incompetent half brother Xymund is on the throne; she has chosen to serve her people as a healer, until she is needed to make a marriage of alliance. But the once great kingdom of Xy is threatened by the Warlord and his barbarian Firelanders, and her brother Xymund is forced to surrender. The terms are fair: the kingdom will remain under Xymund's control, and the taxes and tithes are reasonable. All prisoners and wounded are to be exchanged unharmed. There is just one thing more: to ensure a true peace   no pillaging, no looting, no rapine   the Warlord has claimed tribute. He claims Xylara, Daughter of Xy, to be his Warprize ...","Category":{"CategoryName":"Horror"}}]