[{"Author":"Mike Ashley","Name":"The mammoth book of seriously comic fantasy","Price":"13.90","Description":"From Greek goddesses putting down insurrection among unruly mortals to stranded aliens escaping earth in a church converted into a rocket, and an intrepid time traveller attempting to steal the universe, this collection of bizarre comic fantasies come from a range of inventive minds, including: John Cleese, Connie Booth, Tom Holt, and Craig Shaw Gardener.","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"Dawn of the bunny suicides","Price":"14.90","Description":"From the author of the cult bestsellers THE BOOK OF BUNNY SUICIDES and RETURN OF THE BUNNY SUICIDES comes another unmissable collection of rabbit-related self destruction...The bunnies are back - and there's only one thing on their minds. In this new collection, follow the continuing adventures of the fluffy little rabbits who just don't want to live any more...","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"Roasted","Price":"15.90","Description":"'Their names are Karl, Lottie and Nev, and they work in a coffee shop. That's all you need to know. Actually, you don't even need to know their names that much; you just need to recognise the sort of people they are - the care-worn balding thirty-year-old, keenly aware he's on the final lap of his youth, the girl who frets about everything (but food in particular), and the chirpy big-eyed twat with one of those unfortunate faces that you just want to hit ...' For five years, BUNNY SUICIDES author Andy Riley has delighted Observer Magazine readers with his dark and funny weekly strip - Roasted. Now collected together for the first time, here are the ongoing adventures of three wasters in a coffee shop - making an essential guide to the modern world for fans and newcomers alike.","Category":{"CategoryName":"Humour"}},{"Author":"Dan Kieran","Name":"The Idler Book of Crap Jobs","Price":"11.90","Description":"From one of the geniuses behind \"The Idler\" comes a hysterical compendium of people who do the the most humiliating, soul-destroying, immoral, and crappiest jobs out there.","Category":{"CategoryName":"Humour"}},{"Author":"John Naish","Name":"Put What Where?!","Price":"13.90","Description":"Hilarious miscellany of sex advice throughout the ages from seven-week long Balinese foreplay and Victorian Viagra to swinging tips from the 1970s. It is one of the oldest questions in the world: How do you do sex? And it has prompted some of the most stupid answers in human history. Since the dawn of civilization, a bizarrely eccentric host of self-appointed experts has befuddled, frightened and confused questioners by selling them bull about the birds and bees. Ancient Chinese Viagra was made from wasps. Medieval Indian advice books warned lovers never to have sex in front of the priest or in the middle of the road. Middle-Ages Britons claimed drunkenness was the best way to conceive, while Persians thought they could enlarge themselves with ginger and honey. And as for the Victorians and Edwardians, hot blankets were the devil's work, banisters should be banned and tight corsets could cause nymphomania. The odd playful slap wouldn't do any harm though. Here, then, is the cream of thousands of years of advice on where, when and how to put it, how to receive it, what to spread on it first and how to spend your time after it's all over. It makes you wonder how humankind ever got this far.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"The top gear years","Price":"17.90","Description":"The Top Gear Years brings together Jeremy Clarkson's collected magazine columns for the first time. Clarkson at his pithy, provocative, hilarious best We now know all about the world according to Clarkson. In a series of bestselling books Jeremy has revealed it to be a puzzling, frustrating place where all too often the lunatics seem to be running the asylum. But in The Top Gear Years, we get something rather different. Because ten years ago, at an ex-RAF aerodrome in Surrey, Jeremy and his friends built a world that was rather more to his liking: they called it Top Gear HQ.","Category":{"CategoryName":"Humour"}},{"Author":"P.G. Wodehouse","Name":"Right Ho, Jeeves","Price":"9.90","Description":"Right Ho, Jeeves is a novel by P. G. Wodehouse, the second full-length novel featuring the popular characters Jeeves and Bertie Wooster, after Thank You, Jeeves. It also features a host of other recurring Wodehouse characters, and is mostly set at Brinkley Court, the home of Bertie's Aunt Dahlia. It was first published in the United Kingdom on October 5, 1934 by Herbert Jenkins, London, and in the United States on October 15, 1934 by Little, Brown and Company, Boston, under the title Brinkley Manor.","Category":{"CategoryName":"Humour"}},{"Author":"Adams Scott","Name":"Journey To Cubeville","Price":"12.90","Description":"\"Since Adams parted company with Pacific Bell in 1995, the business he has built out of mocking business has turned into the sort of success story that the average cartoon hero could only dream of.\"-- The London Financial Times \"Go ahead and cut that Dilbert cartoon. Pin it to the wall of your claustrophobic cubicle. Laugh at it around the water cooler, remarking how similar it is to the incomprehensible memos and ludicrous management strategies at your own company.\"-- The Washington Post Dilbert, Dogbert, and the rest of the world's favorite cubicle dwellers are sure to leave you rolling in your workspace with Scott Adams's cartoon collection, Journey to Cubeville.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"Round the bend","Price":"15.90","Description":"Jeremy Clarkson gets really riled in Round the Bend. What's it like to drive a car that's actively trying to kill you? This and many other burning questions trouble Jeremy Clarkson as he sets out to explore the world from the safety of four wheels. Avoiding the legions of power-crazed traffic wombles attempting to block highway and byway, he he: Shows how the world of performance cars may be likened to Battersea Dogs Home Reveals why St Moritz may be the most bonkers town in all of the world Reminds us that Switzerland is so afraid of snow that any flakes falling on the road are immediately arrested Argues that washing a car is a waste of time Funny, globe-trotting, irreverent and sometimes downright rude, Round the Bend is packed with curious and fascinating but otherwise hopelessly useless stories and facts about everything under the sun (and just occasionally cars).","Category":{"CategoryName":"Humour"}},{"Author":"P G Wodehouse","Name":"The code of the Woosters","Price":"11.90","Description":"Nothing but trouble can ensue when Bertie Wooster's Aunt Dahlia instructs him to steal a silver jug from Totleigh Towers, home of magistrate and hell-hound, Sir Watkin Bassett. First he must face the peril of Sir Watkin's droopy daughter, Madeleine, and then the terrors of would-be Dictator, Roderick Spode and his gang of Black Shorts. But when duty calls, Bertram answers, and so there follows what he himself calls the 'sinister affair of Gussie Fink-Nottle, Madeleine Bassett, old Pop Bassett, Stiffy Byng, the Rev. H. P. ('Stinker') Pinker, the eighteenth-century cow-creamer and the small, brown, leather-covered notebook'. In a plot with more twists than an English country lane, it takes all the ingenuity of Jeeves to extract his master from the soup again.","Category":{"CategoryName":"Humour"}},{"Author":"P G Wodehouse","Name":"Life with Jeeves","Price":"11.90","Description":"It is old Bertie Wooster's habit to land in the soup from time to time. To get into a spot of bother. Circumstances, aided and abetted by Aunt Agatha, Aunt Dahlia, Bingo Little, Tuppy, Sippy and others, seem to conspire against him, and a frightful muddle ensues.","Category":{"CategoryName":"Humour"}},{"Author":"Sam Jordison","Name":"Crap Towns: The 50 Worst Places To Live In The Uk","Price":"12.90","Description":"Welcome to Dr Moreau's other island. Place of untold horros. Home of the Beast Men...Available for the first time in eBook. He stands very tall, long prosthetic limbs glistening in the harsh sun, withered body swaying, carbine and whip clasped in artificial hands. Man-beasts cower on the sand as he brandishes his gun in the air. He is Dr Moreau, ruler of the fabulous, grotesque island, where humans are as brutes and brutes as humans, where the future of the entire human race is being reprogrammed. The place of untold horrors. The place of the New Man.","Category":{"CategoryName":"Humour"}},{"Author":"Augusten Burroughs","Name":"Magical thinking","Price":"12.90","Description":"From the #1 bestselling author of Running with Scissors and Dry comes a contagiously funny, heartwarming, shocking, twisted, and absolutely magical collection. True stories that give voice to the thoughts we all have but dare not mention. It begins with a Tang Instant Breakfast Drink television commercial when Augusten was seven. Then there is the contest of wills with the deranged cleaning lady. The execution of a rodent carried out with military precision and utter horror. Telemarketing revenge. Dating an undertaker and much more. A collection of true stories that are universal in their appeal yet unabashedly intimate and very funny.","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"Great lies to tell small kids","Price":"11.90","Description":"This Christmas you can finally let your bunnies out of their padded hutches, because Andy Riley doesn't want them anymore. He wants your children! From the creator of the bestselling Bunny books comes more wicked humour - GREAT LIES TO TELL SMALL KIDS. They range from merely bogus to truly cruel: 'Every ant you meet must be named' 'It takes the beaks of seven penguins to make a Penguin biscuit' 'All wind is made by wind farms' 'Wine makes mummy clever' 'Milk feels pain' Each hilarious cartoon tells a tall tale to bamboozle kids and entertain wicked adults everywhere.","Category":{"CategoryName":"Humour"}},{"Author":"Sam Jordison","Name":"Crap Towns Ii: The Nation Decides","Price":"11.90","Description":"Consummately contentious, fabulously funny - the brand new list of where not to go in Britain","Category":{"CategoryName":"Humour"}},{"Author":"Joshua Piven","Name":"The worst case scenario: holidays","Price":"11.90","Description":"The authors of the best-selling \"The Worst-Case Scenario Survival Handbook\" help you survive the dangers of the holiday season. Illustrated, step-by-step instructions guide you through dozens of festive scenarios.","Category":{"CategoryName":"Humour"}},{"Author":"Woody Allen","Name":"The Complete Prose","Price":"13.90","Description":"Although Woody Allen is best known for his cult movies, he is also a writer of wit and skill. This collection offers 52 pieces of hilarity, deadpan weirdness and outlandish ideas. Do you want to hear about the time Hitler went for a haircut? Or why Woody reveres Socrates? Have you ever wondered what would have happened if the Impressionists had actually been dentists? You can learn much about history - the piece on the invention of sandwiches is eye-opening - or modern life in this selection of thoughts, observations, diaries and stories from one of the most original minds and wonderfully comic voices of our time.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"I know you got soul","Price":"15.90","Description":"In I Know You Got Soul, Jeremy Clarkson writes about the machines that he believes have 'soul'. It will come as no surprise to anyone that Jeremy Clarkson loves machines. But it's not just any old bucket of blots, cogs and bearings that rings his bell. In fact, he's scoured the length and breadth of the land, plunged into the oceans and taken to the skies in search of machines with that elusive certain something. And along the way he's discovered: * The safest place to be in the event of nuclear war * Who would win if Superman, James Bond and The Terminator had a fight&nbsp;","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"Loads More Lies To Tell Small Kids","Price":"11.90","Description":"'It takes the beaks of seven penguins to make a Penguin biscuit' 'All wind is made by wind farms' 'Wine makes mummy clever' 'Milk feels pain' These are just some of the great lies that Andy Riley had you telling your kids last Christmas, in the Sunday Times bestseller GREAT LIES TO TELL SMALL KIDS. Now here are LOADS MORE LIES, to bamboozle more kids and entertain wicked adults everywhere...A brilliant sequel to the Sunday Times Top Ten bestseller.","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"The book of bunny suicides","Price":"13.90","Description":"This is dark humour at its best - a collection of hilarious and outrageous cartoons which will appeal to anyone in touch with their evil side.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"The world according to Clarkson","Price":"15.90","Description":"The world is an exciting and confusing place for Jeremy Clarkson - a man who can find the overgrown schoolboy in us all. In The World According to Clarkson, one of the country's funniest comic writers has free reign to expose absurdity, celebrate eccentricity and entertain richly in the process. And the net is cast wide: from the chronic unsuitablity of men to look after children for long periods or as operators of 'white goods', Nimbyism, cricket and PlayStations, to astronomy, David Beckham, 70's rock, the demise of Concorde, the burden of an Eton education and the shocking failure of Tom Clancy to make it on to the Booker shortlist, The World According to Clarkson is a hilarious snapshot of the life in the 21st century that will have readers wincing with embarrassed recognition and crying with laughter. It's not about the cars!","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"Clarkson on cars","Price":"11.90","Description":"A revamped, rejuvenated and expanded edition of Jeremy Clarkson's classic collection of car journalism. Clarkson rewrote the rule book for motor journalism and here's how. Opinionated, original and laugh-out-loud funny, this is Clarkson at his best.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"For crying out loud","Price":"12.90","Description":"Jeremy Clarkson, shares his opinions on just about everything in For Crying Out Loud. The publication of The World According to Clarkson in 2004 launched a multi-million copy bestselling phenomenon. But to no avail. Jeremy's one man war on crimes against common sense has not yet been won. And out hero's still scratching his head at the madness of it all. But it's not all bad. He's learnt a little along the way, including: * Why binge drinking is good for you * The worst word in the English language * The remarkable secret of eternal youth * The problem with America * And how to dispose of a seal For anyone who's been driven to wonder just what is the matter with people these days, For Crying Out Loud is the perfect riposte. Surprising, fearless and always laugh-out-loud funny, Clarkson's back.","Category":{"CategoryName":"Humour"}},{"Author":"Woody Allen","Name":"Mere Anarchy","Price":"11.90","Description":"\"I am greatly relieved that the universe is finally explainable. I was beginning to think it was me.\" Thus begins \"Strung Out\", Woody Allen's hilarious application of the laws of the universe to daily life. Mere Anarchy, Woody Allen's first new collection in 25 years, features 18 witty, wild and intelligent comic pieces - nine of which have never before been in print. Surreal, absurd, rich in verbal play, bitingly satirical and just plan daft, this collection includes tales of a body double - mistaken for the film's star - kidnapped by outlaws; a pretentious writer forced to work on the novelisation of a \"Three Stooges\" film; a nanny secretly writing an expose of her Manhattan employers; crooks selling bespoke prayers on ebay; and how to react when you're asked to finance a Broadway play about the invention and manufacture of the adjustable showerhead. Laced with his unique brand of humour and reminiscent of some of his finest films, \"Mere Anarchy\" is an essential collection of tales by the inimitable Woody Allen.","Category":{"CategoryName":"Humour"}},{"Author":"Dan Kieran","Name":"I fought the law","Price":"12.90","Description":"In an attempt to raise a dormant spirit lying somewhere between Fred Dibnah and Bonnie and Clyde, Dan Kieran has been on a journey to discover why life in modern Britain is so absurd and unfulfilling, and he has realized that everything comes down to just one thing: British law. Andthese verylaws are becoming as eccentric asmoustache clubs, shin-kicking championships, and even, God bless her, the Queen.And on his travels, Dan finds he s not alone, forthere are multitudes of people battling against the tedium. And so begins asatirical, fun-packedcrime spree asDan joins a group of protestors (five of whom were arrested for eating cakes in Parliament Square), spends the night on the roof of a bus station in Derby, befriends a group of pensioners who were forced to let off stink bombs in a court of law, finds King Arthur alive and well up a tree in Newbury, and discovers how afraid we should really be of terrorism.","Category":{"CategoryName":"Humour"}},{"Author":"Brian Lake","Name":"Bizarre books","Price":"12.90","Description":"A hilarious and offbeat collection of the wildest and weirdest book titles, subtitles, and author names ever compiled. This unique and fun collection includes color illustrations of some of the most extraordinary book jackets ever produced as well as some of the most unusual book descriptions ever printed.","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"D.I.Y. Dentistry: And Other Alarming Inventions","Price":"13.90","Description":"Deranged devices and comic contraptions from the highly inventive genius behind the hilarious \"Book of Bunny Suicides\" Much like his hero, Renaissance man Leonardo da Vinci, bestselling author Andy Riley is not \"just\" an artist (or a liar)-he's an inventor. Imagine, if you will: The easily assembled Pole-Dancing-Club-in-a- Briefcase for stranded businessmen Christmas tree ornaments that provide surveillance to instantly tell Santa if you've been bad or good A high-speed police response unit aptly named the Cop Catapult The Arsehole Trap, which can clear an average size town of arseholes in a single day with its promise of \"Big Brother\" auditions Like a twenty-first-century Rube Goldberg on the wrong mix of meds, Andy Riley has created elaborate inventions that are often side-splittingly sociopathic and never short of patently hysterical.","Category":{"CategoryName":"Humour"}},{"Author":"P.G. Wodehouse","Name":"Joy In The Morning","Price":"9.90","Description":"Trapped in the rural hell-hole of Steeple Bumpleigh with his bossy ex-fiancee, Florence Craye, her fire-breathing father, Lord Worplesdon, her frightful Boy-Scout brother, Edwin, and her beefy new betrothed, 'Stilton' Cheesewright, Bertie Wooster finds himself walking a diplomatic tightrope. With Florence threatening to ditch Stilton for Bertie, and Stilton threatening to trample on Bertie's insides if she does, things look black until Jeeves arrives to save the day. One of Wodehouse's most sparkling comedies, replete with an attendant cast of tyrannical aunts, demon children and literary fatheads.","Category":{"CategoryName":"Humour"}},{"Author":"Rik Mayall","Name":"Bigger than Hitler","Price":"12.90","Description":"In this electrifying autobiography, Rik stands naked in front of his vast legions of fans and disciples and invites them to take communion with the blood he has spilled for them during his thirty year war on show business.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"Born to be Riled: The Collected Writings of Jeremy Clarkson","Price":"12.90","Description":"Born to be Riled is a collection of hilarious vintage journalism from Jeremy Clarkson. Jeremy Clarkson, it has to said, sometimes finds the world a maddening place. And nowhere more so than from behind the wheel of a car, where you can see any number of people acting like lunatics while in control (or not) of a ton of metal. In this collection of classic columns, first published in 1999, Jeremy takes a look at the world through his windscreen, shakes his head at what he sees - and then puts the boot in.Among other things, he explains: * Why Surrey is worse than Wales * How crossing your legs in America can lead to arrest * The reason cable TV salesmen must be punched * That divorce can be blamed on the birth of Jesus Raving politicians, pointless celebrities, ridiculous 'personalities' and the Germans all get it in the neck, together with the stupid, the daft and the ludicrous, in a tour de force of comic writing guaranteed to have Jeremy's postman wheezing under sackfuls of letters from the easily offended. Praise for Jeremy Clarkson: 'Brilliant ...laugh-out-loud' Daily Telegraph 'Outrageously funny ...will have you in stitches' Time Out Number-one bestseller Jeremy Clarkson writes on cars, current affairs and anything else that annoys him in his sharp and funny collections.Clarkson On Cars, Don't Stop Me Now, Driven To Distraction, Round the Bend, Motorworld and I Know You Got Soul are also available as Penguin paperbacks; the Penguin App iClarkson: The Book of Cars can be downloaded on the App Store. Jeremy Clarkson because his writing career on the Rotherham Advertiser. Since then he has written for the Sun and the Sunday Times. Today he is the tallest person working in British television, and is the presenter of the hugely popular Top Gear.","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"Return Of The Bunny Suicides","Price":"11.90","Description":"This is dark humour at its best - a collection of hilarious and outrageous cartoons which will appeal to anyone in touch with their evil side.","Category":{"CategoryName":"Humour"}},{"Author":"Dan Kieran","Name":"The Idler Book Of Crap Holidays","Price":"11.90","Description":"In \"Crap Holidays\", Dan Kieran highlights 50 of the most disastrous - and hilarious - holidays from hell...From leaky caravans in Wales, to crushingly disappointing luxury hotels in Barbados ...From dysentery in Goa, to bloody awful holiday companions who won't leave you alone ...In fact, from Butlins to Bali, here you'll find stories of crap holiday sex, crime, food, accommodation, and of course, the inevitable family fights! Focusing on the gap between the wonderful promise and the grim reality, \"Crap Holidays\" takes a step back in time to look at hellish holidays from the past, whilst also examining 21st-century holiday culture - including information on a variety of more serious subjects, such as...The number of 'holiday' deaths that occur each year...The number and type of complaints received by different operators each year...The profits made - and the prices paid for holiday hell holes...Written once again by the Idler's readers and contributors, \"Crap Holidays\" will be packed with hilarious holiday snaps and, of course, savage cartoons satirising the whole hellish business!","Category":{"CategoryName":"Humour"}},{"Author":"Andy Riley","Name":"The Bumper Book Of Bunny Suicides","Price":"11.90","Description":"'The Book of Bunny Suicides' and 'Return of the Bunny Suicides' have introduced millions of people around the world to those cute bunnies always looking for new ways to end it all. This text presents the ultimate collection for fans of the fluffy little bunnies who just don't want to live any more.","Category":{"CategoryName":"Humour"}},{"Author":"Tom Sharpe","Name":"The Throwback","Price":"7.90","Description":"First meet young Lockhart Flawse from Flawse Hall on Flawse Fell. Then hear his story of gassing, whipping, blowing up, killing and stuffing - in fact, the everyday tale of a wild child of nature plunged into the genteel mock-Tudor world of surburban Surrey.","Category":{"CategoryName":"Humour"}},{"Author":"Simon Morley","Name":"Puppetry Of The Penis: The Ancient Australian Art Of Genital Origami","Price":"15.90","Description":"Subtitle on cover: The ancient Australian art of genital origami.","Category":{"CategoryName":"Humour"}},{"Author":"Nikesh Shukla","Name":"Meatspace","Price":"13.90","Description":"'The first and last thing I do every day is see what strangers are saying about me.'Kitab Balasubramanyam has had a rough few months. His girlfriend left him. He got fired from the job he hated for writing a novel on company time, but the novel didnвЂ™t sell and now heвЂ™s burning through his mumвЂ™s life insurance money. His father has more success with women than he does, and his Facebook comments get more likes. Kitab is reduced to spending all of his time in his flat with his brother Aziz, coming up with ideas for novelty Tumblrs and composing amusing tweets. But now even Aziz has left him, travelling to America to find his doppelganger.So what happens when Kitab BalasubramanyamвЂ™s only internet namesake turns up on his doorstep and insists that they are meant to be friends?","Category":{"CategoryName":"Humour"}},{"Author":"Sandi Toksvig","Name":"Peas and queues","Price":"13.90","Description":"How do you get rid of unwanted guests? What do you do if there's a racket in the quiet carriage? How should you eat peas, and behave in queues? How to behave, like how to punctuate, is an aspect of life that many are no longer taught - and getting it wrong is the stuff of comedy at best and humiliation at worst. Thankfully, Sandi Toksvig has come to the rescue with her entertaining guide to modern manners, with tips on what to do whether you're talking to a bore, or forgot their name in the first place. (Just call them 'darling'.)","Category":{"CategoryName":"Humour"}},{"Author":"David St. George","Name":"The right honourable chimpanzee","Price":"11.90","Description":"What if we change the newly elected Prime Minister of Britain with a chimpanzee? A very funny and satirical book.","Category":{"CategoryName":"Humour"}},{"Author":"Humphrey Carpenter","Name":"That Was Satire, That Was: The Satire Boom Of The 1960s","Price":"9.90","Description":"Forty years ago, at the 1960 Edinburgh Festival, four young men - Peter Cook, Dudley Moore, Jonathan Miller and Alan Bennett - walked on to a stage and changed the face not merely of British comedy but of social attitudes in this country. BEYOND THE FRINGE was iconoclastic, fracturing the 'culture of deference' which had predominated in the 1950s. It was the forerunner of an explosion of satire which included The Establishment Club, PRIVATE EYE and the BBC's daring weekly satire show, THAT WAS THE WEEK THAT WAS. Award-winning biographer Humphrey Carpenter evokes the atmosphere of 60's Britain and the social and political conditions which enraged and inspired the satirists, and brings vibrantly alive this amusing but also key period of British cultural life.","Category":{"CategoryName":"Humour"}},{"Author":"Robin Cooper","Name":"The timewaster letters","Price":"11.90","Description":"In his 2004 bestseller, \"The Timewaster Letters\", Robin Cooper plagued everyone from the Campaign for Courtesy to the British Halibut Association with his bizarre and surreal written requests. In Return of the Timewaster Letters, he delivers another wonderful collection of his polite, persistent and peculiar correspondence. Whether he is raising money for his nationwide hair-drying tour, booking a hotel room for his robot calf, or just trying to get rid of half a ton of unwanted herring, Robin's imagination, as ever, knows no bounds.","Category":{"CategoryName":"Humour"}},{"Author":"Rosemari Jarski","Name":"Wisecracks","Price":"11.90","Description":"Although Hollywood did not invent the wisecrack, moviemakers, screenwriters, and actors have crafted pinpoint put-downs and split-second come-ons into an art form. This thematically arranged (and thoroughly indexed) collection of classic, comic one-liners features hundreds of celluloid icons, including Mae West, W. C. Fields, and Groucho Marx. Encompassing all film genres from frothy musicals to hard-boiled noir, run-of-DeMille epics to Looney Tunes cartoons, \"Wisecracks\" features the finest of classic film comebacks that are guaranteed to delight every film fan.","Category":{"CategoryName":"Humour"}},{"Author":"BBC","Name":"Absolutely fabulous","Price":"9.90","Description":"Patsy and Edina are in full swing in these four BBC TV soundtrack episodes - Fat; Birthday; Death; Happy New Year - starring Jennifer Saunders and Joanna Lumley, with Julia Sawalha, June Whitfield and others. Duration: 1 hour 40 mins.","Category":{"CategoryName":"Humour"}},{"Author":"Terry Jones","Name":"The Pythons Biography","Price":"29.90","Description":"Over 30 years ago, a group of five Englishmen and one wayward American, rewrote the rules of comedy on \"Monty Python's Flying Circus.\" This book is a unique look at arguably the most important comic team of the modern age, lavishly illustrated with 1000 photographs and illustrations.","Category":{"CategoryName":"Humour"}},{"Author":"T S Elliot","Name":"Old possums book of practical cats","Price":"13.90","Description":"This playful collection is the source of the fantastically successful Broadway musical, \"Cats\".","Category":{"CategoryName":"Humour"}},{"Author":"Joe Quirk","Name":"Sperm Are From Men, Eggs Are From Women","Price":"12.90","Description":"Men and women ARE different. There are whole shelves full of books, millions of internet sites, and our own parents to tell us that. And anyone over a certain age can tell you how they differ. But do you know WHY we're different? This book will tell you: Why men need as many partners as possible, while women are content with just one good one What men have in common with monkeys Why the G-spot is so hard to find Why males and females don't actually exist SPERM ARE FROM MEN, EGGS ARE FROM WOMEN is full of fascinating facts - from stuff about cheating you'll never see on Jerry Springer, to how unfaithful females actually change the biology of their mates! Discover why most sperm couldn't care less if they never saw an egg and - most important - the surprising answer on what to wear to attract that alpha mate...&nbsp;","Category":{"CategoryName":"Humour"}},{"Author":"Denis Gifford","Name":"The best of &quot;Eagle&quot; annual 1951-1959","Price":"19.90","Description":"If you were a young lad in 1950s Britain, youвЂ™d most likely have been an avid reader of Eagle magazine. Featuring iconic comics such as&nbsp;Dan Dare,&nbsp;Pilot of the Future, and&nbsp;Harris Tweed, Extra Special Agent, along with all the things boys loveвЂ”nature, military history, magic tricks, cowboys, and childhood hobbies of all stripesвЂ”it sold more than one million copies each week. Now itвЂ™s back, with this special annual edition that commemorates the&nbsp;EagleвЂ™s heyday. Designed for anyone who loves retro culture, it offers actual features that are reprinted as they first appeared, including the comics, articles, readersвЂ™ letters and even advertisements that were an integral part of growing up.","Category":{"CategoryName":"Humour"}},{"Author":"Edward Gorey","Name":"The haunted tea-cosy","Price":"23.90","Description":"In the preface to \"A Christmas Carol,\" Charles Dickens wrote that he tried \"to raise the Ghost of an Idea\" with readers and trusted that it would \"haunt their houses pleasantly.\" In December 1997, 154 Christmases later, the \"New York Times Magazine\" asked our Edward Gorey, \"the iconoclastic artist and author, \" to refurbish this enduring morality tale. What is Gorey's moral? Don't eat fruitcake? Don't look for morals? Don't mess with the classics? Whatever. You decide. But don't think too hard, and have a Merry Christmas.","Category":{"CategoryName":"Humour"}},{"Author":"Edward Gorey","Name":"The eclectic abecedarium","Price":"19.90","Description":"Edward Gorey's first miniature book, The Eclectic Abecedarium is an illustrated adventure through the English alphabet, accompanied by rhyming adventure through the English alphabet, accompanied by rhyming couplets penned by Gorey, who described his creations as \"literary nonsense.\" Inspired by popular moral primers for children, Gorey created an updated version of Isaac Watt's alphabetic adhorisms. Part sweet songs of unseen birds and part cautionary tales, this abecedarium fully lives up to the epithet \"eclectic.\"&nbsp;","Category":{"CategoryName":"Humour"}},{"Author":"Dalton","Name":"Shit London 2","Price":"11.90","Description":"'Nobody is healthy in London. Nobody can be.' Jane Austen Once all the hype, hyperbole and hysteria of the 2012 Olympics has quickly been discarded in the nostalgia bin, Londoners' will no doubt be left with all the actual tidying-up. But once all that tidying up has been done, Londoners' will then be left with the crushing memory that London's streets, shops, architecture, culture and heritage was in a brutal state of dereliction. The truth is, no matter what Lord Coe and his PR team say after they've left town, London is still shit. Shit London 2 is the sequel to the bestselling Portico book Shit London (9781907554346). This hilarious follow-up continues to explore the mad world of ill-conceived community 'art', pun-based shop names, creepy graffiti, god-awful translations, comical signs and any other unintentionally funny scenes that real Londoners have to put up with every single day. Word Count: 3,000","Category":{"CategoryName":"Humour"}},{"Author":"Douglas Adams","Name":"The Hitchhiker Trilogy","Price":"0","Description":"THE HITCHIKER'S GUIDE TO THE GALAXY: One Thursday lunchtime the Earth gets demolished to make way for a hyperspace bypass. For Arthur, who has just had his house demolished, this is too much. Sadly, the weekend's just begun. THE RESTAURANT AT THE END OF THE UNIVERSE: When all issues of space, time, matter and the nature of being are resolved, only one question remains: Where shall we have dinner? The Restaurant at the End of the Universe provides the ultimate gastronomic experience and, for once, there is no morning after. LIFE, THE UNIVERSE AND EVERYTHING: In consequence of a number of stunning catastrophes, Arthur Dent is surprised to find himself living in a hideously miserable cave on prehistoric Earth. And then, just as he thinks that things cannot possibly get any worse, they suddenly do.","Category":{"CategoryName":"Humour"}},{"Author":"Anne Taintor","Name":"I Can't Be Good All the Time: An Anne Taintor Collection","Price":"0","Description":"Move over Mae West--here come this millennium's incomparable tainted ladies, courtesy of artist Anne Taintor. Taintor's sassy, saucy creations pair vintage illustrations with witticisms few can resist, and her well-mannered women enjoy deliciously naughty thoughts.","Category":{"CategoryName":"Humour"}},{"Author":"Harry Choron","Name":"Look! It's Jesus!","Price":"0","Description":"Every day, Jesus, Buddha, the Virgin Mary, and Mother Teresa appear to people in the most unlikely of places. From grilled cheese sandwiches to beehives to frying pans, these 100% authentic visions are enlightening and always amazing. Featuring an eye-catching lenticular cover as well as testimony from the real people who discovered these miraculous images, Look! It's Jesus! reminds us that a miracle can happen at any moment.","Category":{"CategoryName":"Humour"}},{"Author":"Ian Crofton","Name":"Brewers cabinet of curiosities","Price":"0","Description":"From the creators of \"Brewer's Dictionary of Phrase and Fable,\" considered by many the greatest trivia collection ever, comes another cool collection of fabulous facts, quirky quotes, and unbelievable-but-true happenings. The coverage includes various historic, literary, artistic, and scientific categories--each supplying its share of the bizarre and the hilarious. Some examples: a list of royal nicknames, from William the Bastard (a.k.a. the Conqueror) to Harry Potty (today's irrepressible Prince Harry); the longest and shortest wars, from the 100 Years' War to the Thirty-eight Minutes' War; the ship's cat that won a medal; and why the planet Uranus was nearly officially named George.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"Motorworld","Price":"0","Description":"In a revamped, refreshed and expanded edition, Motorworld appears in paperback for the first time. From Iceland to Australia, Clarkson travels the world exploring car culture. This is comic travel writing at its laugh-out-loud funniest.","Category":{"CategoryName":"Humour"}},{"Author":"P G Wodehouse","Name":"Laughing Gas","Price":"0","Description":"A Hollywood star and an English aristocrat exchange souls while under ether at the dentist and the result is mayhem. Though his golden curls and sweet expression make him the idol of mothers throughout America, Joey Cooley is a tough nut who wants nothing more than to revenge himself on the agents, directors and producers who make his life a misery, before escaping back to Ohio. When his soul is transplanted into the body of an English earl with a boxing Blue he has the chance to 'poke them all in the snoot'. Lord Havershot, meanwhile, finds himself under the thumb of the fierce Miss Brinkmeyer and terrorized by the boy stars Joey has supplanted. The result is Anglo-American farce with the lightest of touches.","Category":{"CategoryName":"Humour"}},{"Author":"Going Down: Great Writing On Oral Sex","Name":"Chronicle Books Staff LLC","Price":"0","Description":"Heading south? Is it the pleasure? The power? The giving? The taking? Finally you can plumb the depths of oral maneuvers in good company. This conveniently portable, stimulating volume fits easily in glove box, brief case, or evening clutch and is the perfect companion to or substitute for those private, climactic moments. Fiction, essay, poetry; here is an adventuresome literary collection to take you to provocative new heights. Sexy to shocking, dark musings to hilarious tales, \"Going Down \"is guaranteed to satisfy. Today, it's practically required reading in both the public and private sectors. Scores of notorious sexperts, including John Updike, Ana s Nin, and Oscar Wilde, have given readers their views on oral encounters, as have Frank Zappa, Erica Jong, Harold Brodkey, Cynthia Heimel, and a host of other fresh and frank contemporary voices. Now we get the best writing, the hot low-down, all in one place. And why not? It's the topic on everyone's lips.\"","Category":{"CategoryName":"Humour"}},{"Author":"Bodhi Oser","Name":"Fuck this book","Price":"0","Description":"Juvenile, profane, and timeless, this book collects the images of real public signs that have been mischievously altered by stickers bearing the most expressive of all four-letter words. 150 color photos.","Category":{"CategoryName":"Humour"}},{"Author":"Max Barry","Name":"Syrup","Price":"0","Description":"This brilliantly scathing debut is a hilarious send-up of celebrity, sexual politics, corporate America, and the fleeting status that comes with getting to the table first before the other guy has you for lunch.","Category":{"CategoryName":"Humour"}},{"Author":"Charlie Croker","Name":"Lost in translation","Price":"0","Description":"In today's world no self-respecting English-language enthusiast could have failed to notice the frequent and flagrant abuse of our native tongue by pesky foreigners? (Forgetting, for a moment, the fact that many nations speak our language better than we do.) \"Lost in Translation\" features hundreds of genuine, original and utterly ridiculous examples of the misadventures in English discovered all over the world by the author and his intrepid team of researchers. Everything from hotel signs to baffling advertisements, such as the German beauty product offering a 'Cream shower for pretentious skin' or the Japanese bar that boasts 'Special cocktails for ladies with nuts', or the French warning at a swimming pool - 'Swimming is forbidden in the absence of the saviour.' Published in paperback for the first time this autumn, \"Lost in Translation\" demonstrates how widely the English language has travelled, though unfortunately some of it seems to have got a bit scrambled en route.","Category":{"CategoryName":"Humour"}},{"Author":"Jeremy Clarkson","Name":"Planet Dagenham","Price":"0","Description":"The outrageous, unstoppable and hilarious Je remy Clarkson is back with another blockbusting book of cars , featuring a beautiful collection of machines that are film , T.V., music and sports stars in their own right. '","Category":{"CategoryName":"Humour"}},{"Author":"Alex Boese","Name":"Elephants on Acid: and Other Bizarre Experiments","Price":"0","Description":"When Tusko the Elephant woke in his pen on 3 August 1962, little did he know that he was about to be given the largest ever single dose of LSD ...\"Elephants on Acid\" is a wonderfully entertaining, authoritative collection of history's most bizarre experiments, from the 19th-century creation of zombie kittens to a University of Wisconsin study that answers, definitively, the question of whether women who play hard to get really are more desirable. As well as learning what happened to Tusko, you will discover the 1959 mathematical equation for the point at which chatter at a drinks party becomes loud; whether listening to Mozart makes children super-students; and the secret of how to sleep on planes ...If left to their own devices, would babies instinctively pick a well-balanced diet? If you were unfortunate enough to fall down a disused mine shaft, would your dog run to fetch help? Which really tastes better in a blind tasting - Coke, or Pepsi?","Category":{"CategoryName":"Humour"}},{"Author":"Greg Stones","Name":"Penguins hate stuff","Price":"0","Description":"Penguins hate zombies. They also hate serpents, bad haircuts, sock monkeys, leprechauns, Halloween, oil rigs, vampire penguins, and mermaids. They really hate clowns, but they really like capes, balloons, and free vacations. This quirky collection reveals the discriminating tastes of these adorable flightless Antarctic birds who encounter odd foes (snow sharks, beavers, cowboys, samurai...), but still manage to enjoy the little things in life. With wit, humor, and the occasional alien invasion, Greg Stones's paintings capture the playfully absurd life of penguins.","Category":{"CategoryName":"Humour"}},{"Author":"Jeffrey Brown","Name":"Cat getting out of a bag","Price":"0","Description":"A collection of comics based on the author's cat, depicting its antics as it eats, plays, purrs, and engages in other distinctively feline behaviors.","Category":{"CategoryName":"Humour"}},{"Author":"Chronicle Books","Name":"Grumpy Cat","Price":"0","Description":"Grumpy Cat's discouraging words make this journal the perfect place to detail the highs and lows of everyday life.","Category":{"CategoryName":"Humour"}},{"Author":"Ben Elton","Name":"Blind Faith","Price":"0","Description":"Imagine a world where everyone knows everything about everybody. Where what a person 'feels' and 'truly believes' is protected under the law, while what is rational, even provable is condemned as heresy. A world where to question ignorance and intolerance is to commit a Crime against Faith. Imagine it. Or just wait until After The Flood. On a hot Sagittarian morning in the year 56 ATF, Trafford Sewell struggles to work through the usual crowds of near-naked commuters. He is confronted by the intimidating figure of his Parish Confessor. Why has Trafford not been streaming his every moment of sexual intimacy onto the community website like everybody else? Does he think he's different or special in some way? Better than his fellow man and woman? Does he have something to hide? Ben Elton's dark, savagely comic novel imagines a post-apocalyptic society where religious intolerance combines with a confessional sex obsessed, self-centric culture to create a world where nakedness is modesty, ignorance is wisdom and privacy is a dangerous perversion. A chilling vision of what's to come? Or something rather closer to what we call reality?","Category":{"CategoryName":"Humour"}},{"Author":"Johnathan Coe","Name":"What a carve up","Price":"0","Description":"What a Carve Up! -&nbsp;a hilarious 1980s political satire by Jonathan CoeIt is the 1980s and the Winshaw family are getting richer and crueller by the year:Newspaper-columnist Hilary gets thousands for telling it like it isn't; Henry's turning hospitals into car parks; Roddy's selling art in return for sex; down on the farm Dorothy's squeezing every last pound from her livestock; Thomas is making a killing on the stock exchange; and Mark is selling arms to dictators.","Category":{"CategoryName":"Humour"}},{"Author":"Woody Allen","Name":"Without feathers","Price":"0","Description":"Here they are--some of the funniest tales and ruminations ever put into print, by one of the great comic minds of our time. From THE WHORE OF MENSA, to GOD (A Play), to NO KADDISH FOR WEINSTEIN, old and new Woody Allen fans will laugh themselves hysterical over these sparkling gems.","Category":{"CategoryName":"Humour"}},{"Author":"Kenji Kawakami","Name":"The Big Bento Box of Unuseless Japanese Inventions: The Art of Chindogu","Price":"0","Description":"In Japan, Kawakami is famous for his tireless promotion of Chindogu: the art of the \"unuseless\" idea. Meant to solve problems of modern life, 200 of these bizarre and logic-defying gadgets and gizmos are featured in this humorous collection. Photos.","Category":{"CategoryName":"Humour"}},{"Author":"Helen Cumberbatch","Name":"Sound Bites: The Wit of the Beatles","Price":"0","Description":"\"Sound Bites: The Wit of The Beatles\" celebrates the down-to-earth humor of these four happy-go-lucky, cheeky Liverpool lads. Although undoubtedly the most influential band of the 20th Century, John, Paul, George, and Ringo also proved they had a natural gift for comedy--especially when faced with the 1960s media circus. Featuring a host of pithy remarks as well as tales from their many film and music ventures, the book is illustrated throughout with nostalgic pictures of the band.","Category":{"CategoryName":"Humour"}},{"Author":"Candida Royalle","Name":"How To Tell A Naked Man What To Do","Price":"0","Description":"Sex expert Candida Royalle shows women how to liberate their sexual desires, heighten their sensuality, and ignite their romantic relationships. In How to Tell a Naked Man What to Do, Royalle draws on her thirty years of experience in erotic entertainment and education to present the complete woman's guide to giving up shame and getting great sex. With her seductive wit and sensual wisdom, Royalle uses the process of erotic film production as a blueprint to teach readers how to direct their own sex lives and make their deepest fantasies come true in the privacy of their own bedroom. She guides readers through easy-to-follow lessons on how to:* Undress your mind and break through inhibitions* Plan a sexy night - from top to bottom* Choose fun toys and props* Express yourself and get what you want* Lay the foundation for a long-term, healthy erotic relationship. Sharing her own sexual secrets, along with other women's stories, Candida Royalle provides a fun and empowering how-to guide for any woman who longs to become her complete sexual self.","Category":{"CategoryName":"Humour"}},{"Author":"Spignesi","Name":"The Woody Allen companion","Price":"0","Description":"A comprehensive, up-to-date, fun and informative look at Woody Allen, his life, his films, his writings, and his unique role in contemporary culture. This is the ultimate guide for Woody's fans, featuring interviews, articles, photos, reviews, interpretive essays, bibliography, filmography, and more. 16 pages of photographs.","Category":{"CategoryName":"Humour"}},{"Author":"Bikesnobnyc","Name":"The Enlightened Cyclist: Commuter Angst, Dangerous Drivers, and Other Obstacles on the Path to Two-Wheeled Trancendence","Price":"0","Description":"Following up the bestselling \"Bike Snob,\" BikeSnob NYC takes on the trials and triumphs of bike commuting with snark, humor, and enthusiasm. From the deadly sins of biking to tactics for dealing with cars, this primer is a must-read for cyclists new and seasoned alike.","Category":{"CategoryName":"Humour"}},{"Author":"Eben Weiss","Name":"Bike Snob Abroad: Strange Customs, Incredible Fiets, and the Quest for Cycling Paradise","Price":"0","Description":"BikeSnobNYC reaches the final frontier of cycling: riding with the family. As his choice to take to the road with his toddler son in tow is met with bewilderment and disapproval from onlookers and the occasional motorist, he ponders why it's such a taboo.","Category":{"CategoryName":"Humour"}},{"Author":"Friedman","Name":"A mind of its own","Price":"0","Description":"Whether enemy or ally, demon or god, the source of satisfaction or the root of all earthly troubles, the penis has forced humanity to wrestle with its enduring mysteries. Here, in an enlightening and entertaining cultural study, is a book that puts into context the central role of the penis within Western civilization. David M. Friedman shows that the penis is more than a body part. It is an idea, a conceptual but flesh-and-blood measuring stick of a man's place in the world.Deified by the pagan cultures of the ancient world and demonized by the early Roman church, the penis was later secularized by pioneering anatomists such as Leonardo da Vinci. After being measured 'scientifically' in an effort to subjugate some races while elevating others, the organ was psychoanalysed by Sigmund Freud. Now, after being politicized by feminism and exploited in countless ways by pop culture, the penis has been medicalized.As no one has before him, Friedman shows how the arrival of erection industry products such as Viagra is more than a health of business story. It is the latest - and perhaps final - chapter in one of the longest sagas in human history: the story of man's relationship with his penis.","Category":{"CategoryName":"Humour"}},{"Author":"Henry Hitchings","Name":"How To Really Talk About Books You Haven't Read","Price":"0","Description":"Ever wondered how some people seem to have an opinion on every book ever published? Henry Hitchings introduces the invaluable skill of literary bluffing in this survivor's guide to talking about books you haven't read.","Category":{"CategoryName":"Humour"}},{"Author":"Edward Gorey","Name":"The epiplectic bicycle","Price":"0","Description":"While Embley and Yewbert are hitting one another with croquet mallets one day, an untenanted bicycle rolls into their garden. This book chronicles their adventures across turnip fields, through barns and into bushes.","Category":{"CategoryName":"Humour"}},{"Author":"Philip Ardach","Name":"The silly side of Sherlock Holmes","Price":"0","Description":"In The Not-So-Very-Nice Goings-On at Victoria Lodge, Philip Ardagh took illustrations from The Girl's Own Paper of the 1890s and used them to tell a brand new tale of (unlikely) intrigue, with hilarious results. Now he's at it again, but this time with the original Sherlock Holmes illustrations from The Strand Magazine, to bring The Silly Side of Sherlock Holmes to bathrooms across the nation. A true Sherlock Holmes fan since age nine, Philip Ardagh owns a variety of strange editions of the original canon, including one in Pitman's shorthand English. He's always felt that Holmes's humorous side has been largely ignored. The Silly Side of Sherlock Holmes does nothing to redress the balance. It's a shameless piece of frivolous fun, which, under test conditions, produced everything from suppressed chortles to out and out guffaws. Ideal for everyone from Sherlock Holmes fans to people who quite like reading silly captions. Sometimes.","Category":{"CategoryName":"Humour"}},{"Author":"Gary Larson","Name":"Unnatural Selections","Price":"0","Description":"Hot on the paws of the howling success of Wiener Dog Art comes the new Far Side masterpiece Unnatural Selections. Including more than 100 cartoons in their book debut, it also unearths an original four-color insert created by Gary Larson especially for this twelfth collection. Journey back in time as Larson does for evolution what he previously did for art.","Category":{"CategoryName":"Humour"}},{"Author":"The New Yorker Book of Dog Cartoons","Name":"Unknown","Price":"0","Description":"Every dog has its day, but nowhere more gleefully or more mischievously than in these 101 funny cartoons culled from the pages of The New Yorker over the past 65 years. Here are dogs inquisitive and intelligent, spoiled and spoiling, skittish and unflappable, faithful and independent--from artists such as Addams, Thurber, Arno, Steinberg and others.","Category":{"CategoryName":"Humour"}},{"Author":"Joseph Cohen","Name":"The Penis Book","Price":"0","Description":"Ah, the trusty penis. The cock, knob, widgie, pink python, groin bollard - call it what you will, this is one part of the male anatomy that never ceases to provide endless fascination, and frequently mirth. Half the population have one, and the other half, so Freud would have us believe, would like to. And yet still our flaccid friend is so often misunderstood. The \"Penis Book\" seeks to redress the balance, exposing all (quite literally) there is to know about the honourable member.Throbbing with facts, figures, photos and illustrations, the book leaves no foreskin unturned in its quest to bring you the low-down on its subject. Told with wit, vim and lashings of wicked humour, even the most prudish won't be able to resist raising a smile (and perhaps something else). The \"Penis Book\" is a celebration of the male member in all its purple-helmeted glory. So whether you're male or female, straight or gay, you'll find something in here to titilate and stimulate.","Category":{"CategoryName":"Humour"}},{"Author":"Gary Larson","Name":"The Far Side Gallery: No. 4","Price":"0","Description":"The Far Side&nbsp;was syndicated in more than 1,900 daily newspapers from 1980 to 1995, when Gary Larson retired. During its run, the cartoon spawned 22 books from AMP, which were translated into a total of 17 different languages. For his work with&nbsp;The Far Side, Larson was awarded the Reuben Award for Outstanding Cartoonist from the National Cartoonists Society in 1991 and 1994. The group also named&nbsp;The Far Side&nbsp;Best Syndicated Panel in both 1985 and 1987.","Category":{"CategoryName":"Humour"}},{"Author":"Dr. Sadie Allison","Name":"Tickle his pickle","Price":"0","Description":"Sadie Allison has written this penis instruction manual for women who want to rekindle passion, reawaken romance, and revive red-hot sex. \"Tickle His Pickle!\" includes more than 50 hand and oral love-making techniques with 100 titillating illustrations to guide readers through the learning process. Tickle Kitty Press","Category":{"CategoryName":"Humour"}},{"Author":"Julie Peasgood","Name":"The greatest sex tips in the world","Price":"0","Description":"Did you know...Semen contains only 5 to 15 calories per ejaculation, and about 60 per cent of our recommended daily intake of Vitamin C! Did you know...In 1894, an anti-masturbatory food was invented, which was supposed to take away all sexual desire? The product was called Cornflakes. Did you know...It's easier to have an orgasm if your feet are warm? Did you know...The clitoris has 8,000 nerve endings (that's twice as many as the penis) making it even more responsive than the tongue? Did you know...Celery, porridge and banana bread can boost your libido?Refreshingly frank and funny, actress and presenter, Julie Peasgood delivers practical information to transform your sex life.","Category":{"CategoryName":"Humour"}},{"Author":"The New Yorker Book of Business Cartoons","Name":"Unknown","Price":"0","Description":"This wonderfully entertaining collection of 110 of the very best cartoons of business and finance, culled from 75 years of \"The New Yorker\", features classics from George Booth, Charles Addams, Lee Lorenz, Peter Arno, and many others.","Category":{"CategoryName":"Humour"}},{"Author":"The New Yorker Book of Cat Cartoons","Name":"Unknown","Price":"0","Description":"Cats and cat owners, cat intelligence (or lack thereof), cat inscrutability, cat arrogance and more are all here as seen through the eyes of some of the funniest cartoonists who have contributed to The New Yorker during ita 65 years. Features the works of Charles Addams, Arnie Levin, Lee Lorenz, Helen Hokinson, and others.","Category":{"CategoryName":"Humour"}},{"Author":"The New Yorker Book of Doctor Cartoons and Psychiatrist","Name":"Unknown","Price":"0","Description":"In the grand tradition of The New Yorker Book of Cat Cartoons and Dog Cartoons--the funniest doctor cartoons that have appeared in The New Yorker since 1925 to the present. 85 illus.","Category":{"CategoryName":"Humour"}},{"Author":"The New Yorker Book of Literary Cartoons","Name":"Unknown","Price":"0","Description":"Welcome to \"The New Yorker Book of Literary Cartoons,\" a timeless tribute to the peerless power of the literary landscape. In 104 drawings, each of them certified by experts to be worth a thousand words (and some of them quite amusing), the essence of reading, writing, publishing, and shelving books is explored in all its glory and absurdity, from the stunning and sublime to the purple and pretentious.Here is Emma Bovary shrugging off those pesky bouts with existential boredom (on the tennis court), Dickens' fateful encounter with a martini (olive or twist?), and T.S. Eliot's \"The Waste Land\" thoughtfully rewritten for the Beavis and Butt-Head market (\"April sucks\"). Here is a long-awaited and wholly unprecedented comic takedown of that loftiest of all cultural arenas, the world of belles lettres. It is a world where books stamped with promises from Oprah stand alongside others arranged by the attention span they require, a world where the Bible can now be found in the self-help section.Here, finally, are dead-on portraits and eye-opening ruminations on all things bookish, writerly, and readerly, courtesy of \"The New Yorker's\" renowned stable of cartoonists, from Charles Barsotti to Roz Chast, Ed Koren to J.B. Handelsman, and Jack Ziegler to Victoria Roberts. In the bestselling tradition of such classics as \"The New Yorker Book of Lawyer Cartoons\" and \"The New Yorker Book of Cat Cartoons -- THE NEW YORKER BOOK OF LITERARY CARTOONS\" is manna straight from bookworm heaven.","Category":{"CategoryName":"Humour"}},{"Author":"The New Yorker Book of Teacher Cartoons","Name":"Unknown","Price":"0","Description":"This wonderful collection of the best and funniest cartoons published over the last eighty years in The New Yorker takes a wry look into the classroom--at the students, at their blindly devoted but demanding parents, and especially, at the teachers whoo negotiate the delicate balance between those forces every day. With 118 cartoons, this is a perfect gift for teachers and a treasure of laughs for all!","Category":{"CategoryName":"Humour"}},{"Author":"John O'Farrell","Name":"I Blame The Scapegoats","Price":"0","Description":"A doctor in America has just invented a 'sperm sorting machine'. At least that's what he claimed when his receptionist burst into the office to find him doing something peculiar with the Hoover attachment. Apparently the system used for separating the male and female sperm is remarkably simple. A sample is placed in the petri dish with a microscopic pile of household items on a tiny staircase. All the sperm that go straight past without picking anything up are obviously boys. John O'Farrell's first collection of columns GLOBAL VILLAGE IDIOT was a huge success prompting fulsome praise from such major public figures as the Queen Mother, Roy Jenkins and Cardinal Hume. Sadly, since their deaths, their glowing endorsements cannot be officially verified. So here instead is another collection of funny, satirical essays on a hundred and one 21st century subjects. Read how the government plans to introduce 'Santa loans' that will leave school children GBP10,000 in debt for all the presents that used to be free from Father Christmas. Learn how the EU is being expanded to include Narnia. And did you know that American war planes now have a little sticker on the back saying 'How's my bombing?' with an 0800 number to call if they blow up any Muslim country in a discourteous of aggressive manner ...","Category":{"CategoryName":"Humour"}},{"Author":"Jennifer Worick","Name":"The Action Heroine's Handbook","Price":"0","Description":"Art Encounters is a wonderful new fiction series designed to introduce young readers to great painters. This series brings famous works of art to life through thrilling and evocative stories that reflect the individual paintings featured, not unlike The Girl with a Pearl Earring. Each book in the series will focus on the style, techniques, and influences of great painters. Over the course of the book, the cover painting, Self Portrait with Thorn Necklace and Hummingbird, transforms from a nightmarish vision of death into a life affirming masterpiece. The story alternates between Kahlo's home in Mexico City, Casa Azul, and the journey of a teenage girl and her young brother, lost in the city. At the mystical Casa Azul, everything with a face talks, including Kahlo's pet monkey, her cat, and even the portraits on the wall. And everything has an opinion about how Kahlo should be running her life, especially since it's in shambles after her divorce from Diego Rivera. Guided by her odd friends, she helps the children  and slowly regains her will to live and to create. This dramatic story offers a vivid re imagining of the life and work of a woman as well known for her amazing life as for her amazing art.","Category":{"CategoryName":"Humour"}},{"Author":"How To Behave","Name":"Caroline Tiger","Price":"0","Description":"Do plastic bag shufflings in a movie theater drive you crazy? Do you wonder whether it's proper to pass a roller blader on the right or left? Have you or has someone you know ever been subjected to \"rain rage\"? Have you ever pondered why no one in your local grocery store seems to understand the rules of basic shopping cart navigation and right of way? If you answered \"yes\" to any of these questions, How to Behave is the book you've been waiting for: a hip, irreverent, but entirely practical manual that tells you all you need to know about day to day survival in every venue. You'll learn how to share elbow space on an airplane armrest, how to confront a noisy filmgoer, and the proper way to position yourself when boarding a crowded elevator. Much more than a simple etiquette book, How to Behave is a real life guide to living in the real world.","Category":{"CategoryName":"Humour"}},{"Author":"Sam Stall","Name":"Harry Stall","Price":"0","Description":"No description available","Category":{"CategoryName":"Humour"}}]