[{"Author":"Clive King","Name":"Stig of the Dump","Price":"11.90","Description":"Barney is a solitary eight-year-old, given to wandering off by himself. One day he tumbles over, lands in a sort of cave, and meets' somebody with shaggy hair wearing a rabbit-skin and speaking in grunts. He names him Stig. They together raid the rubbish dump at the bottom of the pit, improve Stig's cave dwelling, and enjoy a series of adventures.","Category":{"CategoryName":"Kids Books"}},{"Author":"Astrid Lindgren","Name":"The best of Pippi Longstocking","Price":"11.90","Description":"Pippi Longstocking is as popular as ever, with dedicated fans all over the world. She's funny, feisty, and incredibly strong and has the most amazing adventures ever! Here's a chance to read three books about Pippi in one volume - Pippi Longstocking, Pippi Goes Aboard, and Pippi in the South Seas. This edition is illustrated throughout with black and white line drawings by best-selling artist, Tony Ross. Astrid Lindgren has won numerous awards including the Hans Christian Andersen Award and the International Book Award.","Category":{"CategoryName":"Kids Books"}},{"Author":"Roald Dahl","Name":"The BFG, Matilda, George's marvellous medicine","Price":"13.90","Description":"No description available","Category":{"CategoryName":"Kids Books"}},{"Author":"Helen Caswell","Name":"God's World Makes Me Feel So Little","Price":"3.90","Description":"How can God care about something as little as a child? This book introduces young readers to the wonders of God's world and shows children why they are important and precious in God's sight.","Category":{"CategoryName":"Kids Books"}},{"Author":"L Frank Baum","Name":"The wizard of Oz","Price":"11.90","Description":"'We're not in Kansas any more, Toto ...' When a devastating tornado lifts up her house, Dorothy and her faithful dog Toto find themselves transported to a strange and beautiful land. Fearing they may never see home again, they set off on a magical journey to meet the Wizard of Oz, probably the only person who can help Dorothy find her way back to Kansas. Accompanied by a Tin Woodman, a Scarecrow and a Cowardly Lion, Dorothy finds her way onto the Yellow Brick Road, which she must follow all the way to the Emerald City, but many dangers lie ahead, not least the Wicked Witch of the West. The Wonderful Wizard of Oz has delighted generations of children since its initial publication in 1900. It joins the ranks of Alice's Adventures in Wonderland, Peter Pan, and Treasure Island as a genuine children's classic, filled with fantasy and adventure. Born May 15 1856, L Frank Baum is cherished today as the creator of the Land of Oz. The first of his fourteen OZ books, The Wonderful Wizard of Oz, was published in 1900. It has never been out of print since and in 1939 it was made into what would become one of the most beloved films of all time.","Category":{"CategoryName":"Kids Books"}},{"Author":"Lewis Carroll","Name":"Through The Looking Glass","Price":"7.90","Description":"Lewis Carroll | Through The Looking Glass&nbsp;On an ordinary summer's afternoon, Alice tumbles down a hole and an extraordinary adventure begins. In a strange world with even stranger characters, she meets a rabbit with a pocket watch, joins a Mad Hatter's Tea Party, and plays croquet with the Queen! Lost in this fantasy land, Alice finds herself growing more and more curious by the minute . . .","Category":{"CategoryName":"Kids Books"}},{"Author":"Lewis Carroll","Name":"Alice's Adventures In Wonderland &amp; Through The Looking Glass","Price":"5.90","Description":"Lewis Carroll | Alice's Adventures In Wonderland &amp; Through The Looking Glass&nbsp;This selection of Carroll's works includes&nbsp;Alice's Adventures in Wonderland&nbsp;and its sequel,&nbsp;Through the Looking-Glass, both containing the famous illustrations by Sir John Tenniel. No greater books for children have ever been written. The simple language, dreamlike atmosphere, and fantastical characters are as appealing to young readers today as ever they were.Meanwhile, however, these apparently simple stories have become recognised as adult masterpieces, and extraordinary experiments, years ahead of their time, in Modernism and Surrealism. Through wordplay, parody and logical and philosophical puzzles, Carroll engenders a variety of sub-texts, teasing, ominous or melancholy. For all the surface playfulness there is meaning everywhere. The author reveals himself in glimpses.","Category":{"CategoryName":"Kids Books"}},{"Author":"Roald Dahl","Name":"James and the giant peach","Price":"11.90","Description":"A splendiferous new hardback of James and the Giant Peach, part of a collection of truly delumptious classic Roald Dahl titles with stylish jackets over surprise printed colour cases, and exquisite endpaper designs. James Henry Trotter lives with two ghastly hags. Aunt Sponge is enormously fat with a face that looks boiled and Aunt Spiker is bony and screeching. He's very lonely until one day something peculiar happens. At the end of the garden a peach starts to grow and GROW AND GROW. Inside that peach are seven very unusual insects - all waiting to take James on a magical adventure.But where will they go in their GIANT PEACH and what will happen to the horrible aunts if they stand in their way? There's only one way to find out . . \"A true genius ...Roald Dahl is my hero\" - David Walliams Now you can listen to James and the Giant Peach and other Roald Dahl AUDIOBOOKS read by some very famous voices, including Kate Winslet, David Walliams and Steven Fry - plus there are added squelchy soundeffects from Pinewood Studios! Also look out for new Roald Dahl apps in the App store and Google Play- including the disgusting TWIT OR MISS! and HOUSE OF TWITS inspired by the revolting Twits.","Category":{"CategoryName":"Kids Books"}},{"Author":"Beatrix Potter","Name":"A Beatrix Potter treasury","Price":"19.90","Description":"Ten of Beatrix Potter?s most popular tales are brought together in this beautiful jacketed hardcover treasury. The tales trace the life of Beatrix Potter from her first publication in of&nbsp;The Tale of Peter Rabbit&nbsp;1902 to her later tales set around her farm,&nbsp;Hill Top.&nbsp;A wonderful illustrated introduction provides background on Beatrix Potter and the people and places that inspired her writing.","Category":{"CategoryName":"Kids Books"}},{"Author":"Carol Vorderman","Name":"How To Do Sudoku","Price":"9.90","Description":"Sudoku is the fiendishly addictive number puzzle game that has become the nation's latest obsession. This book for young readers contains over 120 puzzles and step-by-step instructions, guiding puzzlers from the easiest sudoku games through to medium and difficult levels. Carol teaches new skills at each stage, using clear, colourful examples and helping to fine-tuning tactics and eliminate guesswork. A perfect introduction to Sudoku as well as a great puzzler for kids who have already mastered the art, fronted by a number one author - this is guaranteed to be a bestseller!","Category":{"CategoryName":"Kids Books"}},{"Author":"Tove Jansson","Name":"Moomin Book Four: The Complete Tove Jansson Comic Strip","Price":"39.90","Description":"The bestselling, award-winning Moomin series, created by the legendary children's author Jansson, is now in its fourth installment.","Category":{"CategoryName":"Kids Books"}},{"Author":"Tove Jansson","Name":"Moominpappa at sea","Price":"14.90","Description":"A Moomintroll is small and shy and fat, and has a Moominpappa and a Moominmamma. Moomins live in the forests of Finland. One day Moominpappa is feeling at a loss. He has no idea what to do with himself because it seems everything has already been done. So he takes his family off to start a new life in a lighthouse on a tiny, rocky island far out to sea. It's rather quiet and lonely at first, but as they begin to explore their unusual surroundings the Moomins discover some funny and surprising new things about themselves.","Category":{"CategoryName":"Kids Books"}},{"Author":"Paul Simpson","Name":"The Rough Guide To Kids' Movies","Price":"9.90","Description":"Kids' Movies where do you start? There are hundreds of them out on video and DVD, and life (or at least, childhood) is too short to discover the gems, or to endure the dross. Which is where this Rough Guide comes in, reviewing the best kids' films across genres from action to fantasy to westerns, and telling you, crucially, if they're any good. The Rough Guide includes reviews of more than 250 kids' movies, celebrating recent hits such as Finding Nemo and Elf, as well as classics like The Wizard of Oz and lesser-known gems like Miyazaki's Kiki's Delivery Service. There is also full coverage of more than 100 grown up' movies, from James Bond to Jane Austen, which should divert and delight older kids. For each entry there is advice on content and suitablility the film, noting scenes or language which might disturb younger viewers or their parents!\"","Category":{"CategoryName":"Kids Books"}},{"Author":"Kenneth Grahame","Name":"The wind in the willows","Price":"9.90","Description":"In Kenneth Grahame's The Wind in the Willows: A Children's Classic at 100, editors Jackie C. Horne and Donna R. White have assembled a collection of essays that look at the book in terms of class, gender and nationality, as well as its construction of heteronormative masculinity, the very English novel's appeal to Chinese readers, and the meaning of a text in which animals can be human-like, pets, servants, and even food.","Category":{"CategoryName":"Kids Books"}},{"Author":"Tove Jansson","Name":"The Exploits Of Moominpappa: Described By Himself","Price":"19.90","Description":"'I decided to run away. There simply wasn't anything else to do.' Here at last is Moominpappa's promised life story - from the days when he was abandoned in a newspaper parcel on the doorstep of a Moomin orphanage, to when he ran away to see the world and was lucky enough to meet Moominmamma.","Category":{"CategoryName":"Kids Books"}},{"Author":"Beatrix Potter","Name":"Selected Tales Hardback","Price":"16.90","Description":"This is a gift volume with padded cover, featuring four original Beatrix Potter tales, with their classic Beatrix Potter illustrations. It includes \"The Tale of Tom Kitten\", \"The Tale of Mr. Jeremy Fisher\", \"The Tale of Benjamin Bunny\" and \"The Tale of Pigling Bland\".","Category":{"CategoryName":"Kids Books"}},{"Author":"Tove Jansson","Name":"The Exploits Of Moominpappa","Price":"18.90","Description":"'I decided to run away. There simply wasn't anything else to do.' Here at last is Moominpappa's promised life story   from the days when he was abandoned in a newspaper parcel on the doorstep of a Moomin orphanage, to when he ran away to see the world and was lucky enough to meet Moominmamma.","Category":{"CategoryName":"Kids Books"}},{"Author":"STAR WARS Dark Warning  Jude Watson","Name":"Unknown","Price":"9.90","Description":"STAR WARS Dark Warning&nbsp; Jude WatsonObi Wan Kenobi faces another threat in the time after Episode III.","Category":{"CategoryName":"Kids Books"}},{"Author":"Finn Family Moomintroll","Name":"Tove Jansson","Price":"14.90","Description":"Finn Family Moomintroll is the second book in the cult classic Moomin series by Tove Jansson. A must read for adults and children alike. Poor little chap! He had been turned into a very strange animal indeed...Although they're small, fat and shy creatures, Moomins have the most amazing adventures. It all begins when Moominpappa tries on a magic hat that makes exciting and funny things happen...\"They seem to grow in wisdom and delight every time I read them\". Philip Pullman). \"A beautifully strange world, excquisitely illustrated\". Lauren Child). Tove Jansson was born in Finland in 1914. She began her career as a cartoonist and went on to write and illustrate many books for adults and children. She drew her first Moomin in the 1930s, just for fun, and in 1945 he became a character in a children's story. Tove became world famous for her Moomin books, which began with Comet in Moominland in 1946, closely followed by Finn Family Moomintroll. Tove Jansson received many prestigious awards during her lifetime, including the international Hans Christian Andersen Medal. She died in 2001, aged 87.&nbsp;","Category":{"CategoryName":"Kids Books"}},{"Author":"Michelle Magorian","Name":"Puffin Essentials Goodnight Mister Tom","Price":"9.90","Description":"\"Goodnight Mister Tom\" is a \"Puffin Modern Classic\" by Michelle Magorian. Young Willie Beech is evacuated to the country as Britain stands on the brink of the Second World War. A sad, deprived child, he slowly begins to flourish under the care of old Tom Oakley   but his new found happiness is shattered by a summons from his mother back in London...Winner of the Guardian Children's Fiction Award.","Category":{"CategoryName":"Kids Books"}},{"Author":"The Classic Tales Of Beatrix Potter","Name":"Unknown","Price":"24.90","Description":"This is a gift volume with padded cover, featuring four original Beatrix Potter tales, with their classic Beatrix Potter illustrations. It includes \"The Tale of Tom Kitten\", \"The Tale of Mr. Jeremy Fisher\", \"The Tale of Benjamin Bunny\" and \"The Tale of Pigling Bland\".","Category":{"CategoryName":"Kids Books"}},{"Author":"Richard Scarry","Name":"The Bunny Book","Price":"0","Description":"A daddy bunny plays with his baby bunny and says, вЂњWhat will our baby be when he grows up?вЂќ Everyone, from the babyвЂ™s mother to big sister to Great Aunt Bunny, seems to know: a clown, a policeman, a candy store owner. But the baby only nibbles on his carrot and looks wise . . . for he knows he will grow up to be a nice daddy bunny!","Category":{"CategoryName":"Kids Books"}},{"Author":"Astrid Lindgren","Name":"Pippi Longstocking Lauren Child","Price":"0","Description":"For over sixty years, Astrid Lindgren's irrepressible red-haired, freckle-faced Pippi Longstocking has been a favorite of children all over the world. This enchanting edition features an all-new translation by award-winning Tiina Nunnally and full-color illustrations throughout by Lauren Child, creator of Charlie and Lola. Child's pictures are the perfect match for Lindgren's text. \"I discovered Pippi Longstocking when I was eight years old and found her completely inspiring . . . . an entirely free spirit,\" Lauren Child says. With a free-wheeling, playful design, this captivating new edition captures the essence of its beloved heroine.","Category":{"CategoryName":"Kids Books"}},{"Author":"Jez Alborough","Name":"Hug","Price":"0","Description":"A tiny chimp invokes the universal language, uniting his friends in a group hug to end all group hugs. Just try to resist Jez Alborough's latest charmer! Ever feel like you need a hug? A really big hug from someone who loves you? That's how Bobo, the little chimp in this book, feels. Walking through the jungle he passes lots of creatures enjoying a cuddle together: elephants, chameleons, lions, giraffes, hippos - even the snakes have got someone special to squeeze. But poor Bobo is alone. Will he ever find the hug he needs? Using only the single word \"hug\" throughout the book, this simple, endearing story is told through Jez Alborough's gorgeous, detailed artwork.","Category":{"CategoryName":"Kids Books"}},{"Author":"Richard Scarry","Name":"What do people do all day","Price":"0","Description":"An illustrated panorama of the animals of Busytown at work, describing the occupations and activities of many of her citizens through detailed drawings with labels indicating processes and equipment used as they perform their jobs.","Category":{"CategoryName":"Kids Books"}},{"Author":"Tove Jansson","Name":"Moominsummer madness","Price":"0","Description":"When a flood sweeps through the valley, the Moomins must find a new house. And with typical Moomin good luck, one just happens to be floating by. It looks normal enough, but there are curtains where one wall should be, strange rows of lights, and other odd amenities. Then Moomintroll and the Snork Maiden disappear, and the family realize that the house may hold the answers to more than they ever dreamed.","Category":{"CategoryName":"Kids Books"}},{"Author":"Emma Chichester Clark","Name":"Alice in Wonderland","Price":"0","Description":"Step into the magical world of Wonderland in this retelling of Lewis Carroll's enduring classic. When Alice follows a white rabbit down a hole she discovers the extraordinary world of Wonderland. It's not long before Alice finds herself attending an unconventional tea party and taking part in a peculiar game of croquet.","Category":{"CategoryName":"Kids Books"}},{"Author":"Tove Jansson","Name":"Moominland Midwinter","Price":"0","Description":"'This is snow,' Moomintroll whispered to himself. Moomins always sleep through the winter - or they did until the year Moomintroll woke up and went exploring in the silent, snow-covered valley where the river used to scuttle along and all his friends were so busy in summer.","Category":{"CategoryName":"Kids Books"}},{"Author":"Lewis Carroll","Name":"The Complete Stories And Poems Of Lewis Carroll","Price":"0","Description":"This commemorative oversized volume of the complete collection of stories and poems of Lewis Carol showcases his ingenious use of word play, inverted logic and satire. Lewis Carroll was the pen name and, it could be claimed, the alter ego of the Reverend Charles Lutwidge Dodgson, a mathematician, writer and photographer. His creations, especially \"Alice's Adventures in Wonderland\" and \"Through the Looking Glass and What Alice Found There,\" have been translated into countless languages and are as loved now as they have ever been. His neologisms (\"curiouser and curiouser\") and turns of phrase have forever infiltrated and enriched our language and culture.","Category":{"CategoryName":"Kids Books"}},{"Author":"Jude Watson","Name":"Star Wars Death On Naboo","Price":"0","Description":"Ferus Olin's allegiance is to the Jedi. But when he's summoned to see the Emperor, the Sith Lord makes him an offer he can't refuse. If he can manage to prevent a planet from plunging into chaos, the Empire will spare Ferus's captured friends. And if he doesn't . . . they'll die. Another heart stopping Jedi adventure from bestselling author Jude Watson.&lt;/div&gt;","Category":{"CategoryName":"Kids Books"}}]