[{"Author":"Colm Toibin","Name":"Brooklyn","Price":"12.90","Description":"Eilis Lacey has come of age in small-town Ireland in the hard years following World War Two. When an Irish priest from Brooklyn offers to sponsor Eilis in America -- to live and work in a Brooklyn neighborhood \"just like Ireland\" -- she decides she must go, leaving her fragile mother and her charismatic sister behind.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Tracy Chevalier","Name":"Falling angels","Price":"12.90","Description":"A welcome return to a writer whose last book, the much loved and admired Girl With a Pearl Earring has been such an outstanding success. 1901, the year of the Queen's death. The two graves stood next to each other, both beautifully decorated. One had a large urn -- some might say ridiculously large -- and the other, almost leaning over the first, an angel -- some might say overly sentimental. The two families visiting the cemetery to view their respective neighbouring graves were divided even more by social class than by taste.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Kathryn Heyman","Name":"Keep Your Hands On The Wheel","Price":"7.90","Description":"Marah and Charis have left Australia to pursue very different careers. Marah, a trainee opera diva, tries hard to keep her weight, her life, her self under control; Charis works nights as a telegram girl, zooming across London on her motorbike dressed as a French maid or a pregnant bride.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Walter Mosley","Name":"Little Scarlet","Price":"13.90","Description":"Just after devastating riots tear through Los Angeles in 1965 the police turn up at Easy Rawlin's doorstep to ask for his help. A man was wrenched from his car by a mob at the riots' peak and escaped into a nearby apartment building. Soon afterward, a redheaded woman known as Little Scarlet was found dead in that building - and the fleeing man is the obvious suspect. But the man has vanished. The police fear that their presence in certain neighbourhoods could spark a new inferno, so they ask Easy Rawlins to see what he can discover. The vanished man is the key, but he is only the beginning. Rawlins's hunt for the killer reveals a new city emerging from the ashes. Mosley's lean and musical vernacular captures the heat and the rhythm of Los Angeles' heart, where danger is the common currency of everyday life. Little Scarlet is further proof that Mosley is 'a master of mystery' (New York Times Book Review).","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Alice Walker","Name":"The colour purple","Price":"12.90","Description":"The Color Purple&nbsp;is a 1982 epistolary novel by American author Alice Walker which won the 1983 Pulitzer Prize for Fiction and the National Book Award for Fiction. It was later adapted into a film and musical of the same name.Taking place mostly in rural Georgia, the story focuses on the life of women of color in the southern United States in the 1930s, addressing numerous issues including their exceedingly low position in American social culture. The novel has been the frequent target of censors and appears on the American Library Association list of the 100 Most Frequently Challenged Books of 2000-2009 at number seventeen because of the sometimes explicit content, particularly in terms of violence.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"The World According To Garp","Price":"12.90","Description":"This is the life and times of T. S. Garp, the bastard son of Jenny Fields--a feminist leader ahead of her times. This is the life and death of a famous mother and her almost-famous son; theirs is a world of sexual extremes--even of sexual assassinations. It is a novel rich with \"lunacy and sorrow\"; yet the dark, violent events of the story do not undermine a comedy both ribald and robust. In more than thirty languages, in more than forty countries--with more than ten million copies in print--this novel provides almost cheerful, even hilarious evidence of its famous last line: \"In the world according to Garp, we are all terminal cases.\"","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Laura Zigman","Name":"Dating Big Bird","Price":"7.90","Description":"Dating Big BirdEllen Franck and Marian Abrams are smart, attractive, urban women, with big jobs in the fashion business. They have witnessed their contemporaries following the route of marriage, children, exile to suburbia, and a general loveless, sexless existence. But now Ellen and Marian discover that they both hear the same, terrible noise. It is the ticking of the biological clock.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Linda Taylor","Name":"Of Love And Life","Price":"7.90","Description":"Of love and life: Three novels selected and condensed by Reader's Digest","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Cathy Kelly","Name":"Someone Like You","Price":"7.90","Description":"Someone Like YouFrom the author of the bestselling Just Between Us comes this warm and funny novel about the importance of female friendship. EMMA, HANNAH AND LEONIE Three very different women meet on holiday and become close friends. Each is at a different stage in life and has different ambitions. Hannah -- young and beautiful, wants to forget the man who betrayed her and throw herself into the excitement of the single life -- but is she deceiving herself? Emma -- two years married and desperate to have a baby. But what kind of parent would she be when she still allows herself to be bullied by her own parents? Leonie -- generously proportioned and big-hearted. Can there ever be romance for her, after fast growing-up teenaged children and a divorce? Over the next few years, as they work out their needs and desires and come to terms with their situations, their lives become inextricably entwined.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Wendy Holden","Name":"Pastures Nouveaux","Price":"7.90","Description":"Pastures NouveauxFrom SW7 to rural heaven...Cash-strapped Rosie and her boyfriend Mark are city folk longing for a country cottage. Rampantly nouveaux-riches Samantha and Guy are also searching for rustic bliss - a mansion complete with mile-long drive and hot and cold running gardeners. The village of Eight Mile Bottom seems quiet enough, despite a nosy postman, a reclusive rock star, a glamorous Bond Girl and a ghost with a knife in its back. But there are unexpected thrills in the hills. The local siren seduces Guy while a farmer fatale rocks Rosie's relationship. Then a mysterious millionaire makes an offer she can't refuse. But should she?","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Helen Fielding","Name":"Bridget Jones's Diary","Price":"12.90","Description":"Bridget Jones's DiaryWith an introduction by&nbsp;Caitlin Moran&nbsp;A dazzling urban satire of modern relationships? An ironic, tragic insight into the demise of the nuclear family? Or the confused ramblings of a pissed thirty-something?As Bridget documents her struggles through the social minefield of her thirties and tries to weigh up the eternal question (Daniel Cleaver or Mark Darcy?), she turns for support to four indispensable friends: Shazzer, Jude, Tom and a bottle of chardonnay.Bridget Jones's Diary&nbsp;was first published in 1996 and applauded by critics from Salman Rushdie to Jilly Cooper. A number-one bestseller, Helen Fielding's book has sold over fifteen million copies worldwide and has been turned into an&nbsp;Academy Award-nominated film starring Renee Zellweger, Colin Firth and Hugh Grant. Bridget Jones's Diary is followed by Bridget Jones: The Edge of Reason and Bridget Jones: Mad About the Boy.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Katie Fforde","Name":"Wild Designs","Price":"7.90","Description":"Wild DesignsAfter losing her job, Althea decides to develop her passion for gardening. When she wins the opportunity to design a garden at the Chelsea Flower Show - with the unexpected help of gorgeous architect Patrick Donahugh - it looks as though she may have unearthed a new man as well as a new career.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Barbara Wood","Name":"Perfect Harmony","Price":"5.90","Description":"Perfect HarmonyIt is the 1920s and Mei-Ling is the daughter of a Chinese mother and American father sent to America when their marriage fails. The successful business she starts is run in the 1990s by Charlotte who, with her childhood friend, Jonathan, uncovers a family secret going back to Mei-Ling.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Owen Whittaker","Name":"A Little Trouper","Price":"5.90","Description":"A Little TrouperWhen jobbing actor Hal Morrissey is offered a lead role in the popular sit com, Bringing Up Ralph, the story of a single mother bringing up her six year old son, he thinks he has died and gone to heaven.Hal's devotion to the acting profession has cost him dearly, but now all his troubles seem to be over. Only trouble is, sweet little butter-wouldn't-melt Sebastian, who plays the part of Ralph, proves to be as obnoxious as he is hostile, and when Hal falls for his real-life mother he does everything he can to sabotage their relationship.Then Hal discovers that the death of the actor whom he's replaced may not be as straightforward as it first seemed ...Is Hal to be the latest victim of a child star too obsessed with his mother to allow anyone else near her?&nbsp;","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Dr. Elizabeth Walker","Name":"Voyage","Price":"5.90","Description":"Voyage","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Penny Vincenzi","Name":"Forbidden Places","Price":"5.90","Description":"Penny Vincenzi's Sunday Times No 1 bestseller, FORBIDDEN PLACES is an unmissable novel about love and marriage, families and secrets, and about wartime and what it does to every accepted social value. 'Deliciously readable' Mail on Sunday.A mesmerising novel perfect for any reader of Jilly Cooper, Santa Montefiore, Kate Morton or Harriet Evans. It is the story of three women and one family. One is married and widowed within five years. She is free to start again. Or is she? The second has a perfect husband she thinks she loves. He becomes a grotesque parody of what he once was. Is that love real? The third becomes trapped in a nightmare marriage. Can the war free her?","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Caroline Upcher","Name":"Grace And Favour","Price":"5.90","Description":"Grace And FavourA mother's tragic death when her first daughter is very small and her second has just been born causes the family to split up. The eldest, Grace, is fostered and dubs the younger one \"Favour\", imagining her to have been her mother's favourite. Now, they meet up as grown women for the first time.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Joanna Trollope","Name":"The Men And The Girls","Price":"5.90","Description":"The Men And The GirlsLifelong friends, now in their 60s, James and Hugh consider themselves to be very lucky to be living with attractive women 25 years their junior. All seems well until the appearance of Miss Beatrice Bachelor, a razor sharp Oxford spinster, who fuels the discontent of both women with their lives.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Sheila O'Flanagan","Name":"Caroline's Sister","Price":"5.90","Description":"CAROLINE'S SISTER by No. 1 bestselling author Sheila O'Flanagan is an unforgettable tale of family ties, secrets and surprises - not to be missed by readers of Veronica Henry and Freya North. To her younger sister, Tessa, Caroline O'Shaughnessy seems to have everything - great looks, easy charm, and the distinctly desirable Damien Woods. But for Caroline, things don't feel quite so rosy. She'd dreamed about moving in with Damien, but not about having his child, just yet. And though he did the honourable thing when she told him she was pregnant, it obviously wasn't what he wanted either. And as both of them struggle to make the best of a bad job, neither is prepared for the impact a moment of drunken indiscretion will have not just on their lives but on Tessa's too...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Freya North","Name":"Chloe","Price":"5.90","Description":"ChloeShe wanted a man in her life. Now she has four. It was her godmother's last wish...How could she possibly say no? When Chloe Cadwallader's beloved godmother Jocelyn dies, she leaves her a letter instructing her to give up her job (rubbish) and her boyfriend (ditto) to travel the four countries of the United Kingdom during the four seasons of the year.Clutching a letter marked 'Wales', Chloe ventures to a farm deep in the Black Mountains where she comes across the best looking man she's ever laid eyes on. And as the seasons unfold, so too does Chloe's journey. From Abergavenny to St Ives, from the Giant's Causeway to the shores of Loch Lomond, join her as she discovers love, lust, life - and, just possibly, a man for all seasons.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Judith Michael","Name":"A Certain Smile","Price":"5.90","Description":"A Certain SmileMiranda Graham, a clothing designer and the widowed mother of two teenagers, is sent by her company to China to meet with officials at the factory manufacturing her designs. On her arrival, overwhelmed by the foreignness of China for which she was unprepared, she meets Yuan Li, a builder, the son of a Chinese mother and an American soldier, and himself a widowed father.Li helps her, giving her an introduction to China and helping her to get her bearings. What at first is a friendship based on mutual curiosity soon blossoms into a passionate love affair that bridges the cultural divide between them. Li and Miranda spend all of their spare time alone together, lost in their love. Soon, however, the political and cultural realities intrude upon their idyllic relationship, and Miranda and Li must face the future and a relationship made impossible by everything but love.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Juliette Mead","Name":"Healing Flynn","Price":"5.90","Description":"Healing FlynnA stunningly powerful novel of love and suffering from the acclaimed author of SENTIMENTAL JOURNEY and CHARLOTTE STREET. At a terrible moment of high drama, with a fire on a North Sea oil rig, Madeline Light, a trauma therapist, is flown in by helicopter to give immediate aid to survivors and their families. Posing as an oil company official, Flynn Brennan, a photo-journalist specialising in war and disaster, usues her to gain passage onto the rig to take photographs of the aftermath. Three months later, with his marriage almost in tatters, and showing the early signs of Post Traumatic Stress Syndrome, Brennan doorsteps the therapist and persuades her to take him on as a client. He comes across as hard-bitten and provocative, but despite herself and her own steady but untimately barren relationship with the sculptor Patrick, Madeline finds herself irresistibly drawn to him. During the progress of his therapy and of their relationship, Flynn is finally restored to himself and Madeline healed of her own secret trauma. Like THE HORSE WHISPERER, THE DEEP END OF THE OCEAN and THE PRINCE OF TIDES, HEALING FLYNN works at several levels -- as an emotionally impactful love story; an incisive analysis of human relationships, and as a wise novel about the nature of tragedy, suffering and healing.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Carole Matthews","Name":"Welcome To The Real World","Price":"5.90","Description":"Welcome To The Real WorldFern has the voice of an angel but as an underpaid barmaid and pub singer, she's going nowhere fast. Then she enters the TV talent show Fame Game and this could be her big break. But then, things are never that simple. Evan David's exquisite tones have enthralled opera buffs throughout the world. Everyone around him panders to his every need but what he really needs now is a break - from everything. Two worlds collide when Fern becomes Evan's assistant and neither is prepared for the dramatic effect they have on each other. Something happens when they're together, and it's more than just music ...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Jill Mansell","Name":"Staying At Daisy's","Price":"5.90","Description":"Staying At Daisy'sSTAYING AT DAISY'S from&nbsp;Sunday Times bestselling author Jill Mansell&nbsp;is essential reading if you love the novels of Cathy Kelly and Milly Johnson. Daisy MacLean runs the country house hotel owned by her flamboyant father, Hector. When she hears who's about to get married there, she isn't worried at all - her friend Tara absolutely promises there won't be any trouble between her and ex-boyfriend Dominic, whom she hasn't seen for years. But Dominic has other ideas...Meanwhile, Hector's getting up to all sorts with...well, that's the village's best kept secret. And then Barney turns up, with a little something belonging to the husband Daisy's been doing her best to forget. That's the thing about hotels, you never know who you're going to meet. Or whether they're going to stay...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Josie Lloyd","Name":"The Boy Next Door","Price":"5.90","Description":"The Boy Next DoorAs the 1980's dawn in the sleepy English village of Rushton, Mickey and Fred are next-door neighbours and best friends, in and out of scrapes from the day they're born. They're convinced that nothing will ever keep them apart, but they're wrong.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Julia Llewellyn","Name":"If I Were You","Price":"5.90","Description":"If I Were YouMy name is Natasha I have a successful career A gorgeous penthouse flat Trouble is, I'm in love with a man who already has a girlfriend My name is Sophie I have a man I love He's gorgeous and we've been together four years Trouble is, he won't propose Natasha and Sophie met when they were eleven and rapidly became best friends.Natasha was always the more intelligent and Sophie the more beautiful, but it never came between them ...until now. Suddenly the tiny, niggling, inescapable fact of their envy for each other's life is trying to surface and a number of casualties are getting caught in the crossfire. Is a fading love worth clinging to at all costs? Is marriage the be-all-and-end-all? And can an affair ever be fulfilling?Natasha and Sophie need to learn that they might be hunting for happiness in all the wrong places ...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Judith Lennox","Name":"Written On Glass","Price":"5.90","Description":"Written On GlassIt is 1946 and the old families of the Temperleys and the Chancellors have been neighbours on the South Coast of England for many years. Now, the younger generation has been touched by the second world war.Reserved, principled and cool-headed Marius Temperley has left the army and is struggling to fit into civilian life. His twenty-one year old sister, Julia, is quick-tempered, proud and passionate and, since her father's recent death, has been running the family business, fiercely independent in her ambitions.Handsome, but emotionally distant Jack Chancellor has been demobbed and has another problem to face. Both he and his younger, more naive and impetuous brother Will, are in love with Julia. Jack doesn't want to lose her, but his sweet, slightly gawky cousin, Topaz, lets slip that their imperious Aunt Carrie has a plan for him: if he leaves Julia, he will inherit Sixfields, the beautiful family farm...As the years go by, the family secrets come out, and it seems that the ties that bind can change relationships for ever...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Louise Harwood","Name":"Six Reasons To Stay A Virgin","Price":"5.90","Description":"Six Reasons To Stay A VirginEmily refuses to sleep with anyone while she's looking for Mr Right. Because of this, Emily is the most irritating person Caitlin knows. More than anything, Caitlin would love to prove to Emily how wrong she is and how she's missing out on the best years of her life. And Caitlin's got a pretty good idea who Emily's Mr Right is too. What could possibly be wrong in getting the two of them together? But is he Emily's Mr Right, or Caitlin's? And does it matter if Caitlin is wrong? As the scheming starts to work and Emily finally begins talking the language of love, it's Caitlin rather than Emily who can think of at least six reasons to stay a virgin ...Light hearted, liberating and wonderfully romantic, \"Six Reasons\" is serious about sex - and no sex - about having principles and falling in lust and what it is that we're waiting for.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Stella Chaplin","Name":"It's A Wrap","Price":"5.90","Description":"It's A WrapRelationships are like making movies - the trick is knowing when to shout 'cut'...Brighton - summer. The setting for the budget British gangster movie that director Ben Lincoln is praying will launch his career. He's pinning his hopes on former pop icon Danny Parker and Emma Buckley, a struggling young actress who's had to stretch the truth just a little to snatch her first big break. Meanwhile, behind the scenes, costume designer Liz Thorne bides her time, waiting for the moment to make her move on the man who broke her heart six years ago. And this time nothing is going to stand in her way, not the cast, not the crew and certainly not the clause in every contract that states: sex on location doesn't count. Capturing the organised mayhem of a film crew playing away from home,&nbsp;IT'S A WRAP&nbsp;is a hilarious, unputdownable tale of love, lies and celluoid from the superb Stella Chaplin.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Sarah Challis","Name":"Blackthorn Winter","Price":"5.90","Description":"Blackthorn WinterIn April, when blackthorn blossom clothes the hedgerows like a wedding veil, there sometimes comes a spell of frost or snow so severe that it seems as if spring and summer will never return. This is what country people call a blackthorn winter. For Claudia Barron, the blackthorn winter of that particular April is like a metaphor for her whole life: for the end of glamour, financial security and marriage. Her rich and powerful husband has been sent to prison, leaving her homeless and virtually penniless. Hopeless to cling to the remnants of her old life, pointless to stand by a man who has betrayed her in almost every way a man can betray a woman. Instead she goes into hiding, buys the only house she can afford in the Dorset village of Court Barton - a hideous bungalow built in an old kitchen garden - and changes her name. Under a cloak of anonymity she sets out to get herself a job in the local school. But villages don't much like anonymity and before very long Claudia finds herself drawn into the gossip and the grumbling, the lives and loves and quarrels of Court Barton in a way that she had never expected. Blackthorn winters do always give way to spring in the end.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Barbara Taylor Bradford","Name":"Act Of Will","Price":"5.90","Description":"Act Of WillThree generations of beautiful women and their journey from rags to riches. Audra is an impoverished children's nanny from Leeds who sacrificed everything for her only daughter.Christina is a talented art student who won world renown as a fashion designer -- yet who has known pain and heartache. Kyle is a rebellious young woman who chafes against her mother's success -- and in whom her grandmother's spirit of duty and sacrifice is reborn.Moving from the bleak Yorkshire Dales, through London, to the glamorous world of haute couture,&nbsp;Act of Will&nbsp;sparkles as it entertains.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Charlotte Bingham","Name":"Summertime","Price":"5.90","Description":"SummertimeWhen Trilby meets Lewis, the all-powerful proprietor of a newspaper group, she suspects that her life might be about to change, but not, as it happens, forever. For not only does Lewis wish to acquire her cartoon strip, but also Trilby herself.Trilby is inevitably drawn to this handsome, older, and far more sophisticated personality, just as Lewis is, from the outset, determined to marry Trilby, despite opposition. But Trilby finds that once they return home from their honeymoon, Lewis starts to change, revealing himself to be insanely possessive.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Dominic Hobson","Name":"The Pride Of Lucifer","Price":"7.90","Description":"The Pride Of LuciferWhen Morgan Grenfell was floated on the London Stock Exchange in June 1986, enough money was pledged to buy the shares on offer nearly five times over. It was an astonishing vote of confidence in a bank that had in the previous five years more than doubled its size and quadrupled its profits. By Christmas of the same year Morgan Greenfell had fallen like Lucifer.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"Trying To Save Piggy Sneed","Price":"12.90","Description":"Trying to Save Piggy SneedTrying to Save Piggy Sneed&nbsp;contains a dozen short works by John Irving, beginning with three memoirs, including an account of Mr. Irving's dinner with President Ronald Reagan at the White House. The longest of the memoirs, The Imaginary Girlfriend, is the core of this collection.The middle section of the book is fiction. Since the publication of his first novel,&nbsp;Setting Free the Bears, in 1968,&nbsp;John Irving&nbsp;has written 12 more novels but only half a dozen stories that he considers finished: they are all published here, including Interiors, which won the&nbsp;O. Henry Award. In the third and final section are three essays of appreciation: one on GГјnter Grass, two on Charles Dickens.To each of the 12 pieces, Mr. Irving has contributed his Author's Notes. These notes provide some perspective on the circumstances surrounding the writing of each pieceвЂ”for example, an election-year diary of the Bush-Clinton campaigns accompanies Mr. Irving's memoir of his dinner with President Reagan; and the notes to one of his short stories explain that the story was presented and sold to&nbsp;Playboy&nbsp;as the work of a woman.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Janice Y.K. Lee","Name":"The Piano Teacher","Price":"11.90","Description":"The Piano TeacherAmbitious, exotic, and a classic book club read,&nbsp;'The Piano Teacher'&nbsp;is a combination of 'Tenko'&nbsp;meets&nbsp;'The Remains of the Day'. Sometimes the end of a love affair is only the beginning...In 1942, Will Truesdale, an Englishman newly arrived in Hong Kong, falls headlong into a passionate relationship with Trudy Liang, a beautiful Eurasian socialite.But their love affair is soon threatened by the invasion of the Japanese, with terrible consequences for both of them, and for members of their fragile community who will betray each other in the darkest days of the war.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J G Ballard","Name":"Cocaine Nights","Price":"11.90","Description":"Snort up \"Cocaine Nights\". It's disorientating, deranging and knocks the work of other avant-garde writers into a hatted cock' Will Self Five people die in an unexplained house fire in the Spanish resort of Estrella de Mar, an exclusive enclave for the rich, retired British, centred on the thriving Club Nautico. The club manager, Frank Prentice, pleads guilty to charges of murder - yet not even the police believe him. When his Charles arrives to unravel the truth, he gradually discovers that behind the resort's civilized facade flourishes a secret world of crime, drugs and illicit sex","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"Until I find you","Price":"17.90","Description":"Until I Find You is the story of the actor Jack Burns. His mother, Alice, is a Toronto tattoo artist. His father, William, is an Edinburgh organist who is addicted to being tattooed. When Jack is four, he travels with Alice to several North Sea ports - Copenhagen, Stockholm, Oslo, Helsinki, and Amsterdam, in search of his father, who is missing. But Alice is a mystery, and William can't be found. Even Jack's memories are subject to doubt. Jack Burns goes to schools in Canada and New England, but what shapes him are his relationships with older women. Mr Irving renders Jack's life as an actor in Hollywood with the same richness of detail and range of emotions he uses to describe the tattoo parlours in those North Sea ports and the reverberating music Jack heard as a child in European churches.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Alexander McCall Smith","Name":"The Lost Art Of Gratitude","Price":"11.90","Description":"Isabel and her son, Charlie, attend a birthday party, where she finds Minty Auchterlonie, the high-flying financier from \"The Sunday Philosophy Club.\" When Minty confides to Isabel about the troubles at the investment bank she heads, Isabel wonders if Minty can be trusted.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Simmone Howell","Name":"Notes From The Teenage Underground","Price":"11.90","Description":"Taking their anti-social edge one step further, seventeen year old Gem and her friends Mira and Lo have decided to go 'underground'. Their activities will be 'extreme', 'anti-establishment', 'avant-garde' and 'debauched'. While Gem makes an underground film and Mira sets about pursuing 'boys-without-barcodes' no one knows what it is that Lo - the most subversive of the three - has planned. But in the back of her mind, Gem's worried.She feels the balance of the trio's friendship is always weighted against her. And as the weeks draw closer to Christmas, appearances start to deceive and relationships flounder. For all the promise of the group, Underground seems a dark place to be. It will take great films, bad poetry and a pantheon of inspirational guides - from Andy Warhol to Germaine Greer - to help Gem work out the true meaning of friendship, where family fits in, and that the best parts of life aren't always underground.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Chuck Palahniuk","Name":"Rant","Price":"15.90","Description":"In this fictional oral history, Buster RRantS Casey's friends, enemies, admirers, detractors, and relations have their say about him--an evil character who may or may not be the most efficient serial killer of our time.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"The Imaginary Girlfriend","Price":"12.90","Description":"\"The Imaginary Girlfriend\" is a candid memoir of the writers and wrestlers who played a role in John Irving's development as a novelist and as a wrestler. It also portrays a father's dedication--Irving coached his two sons to championship titles. It is an illuminating, concise work, a literary treasure.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Ben Okri","Name":"The famished road","Price":"12.90","Description":"Azaro is a spirit child who is born only to live for a short while before returning to the idyllic world of his spirit companions. Now he has chosen to stay in the world of the living.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J.M. Coetzee","Name":"Slow Man","Price":"11.90","Description":"A calamitous cycling accident results in the amputation of Paul Rayment's leg. His feelings for his nurse, and for her handsome teenage son, are complicated by the sudden arrival on his doorstep of the celebrated Australian novelist Elizabeth Costello, who threatens to take over the direction of his life and the affairs of his heart.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Margaret Atwood","Name":"The Blind Assassin","Price":"12.90","Description":"Ten days after the war ended, my sister Laura drove a car off a bridge. Thus begins The Blind Assassin, Margaret Atwood's Booker Prize-winning novel. Laura Chase's older sister Iris, married at eighteen to a politically prominent Industrialist but now poor and eighty-two, is living in Port Ticonderoga, a town dominated by their once-prosperous family before the First War. While coping with her unreliable body, Iris reflects on her far from exemplary life, in particular the events surrounding her sister's tragic death.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Khaled Hosseini","Name":"The Kite Runner","Price":"11.90","Description":"This is the remarkable debut novel from Khaled Hosseini. Twelve year old Amir is desperate to win the approval of his father Baba, one of the richest and most respected merchants in Kabul. He has failed to do so through academia or brawn, but the one area where they connect is the annual kite fighting tournament. Amir is determined not just to win the competition but to run the last kite and bring it home triumphantly, to prove to his father that he has the makings of a man. His loyal friend Hassan is the best kite runner that Amir has ever seen, and he promises to help him - for Hassan always helps Amir out of trouble. But, Hassan is a Shi'a Muslim and this is 1970s Afghanistan.Hassan is taunted and jeered at by Amir's school friends; he is merely a servant living in a shack at the back of Amir's house.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Peter Mayle","Name":"A Year In Provence","Price":"11.90","Description":"Peter Mayle's A Year in Provence is the much-loved account of an English couple living their dream abroad. When they buy a 200-year-old farmhouse in the South of France, Peter Mayle and his wife little expect the delights that await them - from six-course lunches and epic games of boule, to encounters with charming but unpredictable builders. Both witty and affectionate, this is an idyllic portrait of the pleasures of rural life.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"James Graham Ballard","Name":"Kingdom Come","Price":"11.90","Description":"This is a new masterpiece of fiction from J. G. Ballard which asks, could Consumerism turn into Facism? Richard Pearson, unemployed advertising executive and life-long rebel, is driving out to Brooklands, a motorway town on the M25. A few weeks earlier his father was fatally wounded at the Metro-Centre, a vast shopping mall in the centre of this apparently peaceful town, when a deranged mental patient opened fire on a crowd of shoppers. When the main suspect is released without charge thanks to the dubious testimony of self-styled pillars of the community - including Julia Goodwin, the doctor who treated his father on his deathbed - Richard suspects that there is more to his father's death than meets the eye, a more sinister element lurking behind the pristine facades of the labyrinthine mall.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J.M. Coetzee","Name":"In The Heart Of The Country","Price":"12.90","Description":"A novel set in colonial South Africa, where a lonely sheepfarmer makes a bid for private salvation in the arms of a black concubine, while his daughter dreams of and executes a bloody revenge. From the author of DUSKLANDS and WAITING FOR THE BARBARIANS.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J.G. Ballard","Name":"Cocaine Nights","Price":"11.90","Description":"'Snort up \"Cocaine Nights\". It's disorientating, deranging and knocks the work of other avant-garde writers into a hatted cock' Will Self Five people die in an unexplained house fire in the Spanish resort of Estrella de Mar, an exclusive enclave for the rich, retired British, centred on the thriving Club Nautico. The club manager, Frank Prentice, pleads guilty to charges of murder - yet not even the police believe him. When his Charles arrives to unravel the truth, he gradually discovers that behind the resort's civilized facade flourishes a secret world of crime, drugs and illicit sex. At once an engrossing mystery and a novel of ideas, 'Cocaine Nights' is a stunningly original work, a vision of a society coming to terms with a life of almost unlimited leisure.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J.M. Coetzee","Name":"Youth","Price":"11.90","Description":"From the Booker Prize-winning author of \"Disgrace\" comes a second volume of memoir that \"proves yet again that the awkward young man did indeed become a 'real artist'\"--\"The Wall Street Journal.\"","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Susan Kaminsky","Name":"Talent","Price":"5.90","Description":"Fresh out of law school, Allison Morton joins the top firm in the glittering world of showbiz, where stakes are high. Soon they will be higher still. A ruthless corporate raider wants Allison's company, a fiery young playwright wants her heart - and somebody out there wants her dead.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Anna Godbersen","Name":"Rumours: A Luxe Novel","Price":"5.90","Description":"December 1899 - New York City Manhattan has bid farewell to its brightest star, the dazzling Miss Holland. Yet the rumors about her untimely demise continue. Meanwhile, her sister, the irrepressible Diana, has been seen in the company of not one, but three eligible bachelors. Might there be a fourth? In High Society reputation is everything. The Holland family simply can't afford to be the subject of such wicked whispers. Heaven forbid that they should fall so spectacularly from grace...There is a very fine line between truth and love, lies and hate. And all is about to be gloriously revealed.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Sheila Flanagan","Name":"Too Good To Be True","Price":"5.90","Description":"Sheila O'Flanagan's bestseller TOO GOOD TO BE TRUE is a brilliant, feel-good read about love, marriage and what comes next, perfect for readers of Freya North and Catherine Alliott. When Carey Browne decides it's time for a holiday and flies into New York City - one of her favourite shopping destinations - she knows she'll have a good time. What she doesn't know is that she's about to have the biggest adventure of her life. Within days she's met and married Ben Russell, and a week later they're heading back together to Dublin, where they both live, to share the happy news with family and friends. Except not everyone's thrilled. And not everyone's convinced this is really more than a holiday romance. Carey and Ben are about to discover whether they've found the kind of love that can survive a blast of reality...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Guillermo Martinez","Name":"The Oxford Murders","Price":"9.90","Description":"On a balmy summer's day in Oxford an old lady who once helped decipher the Enigma Code is killed. After receiving a cryptic anonymous note containing only the address and the symbol of a circle, Arthur Seldom, a leading mathematician, arrives to find the body. Then follow more murders - an elderly man on a life-support machine is found dead with needle marks in this throat; the percussionist of an orchestra at a concert at Blenheim Palace dies before the audience's very eyes - seemingly unconnected except for notes appearing in the maths department, for the attention of Seldom.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Svetlana Alexievich","Name":"Second-hand time","Price":"39.90","Description":"Second-hand Time is the latest work from Svetlana Alexievich, winner of the 2015 Nobel Prize in Literature for inventing 'a new kind of literary genre'. Here she brings together the voices of dozens of witnesses to the collapse of the USSR in a formidable attempt to chart the disappearance of a culture and to surmise what new kind of man may emerge from the rubble. Fashioning a singular, polyphonic literary form by combining extended individual monologues with a collage of voices, Alexievich creates a magnificent requiem to a civilization in ruins, a brilliant, poignant and unique portrait of post-Soviet society out of the stories of ordinary women and men.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Scott Lynch","Name":"The lies of Locke Lamora","Price":"23.90","Description":"They say that the Thorn of Camorr can beat anyone in a fight. They say he steals from the rich and gives to the poor. They say he's part man, part myth, and mostly street-corner rumor. And they are wrong on every count. Only averagely tall, slender, and god-awful with a sword, Locke Lamora is the fabled Thorn, and the greatest weapons at his disposal are his wit and cunning. He steals from the rich - they're the only ones worth stealing from - but the poor can go steal for themselves. What Locke cons, wheedles and tricks into his possession is strictly for him and his band of fellow con-artists and thieves: the Gentleman Bastards. Together their domain is the city of Camorr.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Waterland","Name":"Graham Swift","Price":"11.90","Description":"'Perfectly controlled, superbly written. Waterland is original, compelling and narration of the highest order' Guardian In the years since its first publication, in 1983, Waterland has established itself as one of the classics of twentieth century British literature: a visionary tale of England's Fen country; a sinuous meditation on the workings of history; and a family story startling in its detail and universal in its reach. This edition includes an introduction, by the author, written to celebrate the book's 25th anniversary. 'Graham Swift has mapped his Waterland like a new Wessex. He appropriates the Fens as Moby Dick did whaling or Wuthering Heights the moors. This is a beautiful, serious and intelligent novel, admirably ambitious and original' Observer 'A 300 page tour de force ...A burst of exuberant fictive energy' Evening Standard 'Waterland is a formidably intelligent book, animated by an impressive, angry pity at what human creatures are capable of doing to one another in the name of love and need. The most powerful novel I have read for some time' New York Review of Books","Category":{"CategoryName":"Modern Fiction"}},{"Author":"E M Forster","Name":"A room with a view","Price":"12.90","Description":"Lucy has her rigid, middle-class life mapped out for her until she visits Florence with her uptight cousin Charlotte, and finds her neatly ordered existence thrown off balance. Her eyes are opened by the unconventional characters she meets at the Pension Bertolini: flamboyant romantic novelist Eleanor Lavish, the Cockney Signora, curious Mr Emerson and, most of all, his passionate son George.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J.M. Coetzee","Name":"Life &amp; Times Of Michael K","Price":"11.90","Description":"Set during a fictional civil war in South Africa, this book is symbolic that apartheid created in the lives of those so brutally affected by its implementation.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"David Mitchell","Name":"Ghostwritten","Price":"11.90","Description":"A magnificent achievement and an engrossing experience, David Mitchell's first novel announced the arrival of one of the most exciting writers of the twenty-first century. An apocalyptic cult member carries out a gas attack on a rush-hour metro, but what links him to a jazz buff in downtown Tokyo? Or to a Mongolian gangster, a woman on a holy mountain who talks to a tree, and a late night New York DJ? Set at the fugitive edges of Asia and Europe, Ghostwritten weaves together a host of characters, their interconnected destinies determined by the inescapable forces of cause and effect.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Dodie Smith","Name":"I capture the castle","Price":"12.90","Description":"\"I write this sitting in the kitchen sink. That is, my feet are in it; the rest of me is on the draining-board, which I have padded with our dog's blanket and the tea-cosy\". This is the diary of Cassandra Mortmain, which tells of her extraordinary family and their crumbling castle home. Cassandra's father was once a famous writer, but now he mainly reads detective novels while his family slide into genteel poverty. Her sister Rose is bored and beautiful, and desperate to marry riches. Their step-mother Topaz has habit of striding through the countryside wearing only her wellington boots. But all their lives will be soon be transformed by the arrival of new neighbours from America, and Cassandra finds herself falling in love...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Howard Jacobson","Name":"The Finkler question","Price":"11.90","Description":"'He should have seen it coming. His life had been one mishap after another. So he should have been prepared for this one...' Julian Treslove, a professionally unspectacular former BBC radio producer, and Sam Finkler, a popular Jewish philosopher, writer and television personality, are old school friends. Despite a prickly relationship and very different lives, they've never quite lost touch with each other - or with their former teacher, Libor Sevcik, a Czech always more concerned with the wider world than with exam results. Now, both Libor and Finkler are recently widowed, and with Treslove, his chequered and unsuccessful record with women rendering him an honorary third widower, they dine at Libor's grand, central London apartment. It's a sweetly painful evening of reminiscence in which all three remove themselves to a time before they had loved and lost; a time before they had fathered children, before the devastation of separations, before they had prized anything greatly enough to fear the loss of it.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Michel Houellebecq","Name":"Whatever","Price":"12.90","Description":"Just thirty, with a well-paid job, no love life and a terrible attitude, the anti-hero of this grim, funny novel smokes four packs of cigarettes a day and writes weird animal stories in his spare time. A computer programmer by day, he is tolerably content, until he's packed off with a colleague - the sexually-frustrated Raphael Tisserand - to train provincial civil servants in the use of a new computer system Houellebecq's first novel was a smash hit in France, expressing the misanthropic voice of a generation. Like A Confederacy of Dunces, Houellebecq's bitter, sarcastic and exasperated narrator vociferously expresses his frustration and disgust with the world.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Augusten Burroughs","Name":"Running with scissors","Price":"11.90","Description":"'This is the Brady Bunch on Viagra...it is impossible not to laugh at all the jokes; to admire the sardonic, fetid tone; to wonder, slack-jawed and agog, at the sheer looniness of the vista he conjures up' Rachel Cooke, Observer This is the true story of a boy who wanted to grow up with the Brady Bunch, but ended up living with the Addams Family. Augusten Burroughs's mother gave him away to be raised by her psychiatrist, a dead ringer for Santa Claus and a certifiable lunatic into the bargain. The doctor's bizarre family, a few patients and a sinister man living in the garden shed completed the tableau. The perfect squalor of their dilapidated Victorian house, there were no rules and there was no school. The Christmas tree stayed up until summer and Valium was chomped down like sweets. And when things got a bit slow, there was always the ancient electroshock therapy machine under the stairs...","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Maya Angelou","Name":"The heart of a woman","Price":"12.90","Description":"Maya Angelou's seven volumes of autobiography are a testament to the talents and resilience of this extraordinary writer. Loving the world, she also knows its cruelty. As a black woman she has known discrimination and extreme poverty, but also hope, joy, achievement and celebration. The fourth volume of her enthralling autobiography finds Maya Angelou immersed in the world of black writers and artists in Harlem, working in the civil rights movement with Martin Luther King. 'She has a great capacity for love, to give, and receive it' Margaret Busby","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Sebastian Barry","Name":"The secret scripture","Price":"14.90","Description":"Nearing her one hundredth birthday, Roseanne McNulty faces an uncertain future, as the Roscommon Regional Mental hospital where she's spent the best part of her adult life prepares for closure. Over the weeks leading up to this upheaval, she talks often with her psychiatrist Dr Grene. This relationship, guarded but trusting after so many years, intensifies and complicates as Dr Grene mourns the death of his wife. Told through their respective journals, the story that emerges - of Roseanne's family in 1930s Sligo - is at once shocking and deeply beautiful. Refracted through the haze of memory and retelling, Roseanne's story becomes an alternative, secret history of Ireland's changing character.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Tracy Chevalier","Name":"The last runaway","Price":"12.90","Description":"The stunning new novel from the bestselling author of Girl with a Pearl Earring. When modest Quaker Honor Bright sails from Bristol with her sister, she is fleeing heartache for a new life in America, far from home. But tragedy leaves her alone and vulnerable, torn between two worlds and dependent on the kindness of strangers. Life in 1850s Ohio is precarious and unsentimental. The sun is too hot, the thunderstorms too violent, the snow too deep. The roads are spattered with mud and spit.&nbsp;","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Walter Mosley","Name":"Cinnamon Kiss","Price":"9.90","Description":"No description available","Category":{"CategoryName":"Modern Fiction"}},{"Author":"David Mitchell","Name":"Number 9 dream","Price":"13.90","Description":"By the&nbsp;New York Times&nbsp;bestselling author of&nbsp;The Bone Clocks&nbsp;and&nbsp;Cloud Atlas&nbsp;| Shortlisted for the Man Booker Prize","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Peter Mayle","Name":"Chasing Cezanne","Price":"12.90","Description":"A photographer on a visit to a house featured in a magazine he works for, discovers that a Cezanne painting has been stolen from there. With the editor of the magazine as the suspect thief, he is sent on pursuit of her and the Cezanne through London, the South of France and New York.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Patricia Duncker","Name":"Hallucinating Foucault","Price":"12.90","Description":"In this ravishing tale of sexual and textual obsession, the young unnamed narrator sets forth from Cambridge on a quest. He is to rescue the subject of his doctoral research, Paul Michel, the brilliant but mad writer, from incarceration in a mental institution in France. What ensues is a drama of terrible intimacy and tenderness played out one hot and humid summer in Paris and in the south of France. \"Hallucinating Foucault\" is a literary thriller that explores with consummate mastery the passionate relationship between reader and writer, between the factual and the fictional, between sanity and madness. In blurring these boundaries, Patricia Duncker has written a novel of astonishing power and beauty.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J M Coetzee","Name":"Age of iron","Price":"12.90","Description":"Nobel Laureate and two-time Booker prize-winning author of Disgrace and The Life and Times of Michael K, J. M. Coetzee tells the remarkable story of a nation gripped in brutal apartheid in his Sunday Express Book of the Year award-winner Age of Iron. In Cape Town, South Africa, an elderly classics professor writes a letter to her distant daughter, recounting the strange and disturbing events of her dying days. She has been opposed to the lies and the brutality of apartheid all her life, but now she finds herself coming face to face with its true horrors: the hounding by the police of her servant's son, the burning of a nearby black township, the murder by security forces of a teenage activist who seeks refuge in her house.&nbsp;","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Michel Houellebecq","Name":"Atomised","Price":"12.90","Description":"Half-brothers Michel and Bruno have a mother in common but little else. Michel is a molecular biologist, a thinker and idealist, a man with no erotic life to speak of and little in the way of human society. Bruno, by contrast, is a libertine, though more in theory than in practice, his endless lust is all too rarely reciprocated. Both are symptomatic members of our atomised society, where religion has given way to shallow 'new age' philosophies and love to meaningless sexual connections. Atomised (Les Particules elementaires) tells the stories of the two brothers, but the real subject of the novel is the dismantling of contemporary society and its assumptions, its political incorrectness, and its caustic and penetrating asides on everything from anthropology to the problem pages of girls' magazines. A dissection of modern lives and loves. By turns funny, acid, infuriating, didactic, touching and visceral.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"J.M. Coetzee","Name":"Summertime","Price":"11.90","Description":"A young English biographer is working on a book about the late writer, John Coetzee. He plans to focus on a period in the seventies when, the biographer senses, Coetzee was 'finding his feet as a writer'. He embarks on a series of interviews with people who were important to Coetzee - a married woman with whom he had an affair, his favourite cousin Margot, a Brazilian dancer whose daughter had English lessons with him, former friends and colleagues. Thus emerges a portrait of the young Coetzee as an awkward, bookish individual, regarded as an outsider within the family. His insistence on doing manual work, his long hair and beard, and rumours that he writes poetry evoke nothing but suspicion in the South Africa of the time.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"Prayer For Owen Meany","Price":"12.90","Description":"'If you care about something you have to protect it. If you're lucky enough to find a way of life you love, you have to find the courage to live it'. Eleven-year-old Owen Meany, playing in a Little League baseball game in Gravesend, New Hampshire, hits a foul ball and kills his best friend's mother. Owen doesn't believe in accidents; he believes he is God's instrument. What happens to Owen after that 1953 foul ball is both extraordinary and terrifying.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Philip Hensher","Name":"The Mulberry Empire","Price":"12.90","Description":"The breakthrough novel from Britain's most brilliant young critic. With 'The Mulberry Empire', Philip Hensher with his fourth book has now happened upon a subject that suits his many talents perfectly. It's a seemingly straightforward historical novel that recounts an episode in the Great Game in central Asia -- the courtship, betrayal and invasion of Afghanistan in the 1830s by the emissaries of Her Majesty's Empire, which is followed by a bloody and summary expulsion of the Brits from Kabul following an Afghani insurrection (shades of the Soviet Union's final imperial fling in the very same country in the 1980s).","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Richard C Morais","Name":"The hundred foot journey","Price":"12.90","Description":"'I have never experienced that most subtle of senses - smell - captured so well in print. The aroma of fine cooking just floats off the pages. Don't read this book if you're hungry. You might eat it.' - Simon Beaufoy, Oscar-Award-winning screenwriter, Slumdog Millionaire Abbas Haji is the proud owner of a modest family restaurant in Mumbai. But when tragedy strikes, Abbas propels his boisterous family into a picaresque journey across Europe, finally settling in the remote French village of Lumiere, where he establishes an Indian restaurant - Maison Mumbai. Much to the horror of their neighbour, a famous chef named Madame Mallory, the Indian establishment opposite her own begins to garner a following.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Chuck Palahniuk","Name":"Survivor","Price":"11.90","Description":"Tender Branson, the last surviving member of the Creedish death cult, has commandeered a Boeing 747, emptied of passengers, in order to tell his story to the plane's black box before it crashes. Brought up by the repressive cult and, like all Creedish younger sons, hired out as a domestic servant, Tender finds himself suddenly famous when his fellow cult members all commit suicide. As media messiah he ascends to the very top of the freak-show heap before finally and apocalyptically spiralling out of control.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Charles Portis","Name":"True grit","Price":"12.90","Description":"There is no knowing what lies in a man's heart. On a trip to buy ponies, Frank Ross is killed by one of his own workers. Tom Chaney shoots him down in the street for a horse, $150 cash, and two Californian gold pieces. Ross's unusually mature and single-minded fourteen-year-old daughter Mattie travels to claim his body, and finds that the authorities are doing nothing to find Chaney. Then she hears of Rooster - a man, she's told, who has grit - and convinces him to join her in a quest into dark, dangerous Indian territory to hunt Chaney down and avenge her father's murder.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"David Ebershoff","Name":"The Danish girl","Price":"12.90","Description":"Set in the 1920s and '30s in Copenhagen, Paris and Dresden, and inspired by a true story, The Danish Girl is about one of the most passionate and unusual marriages of the 20th century. Einar Wegener and his American wife Greta Waud have been married for six years, but have yet to have a child. Both painters, they live a life of bohemian langour in Copenhagen until one day their lives are irreversibly altered. An opera singer whose portrait Greta is painting fails to turn up for her sitting. Greta asks her husband if he would put on the soprano's stockings so that she can continue her portrait. Einar agrees and as he pulls on her stockings, slips into her yellow shoes and finally draws over his head the soprano's dress, he stirs up in himself a remote sensation that he might be in part be a woman.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Arthur Koestler","Name":"Arrival and departure","Price":"12.90","Description":"Peter Slavek starts out as a brave young revolutionary, but suffers a breakdown. On the analyst's couch he is made to discover that his crusading zeal was derived from unconscious guilt.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"Last Night In Twisted River","Price":"13.90","Description":"In 1954, in the cookhouse of a logging and sawmill settlement in northern New Hampshire, an anxious twelve-year-old boy mistakes the local constable's girlfriend for a bear. Both the twelve-year-old and his father become fugitives, forced to run from Coos County - to Boston, to southern Vermont, to Toronto - pursued by the implacable constable. Their lone protector is a fiercely libertarian logger, once a river driver, who befriends them. In a story spanning five decades, Last Night in Twisted River - John Irving's twelfth novel - depicts the recent half-century in the United States as 'a living replica of Coos County, where lethal hatreds were generally permitted to run their course'.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"John Irving","Name":"The Fourth Hand","Price":"12.90","Description":"'Imagine a young man on his way to a less-than-thirty-second event - the loss of his left hand, long before he reached middle age.' While reporting a story from India, a New York television journalist has his left hand eaten by a lion; millions of TV viewers witness the accident. In Boston, a renowned hand surgeon awaits the opportunity to perform the nation's first hand transplant. A married woman in Wisconsin wants to give the one-handed reporter her husband's left hand, that is, after her husband dies. But the husband is alive, relatively young, and healthy...&nbsp;","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Machado de Assis","Name":"Philosopher or dog","Price":"12.90","Description":"The rich and eccentric philosopher Quincas Borbas names his dog after himself because he knows his pet will outlive him. Quincas does die first, leaving his fortune to his friend Rube provided that he takes care for the dog. The dim-witted friend is hardly prepared for the life that awaits him.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Mohsin Hamid","Name":"Moth smoke","Price":"12.90","Description":"Moth Smoke is the first novel by Mohsin Hamid, author of The Reluctant Fundamentalist 'You know you're in trouble when you can't meet a woman's eye, particularly if the woman happens to be your best friend's wife.' In Lahore, Daru Shezad is a junior banker with a hashish habit. When his old friend Ozi moves back to Pakistan, Daru wants to be happy for him. Ozi has everything: a beautiful wife and child, an expensive foreign education - and a corrupt father who bankrolls his lavish lifestyle. As jealousy sets in, Daru's life slowly unravels. He loses his job. Starts lacing his joints with heroin. Becomes involved with a criminally-minded rickshaw driver. And falls in love with Ozi's lonely wife. But how low can Daru sink? Is he guilty of the crime he finds himself on trial for? 'A vivid portrait of contemporary young Pakistani life, where frustration and insecurity feed not only the snobbery, decadence and aspirations of the rich, but also the resentment of the poor' The Times 'Fast-paced, intelligent ...pulls us, despite ourselves, into its spiralling wake' New Yorker 'A subtly audacious ...prodigious descendant of hard-boiled lit and film noir.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Matthew Plampin","Name":"The street philosopher","Price":"12.90","Description":"Ambitious young journalist Thomas Kitson arrives at the battlefields of the Crimea as the London CourierвЂ™s man on the ground. It is a dangerous place, full of the worst horrors of war but Kitson is determined to make his mark. Under the tutelage of his hard-bitten Irish boss Cracknell, and assisted by artist Robert Styles, he sets about exposing the incompetence of the army generals.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"David Lodge","Name":"The art of fiction","Price":"11.90","Description":"From Jane Austen to Paul Auster, irony to magical realism, the novelist's art is revealed in an entertaining and enlightening book for readers and writers--from the author of Nice Work. Here are 50 of David Lodge's articles from the acclaimed series that engaged and delighted readers of The Washington Post and the London Independent.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Tana French","Name":"Faithful place","Price":"11.90","Description":"The course of Frank Mackey's life was set by one defining moment when he was nineteen. The moment his girlfriend, Rosie Daly, failed to turn up for their rendezvous in Faithful Place, failed to run away with him to London as they had planned. Frank never heard from her again. Twenty years on, Frank is still in Dublin, working as an undercover cop. He's cut all ties with his dysfunctional family. Until his sister calls to say that Rosie's suitcase has been found. Frank embarks on a journey into his past that demands he reevaluate everything he believes to be true.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Chuck Palahniuk","Name":"Haunted","Price":"15.90","Description":"\"Haunted\" is a novel made up of stories: twenty-three of them to be precise. Twenty-three of the most horrifying, hilarious, mind-blowing, stomach-churning tales you'll ever encounter - sometimes all at once. They are told by the people who have all answered the ad headlined 'Artists Retreat: Abandon your life for three months'.They are led to believe that here they will leave behind all the distractions of 'real life' that are keeping them from creating the masterpiece that is in them. But 'here' turns out to be a cavernous and ornate old theatre where they are utterly isolated from the outside world - and where heat and power and, most importantly, food are in increasingly short supply.And the more desperate the circumstances become, the more desperate the stories they tell - and the more devious their machinations become to make themselves the hero of the inevitable play/movie/non-fiction blockbuster that will certainly be made from their plight. \"Haunted\" is at one level a satire of reality television. It draws from a great literary tradition - \"The Canterbury Tales\", \"The Decameron\", the English storytellers in the Villa Diodati who produced, among other works, \"Frankenstein\" - to tell an utterly contemporary tale of people desperate that their story be told at any cost. Appallingly entertaining, \"Haunted\" is Chuck Palahniuk at his finest - which means his most extreme and his most provocative.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Mia Couto","Name":"The tuner of silences","Price":"13.90","Description":"Mwanito VitalГ­cio was eleven when he saw a woman for the first time, and the sight so surprised him he burst into tears. Mwanito's been living in a big-game park for eight years. The only people he knows are his father, his brother, an uncle, and a servant. He's been told that the rest of the world is dead, that all roads are sad, that they wait for an apology from God. In the place his father calls Jezoosalem, Mwanito has been told that crying and praying are the same thing. Both, it seems, are forbidden.&nbsp;","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Sebastian Barry","Name":"On Canaans side","Price":"12.90","Description":"'As they used to say in Ireland, the devil only comes into good things.' Narrated by Lilly Bere, On Canaan's Side opens as she mourns the loss of her grandson, Bill. The story then goes back to the moment she was forced to flee Dublin, at the end of the First World War, and follows her life through into the new world of America, a world filled with both hope and danger. At once epic and intimate, Lilly's narrative unfurls as she tries to make sense of the sorrows and troubles of her life and of the people whose lives she has touched. Spanning nearly seven decades, it is a novel of memory, war, family-ties and love, which once again displays Sebastian Barry's exquisite prose and gift for storytelling.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Maya Angelou","Name":"Gather together in my name","Price":"12.90","Description":"Maya Angelou's volumes of autobiography are a testament to the talents and resilience of this extraordinary writer. Loving the world, she also knows its cruelty. As a black woman she has known discrimination and extreme poverty, but also hope, joy, achievement and celebration. In the sequel to her best-selling I Know Why The Caged Bird Sings Maya Angelou is a young mother in California, unemployed, embarking on brief affairs and transient jobs in shops and night-clubs, turning to prostitution and the world of narcotics.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Graham Swift","Name":"Waterland","Price":"11.90","Description":"Perfectly controlled, superbly written. Waterland is original, compelling and narration of the highest order' Guardian In the years since its first publication, in 1983, Waterland has established itself as one of the classics of twentieth-century British literature: a visionary tale of England's Fen country; a sinuous meditation on the workings of history; and a family story startling in its detail and universal in its reach. This edition includes an introduction, by the author, written to celebrate the book's 25th anniversary. 'Graham Swift has mapped his Waterland like a new Wessex.He appropriates the Fens as Moby Dick did whaling or Wuthering Heights the moors. This is a beautiful, serious and intelligent novel, admirably ambitious and original' Observer 'A 300-page tour de force ...A burst of exuberant fictive energy' Evening Standard 'Waterland is a formidably intelligent book, animated by an impressive, angry pity at what human creatures are capable of doing to one another in the name of love and need. The most powerful novel I have read for some time' New York Review of Books","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Gabriel Garcia Marquez","Name":"The Story Of A Shipwrecked Sailor","Price":"11.90","Description":"Gabriel Garcia Marquez, winner of the 1982 Nobel Prize for Literature and author of One Hundred Years of Solitude, started his literary career with the publication of The Story of a Shipwrecked Sailor ...'On February 22 we were told that we would be returning to Columbia' In 1955 eight crew members of Caldas, a Colombian destroyer, were swept overboard. Velasco alone survived, drifting on a raft for ten days without food or water. Marquez retells the survivor's amazing tale of endurance, from his loneliness and thirst to his determination to survive. The Story of a Shipwrecked Sailor was Marquez's first major work, published in a Colombian newspaper, El Espectador, in 1955 and then in book form in 1970. 'The story of Velasco on his raft, his battle with sharks over a succulent fish, his hallucinations, his capture of a seagull which he was unable to eat, his subsequent droll rescue, has all the grip of archetypal myth. Reads like an epic' Independent 'A master storyteller' Daily Mail 'Garcia Marquez is a retailer of wonders' Sunday Times","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Chuck Palahniuk","Name":"Choke","Price":"11.90","Description":"Fight Club, Chuck Palahniuk's controversial and blazingly original debut novel, introduced a fresh and even renegade talent to American fiction, one who has retooled the classic black humour of Terry Southern and Kurt Vonnegut for the lunacy of the millennial age. In his new novel, Choke, he gives readers a vision of life and love and sex and mortality that is both chillingly brilliant and teeth-rattlingly funny. Victor Mancini, a dropout from medical school, has devised a complicated scam to pay for his mother's hospital care: pretend to be choking on a piece of food in a restaurant and the person who 'saves you' will feel responsible for the rest of their lives. Multiply that a couple of hundred times and you generate a healthy flow of cheques, week in, week out. Between fake choking gigs, Victor works at Colonial Dunsboro with a motley group of losers and stoners trapped in 1734, cruises sex addiction groups for action ('You put twenty sexaholics around a table night after night and don't be surprised.') , and visits his mother, whose anarchic streak made his childhood a mad whirl and whose Alzheimer's disease now hides what may be the startling truth about his, possibly divine, parentage. An antihero for our deranging times, Victor's whole existence is a struggle to wrest an identity from overwhelming forces. His creator, Chuck Palahniuk, is the visionary we need and the satirist we deserve.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Sergei Lukyanenko","Name":"Day Watch","Price":"11.90","Description":"Walking the streets of Moscow, indistinguishable from the rest of its population, are The Other. Possessors of supernatural powers and capable of entering the Twilight, a shadowy world that exists in parallel to our own, each owes allegiance either to The Dark - the Day Watch - or The Light - the Night Watch. In The Day Watch, second book of the Night Watch trilogy, Alice, a young but powerful Dark Other, leaves her house to attend a meeting with her comrades in the Day Watch. The team is on a mission to apprehend an uninitiated Other, a practicing Dark witch who has so far eluded the bureaux responsible for finding and initiating unlicensed practitioners of magic. It seems a routine operation. But when they arrive, the Night Watch team has already made the arrest. A fierce battle ensues, during which Alice almost dies. Drained of her powers, she is sent to recuperate at a youth camp near the Black Sea. There she meets Igor; the chemistry between them is instant and irresistible, as Alice finds herself falling in love. But then comes the shattering realisation: Igor is a Light Mage. Suddenly Alice remembers him as one of those involved in the battle that left her crippled.Had they known each other for what they were, the idea that there might be anything between them would have seemed impossible. But now that they know, there is no alternative to a magical duel, a battle that neither of them wants to win.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Marcel Proust","Name":"Time regained","Price":"12.90","Description":"The final volume of In Search of Lost Time chronicles the years of World War I, when, as M. de Charlus reflects on a moonlit walk, Paris threatens to become another Pompeii. Years later, after the war's end, Proust's narrator returns to Paris, where Mme. Verdurin has become the Princesse de Guermantes. He reflects on time, reality, jealousy, artistic creation, and the raw material for literature-his past life. This volume also includes the indispensable Guide to Proust, an index to all six volumes of the novel.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Elizabeth Taylor","Name":"Angel","Price":"12.90","Description":"A tale of fantasy and self-delusion, this novel charts the rise and fall of a popular novelist, and brilliantly evokes the life of Marie Corelli, the famous writer of romances.","Category":{"CategoryName":"Modern Fiction"}},{"Author":"Colm Toibin","Name":"The master","Price":"15.90","Description":"A fictionalized study based on many biographical materials and family accounts of Henry James's life, this volume ranges seamlessly from his memories of his prominent Brahmin family in the States to his settling in England. Along the way it offers hints of James's troubled sexual identity.","Category":{"CategoryName":"Modern Fiction"}}]