[{"Author":"Dave Thompson","Name":"Beyond the Velvet Underground","Price":"18.90","Description":"The story of the legendary 60s cult group in the words of Lou Reed, John Cale, Nico, and more.","Category":{"CategoryName":"Music"}},{"Author":"Susan Hill","Name":"Rolling Stones","Price":"22.90","Description":"Life in Pictures: The Rolling Stones charts the rise of the world's greatest Rock 'n' Roll band.","Category":{"CategoryName":"Music"}},{"Author":"John Chilton","Name":"Louis: the Louis Armstrong story","Price":"15.90","Description":"No description available","Category":{"CategoryName":"Music"}},{"Author":"James Lincoln Collier","Name":"Louis Armstrong","Price":"13.90","Description":"Louis Armstrong. \"Satchmo.\" To millions of fans, he was just a great entertainer. But to jazz aficionados, he was one of the most important musicians of our times--not only a key figure in the history of jazz but a formative influence on all of 20th-century popular music. Set against the backdrop of New Orleans, Chicago, and New York during the \"jazz age,\" Collier re-creates the saga of an old-fashioned black man making it in a white world.He chronicles Armstrong's rise as a musician, his scrapes with the law, his relationships with four wives, and his frequent feuds with fellow musicians Earl Hines and Zutty Singleton. He also sheds new light on Armstrong's endless need for approval, his streak of jealousy, and perhaps most important, what some consider his betrayal of his gift as he opted for commercial success and stardom. A unique biography, knowledgeable, insightful, and packed with information, it ends with Armstrong's death in 1971 as one of the best-known figures in American entertainment.","Category":{"CategoryName":"Music"}},{"Author":"Mark Roland","Name":"Gods of Rock","Price":"13.90","Description":"A compendium of amazing facts, mind-boggling myths and hideous hearsay from the world of rock. Packed with music moments, lifestyles, sex, drugs, parties, loves, lost causes and untimely deaths, this book asks an important question, namely, what does it take to be a true rock god?","Category":{"CategoryName":"Music"}},{"Author":"Jim Driver","Name":"The Mammoth Book of Sex, Drugs and Rock 'n' Roll","Price":"13.90","Description":"Over 60 gripping accounts tracking the dark side of rock 'n' roll from the early days of the drugs-and-drink culture, and the birth of rock 'n' roll, through The Beatles, Stones, Sex Pistols, Madonna, Kurt Cobain and Oasis, to Amy Winehouse, Pete Doherty and other stars of the current rock-music scene. From trashed hotel rooms to cars in swimming pools, all rock 'n' roll's excesses are here, including murder and sexual deviancy, surprising brushes with the law that the stars thought they'd kept quiet, early and tragic deaths, drug overdoses, robbery, mis-marriages and groupies by the truckload","Category":{"CategoryName":"Music"}},{"Author":"Garry Mulholland","Name":"The 261 greatest albums since punk and disco","Price":"0","Description":"The companion volume to 'This is Uncool', Garry Mulholland shifts his focus from singles to albums, making witty and irreverent criticisms on the likes of David Bowie, The Smiths, Eminem and The Prodigy.","Category":{"CategoryName":"Music"}},{"Author":"Sladen and Yedgar","Name":"Panic Attack","Price":"0","Description":"This edited work offers a vibrant and powerful visual account of an exciting, innovative period in British and American art. It features the work of 30 leading artists, among them Gilbert &amp; George, Nan Goldin, Derek Jarman and Robert Mapplethorpe.","Category":{"CategoryName":"Music"}},{"Author":"Clinton Heylin","Name":"Bob Dylan behind the shades","Price":"0","Description":"In virtually all areas of Dylan's life - his immigrant antecedents, his business dealings, his various addictions and his romantic attachments - Heylin is able to provide a fascinating picture of a man who changed the whole course of popular music in the sixties and, over thirty years later, won three Grammys. Heylin has given full weight to Dylan's own words and those of his closest associates, with over 250 people quoted in the book, helping to provide a portrait of a complex figure. Including 60,000 words of brand new material - dealing with Dylan's four twenty-first century albums; his archival audio-visual projects; his third film; his series of paintings and exhibitions; his autobiography, \"Chronicles\"; and his ongoing romantic liaisons and 'missing' marriages - this fully updated story of Dylan provides a monumental overview of the Man and his Music.","Category":{"CategoryName":"Music"}}]