[{"Author":"Martin Cohen","Name":"101 Philosophy Problems","Price":"11.90","Description":"Does Farmer Field really know his prize cow, Daisy, is in the field? When is an unexpected exam not wholly unexpected? Are all bachelors (really) unmarried? Martin Cohen's 101 Philosophy Problems, Fourth Edition introduces philosophy in an entertaining but informative and stimulating way. Using philosophical puzzles, conundrums and paradoxes he skilfully unwraps some of the mysteries of the subject, from what we know - or think we know - to brainteasing thought experiments about ethics, science and the nature of the mind. For the Fourth Edition there are many new problems, including Maxwell's Moving Magnets, Einstein Changes Train Times, and Zeno's Paradox of Place; as well as two brand new sections including puzzles such as Lorenz's Waterywheel, and the Battle for Fractal Farm, and perplexing ethical dilemmas.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Marian Keyes","Name":"Under The Duvet","Price":"5.90","Description":"Under The DuvetMarian Keyes, author of the internationally best-selling&nbsp;This Charming Man and Sushi for Beginners, is back and better than ever in&nbsp;Further Under the Duvet, the follow up to the hit collection of her journalism&nbsp;Under the Duvet.&nbsp;'Let's get one thing straight: I'm not an outdoorsy type.If I was offered the choice between white-water rafting and being savaged by a rabid dog, I'd be likely to tick the box marked \"dog\".' Slide further under the duvet with this second collection of&nbsp;Marian Keyes'&nbsp;unputdownable and utterly delectable journalism. It's the next best thing you could be doing in bed ...and it's guaranteed not to let you down!'Everything this woman touches turns to comic gold' Cosmopolitan 'Marian gives us another insight into her life with this collection of hilarious anecdotes. From shopping, travel, men and fashion,&nbsp;Marian&nbsp;takes us on a journey into her weird and wonderful world. Utterly brilliant' Closer 'Honest and hilarious, this brilliant collection is packed with riotous anecdotes and Keyes' trademark wit. There are adventures with fake tan, love affairs with Toblerone and laugh-out-loud shopping trips to Bloomingdales.Perfect for those in need of a smile'&nbsp;Eve Marian Keyes&nbsp;is the author of the internationally best-selling&nbsp;Walsh sisters novels Watermelon, Angels, Rachel's Holiday, Anybody Out&nbsp;There&nbsp;- winner of the 2007 Popular Fiction prize&nbsp;- and now&nbsp;The Mystery of Mercy Close.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Michael Norton","Name":"365 Ways To Change The World","Price":"9.90","Description":"365 Ways To Change The WorldYou want to change the world? Of course you do. But where do you begin? This ingenious handbook shows how the smallest actions can impact on your local community and the wider world. Packed with ideas and facts from leading campaign organisations, it suggests one action for every day of the year.Some are intriguing, many are unusual, a few involve fundraising, almost all can be planned or done from your home or computer, most will be fun, all are achievable.They include: support trade justice: buy three footballs; avoid landfills by freecycling; create a lifeline for remote African villages with a wind-up radio; sow the seeds of a green revolution: guerrilla gardening; organise a fundraising event: speed dating for safer childbirth; get out of debt: join the Church of Stop Shopping; fight child slavery with fairtrade chocolate; and influence the world's media: become a blogger.This is the book to get you started...one day at a time.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Jo Haigh","Name":"Tales From the Glass Ceiling","Price":"11.90","Description":"Tales From the Glass Ceiling12-14% of UK businesses are majority owned by women, a statistic that shows both the great strides women have made in business in the past two decades and how many obstacles still remain in a culture where 90% of the top roles are held by men.&nbsp;Jo Haigh&nbsp;has worked for many years in corporate finance, and has experienced these obstacles, and overcome them.In&nbsp;Tales from the&nbsp;Glass Ceiling, she offers women an inspirational guide to success in the male-dominated business world - a goal, that does not mean losing your identity. Haigh offers stories of success from many different areas of business, giving advice on how to reconcile an open, emotional disposition with an executive level's occasionally brutal atmosphere; how to spot the right training and development opportunities (and get them funded); how to overcome resistance to female leadership and how to build, manage and maintain your professional network.Based on Haigh's own experience as an executive and entrepreneur, and bolstered by the experiences and stories of other top women in their fields, Tales from the Glass Ceiling is an indispensable resource for all women in business.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Robin Sharma","Name":"Who Will Cry When You Die","Price":"12.90","Description":"Who Will Cry When You DieDoes the gem of wisdom quoted\r\nabove strike a chord deep within you? Do you feel that life is slipping by so\r\nfast that you just might never get the chance to live with the meaning,\r\nhappiness and joy you know you deserve? If so, then this very special book by\r\nleadership guru Robin S. Sharma, the author whose Monk Who Sold His Ferrari\r\nseries has transformed the lives of thousands, will be the guiding light that\r\nleads you to a brilliant new way of living. In this easy-to-read yet\r\nwisdom-rich manual, Robin S. Sharma offers 101 simple solutions to lifeвЂ™s most\r\ncomplex problems, ranging from a little-known method for beating stress and\r\nworry to a powerful way to enjoy the journey while you create a legacy that\r\nlasts. Other lessons include вЂњHonor Your Past,вЂќ вЂњStart Your Day Well,вЂќ вЂњSee\r\nTroubles as BlessingsвЂќ and вЂњDiscover Your Calling.вЂќ If you are finally ready to\r\nmove beyond a life spent chasing success to one of deep significance, this is\r\nthe ideal book for you.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Nicholas Fearn","Name":"Philosophy","Price":"12.90","Description":"The work of philosophers such as Plato, Aristotle, Russell and Wittgenstein is well known. Philosophy: The State of the Art is the first book to relate, for the general reader, the thoughts of the world's most eminent living philosophers, along with the greatest among the very recently deceased.In the search for higher meaning, Nicholas Fearn has travelled the globe to interview over three dozen of the most eminent intellectuals in the field, from Derek Parfit, David Wiggins and Bernard Williams to Donald Davidson, Richard Rorty and Bernard Henri-Levi. In asking them the three key questions - 'who are we?' 'what do we know?' and 'how should we live?' - Fearn reveals the lastest thinking on what it is to be human; what our limitations and capabilities are; and what our purpose should be. Philosophy: The State of the Art is a brilliant and highly original guide to the latest answers to the oldest questions.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"James Gleick","Name":"Faster","Price":"15.90","Description":"From the bestselling author of \"Chaos\" and \"Genius\" comes a brilliantly reasoned and engaging study of the human obsession with time: ways to save it and fit more into it, and how there is never enough of it.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Oliver Sacks","Name":"Seeing voices","Price":"11.90","Description":"With Seeing Voices Dr Sacks launches us on a journey into the world of the deaf which he explores with the same passion and insight that have illuminated other human conditions for his readers everywhere. 'Oliver Sacks, blessed with an understanding heart and poetic voice, speaks the language of the deaf. An exquisite, as well as revelatory, work' Studs Terkel 'This scholarly and carefully documented book is a landmark for deaf rights.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"White Eagle","Name":"Still Voice","Price":"6.90","Description":"A manual for self-training and ongoing support in personal meditation. Each section carries a reading from White Eagle's teaching, catching the gentleness of this voice from the spirit. Each reading is followed by a suggested visual sequence for meditation.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Erich Fromm","Name":"The art of loving","Price":"23.90","Description":"Since it was first published \" The Art of Loving\" has become a classic, inspiring thousands of people with its clarity and power. Erich Fromm, the renowned psychoanalyst, sees love as the ultimate need and desire of all human beings. In this book, he discusses every aspect of the subject: romantic love, the love of parents for children, brotherly love, erotic love, self-love and the love of God or the divine. He looks at the theory of love as it appears throughout the cultures of the world and at the practice, how we show or fail to show love to one another. Love is an art, which we need to develop and practice in order to find true commitment. We need to find it, individually and as a society as a whole.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"David Allen","Name":"Getting things done","Price":"39.90","Description":"Since it was first published in David Allen's Getting Things Done has become one of the most influential business titles of its era, and the book on personal organisation. 'GTD' has become shorthand for an entire way of approaching the professional and personal tasks everyone faces in life, and has spawned an entire culture of websites, organisational tools, seminars, and offshoots.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Aldous Huxley","Name":"Point Counter Point","Price":"12.90","Description":"Aldous Huxley's lifelong concern with the dichotomy between passion and reason finds its fullest expression both thematically and formally in his masterpiece&nbsp;Point Counter Point. By presenting a vision of life in which diverse aspects of experience are observed simultaneously, Huxley characterizes the symptoms of \"the disease of the modern man\" in the manner of a composer--themes and characters are repeated, altered slightly, and played off one another in a tone that is at once critical and sympathetic.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Alexander George","Name":"I am therefore I think","Price":"13.90","Description":"What is it like to be another person? Why is stupidity not painful? Is it possible for a human ever to do a selfless act? Do chimpanzees really enjoy eating bananas? How can an exception ever prove a rule? This is an entertaining jargon-free exploration of the philosophy of everyday life.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Jean Paul Sartre","Name":"The age of reason","Price":"12.90","Description":"The first volume in his Roads to Freedom trilogy, Jean-Paul Sartre's The Age of Reason is a philosophical novel exploring existentialist notions of freedom, translated by Eric Sutton with an introduction by David Caute in Penguin Modern Classics. Set in the volatile Paris summer of 1938, The Age of Reason follows two days in the life of Mathieu Delarue, a philosophy teacher, and his circle in the cafes and bars of Montparnasse. Mathieu has so far managed to contain sex and personal freedom in conveniently separate compartments. But now he is in trouble, urgently trying to raise 4,000 francs to procure a safe abortion for his mistress, Marcelle. Beyond all this, filtering an uneasy light on his predicament, rises the distant threat of the coming of the Second World War.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Dale Carnegie","Name":"How to enjoy your life and your job","Price":"13.90","Description":"A title by the author of HOW TO WIN FRIENDS AND INFLUENCE PEOPLE, which explains how feelings of harmony and purpose can overcome boredom, fatigue and frustration, and how to realise our full potential. First published by Mandarin in 1990.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Vance Packard","Name":"The hidden persuaders","Price":"12.90","Description":"Written in 1957, this is Packard's warning of the power of advertising techniques.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"A J Ayer","Name":"The central questions of philosophy","Price":"13.90","Description":"In this introduction to some of the most frequently discussed areas of philosophy, Sir Alfred Ayer made his subject accessible to both the general reader and the student. Among the topics covered are the nature of philosophy, varieties of philosophical analysis, theory of knowledge, status of physical objects, relations between body and mind, character of scientific explanation, theory of probability, elements of logic and the claims of theology. Although it ranges more widely, the book invites comparison with Bertrand Russell's \"The Problems of Philosophy\".","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Richard Bach","Name":"Jonathan Livingston Seagull","Price":"11.90","Description":"Jonathan Livingston Seagull, the bird determined to be more than ordinary, to have a reason for living. This is a story for people who follow their dreams and make their own rules; it's inspired people for decades. Most gulls don't bother to learn more than the simplest facts of flight--how to get from shore to food and back again,\" writes author Richard Bach, in this allegory about a unique bird named Jonathan Livingston Seagull. \"For most gulls it is not flying that matters, but eating. For this gull, though, it was not eating that mattered, but flight.\" Flight is indeed the metaphor that makes the story soar. Ultimately this is a fable about the importance of seeking a higher purpose in life, even if your flock, tribe or neighbourhood finds your ambition threatening. (At one point our beloved gull is even banished from his flock.) By not compromising his higher vision, Jonathan gets the ultimate pay-off: transcendence. Ultimately, he learns the meaning of love and kindness. The dreamy seagull photographs by Russell Munson provide just the right illustrations. This is a spirituality classic.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Philip Zimbardo","Name":"Psychology and life","Price":"17.90","Description":"Now in paperback, this breakthrough book on the new psychological science of time by one of the most influential living psychologists--the New York Times bestselling author of The Lucifer Effect --and his research partner launched on the front page of USA TODAY -Lifestyle- with a Time Survey and on CBS Morning Show. This is the first paradox of time: Your attitudes toward time have a profound impact on your life and world, yet you seldom recognize it. Our goal is to help you reclaim yesterday, enjoy today, and master tomorrow with new ways of seeing and working with your past, present, and future.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Stephen Law","Name":"The Outer Limits: More Mysteries From The Philosophy Files","Price":"11.90","Description":"Stephen Law follows THE PHILOSOPHY FILES with a second book of philosophical conundrums for teenagers. This time he asks such questions as Do Miracles Happen? Why Do These Words Mean Something? and Do I Know the Sun will Rise Tomorrow? You can dip into the arguments that interest you, in eight chapters where the themes are set up in witty scenarios and then debated. There are wacky thought experiments to work out and a variety of characters appear - some of them Martians.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Ivan D Illich","Name":"Celebration of awareness","Price":"17.90","Description":"The book consists of 12 essays on the following themes: Vietnam &amp; the resistance; the war on poverty; Latin America, Puerto Rico &amp; immigration to the US mainland; Catholic Church problems; the Church's role in social change &amp; development; the futility of schooling; the question of technical assistance &amp; programs for 3rd world birth control. Each issue, while real &amp; urgent in its own right, becomes a paradigm case which reveals a fundamental theoria/praxis of revolution, informed by a philosophical &amp; theological discipline &amp; sensibility which transcends, tho it cannot avoid, concrete issues in a given time &amp; place. In each essay, Illich uses the method of radical doubt--not in a Cartesian but in a Socratic sense. He challenges the 'nature of some certainty' purveyed as truth. Hence he's dealing with 'the deception embodied in one of our institutions.' The most widespread &amp; pernicious deception pretended as certainty he questions is the certainty of ideological liberals who assume that people make their livee by their institutions &amp; therefore the institutions of N. American industrial civilization can &amp; should be translated to the 3rd world for its own good: especially the institutions of schooling &amp; technical assistance designed to help a given nation emulate the affluence of the US.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Mel Thompson","Name":"Teach yourself Philosophy","Price":"11.90","Description":"Do you need a concise introduction to philosophy? Would you like to understand key philosophical arguments? Do you want to discover the world's greatest philosophers? This book explores the key philosophical thinkers, arguments and works that have shaped the society in which we live.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"D.W. Hamlyn","Name":"The Penguin History Of Western Philosophy","Price":"13.90","Description":"D.W. Hamlyn presents a history of the great philosophical thinkers and their responses to the profound problems involved in trying to understand the world and our place in it.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Gareth Southwell","Name":"Words of wisdom","Price":"17.90","Description":"Words of Wisdom brings together 360 of Philosophy's most famous quotations, explaining their meaning and telling the stories behind them. Western philosophy may be said to have begun in ancient Greece, where, inscribed in his temple at Delphi, the words of the god Apollo commanded those who sought wisdom to first 'know thyself'.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Peter Singer","Name":"Hegel: A Very Short Introduction","Price":"11.90","Description":"Hegel is regarded as one of the most influential figures on modern political and intellectual development. After painting Hegel's life and times in broad strokes, Peter Singer goes on to tackle some of the more challenging aspects of Hegel's philosophy. Offering a broad discussion of Hegel's ideas and an account of his major works, Singer explains what have often been considered abstruse and obscure ideas in a clear and inviting manner. About the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Gilly Smith","Name":"Tantra and the tao","Price":"11.90","Description":"A guide to better sex and more intimate relationships, this book is about discovering the sexual electricity that will transform mind, body and soul. The sexual theories of Indian Tantrics and Chinese Taoists have existed for centuries, but only recently, the author contends, has their extraordinary power been recognized. This book demystifies the sexual secrets of the ancients and shows how we can develop an intensely satisfying emotional and sexual life through a simple and effective programme of meditation, exercise, yoga, healthy eating and special lovemaking techniques. Gilly Smith was also the author of \"Fibrenetics\" and \"The Mediterranean Health Diet\".","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Machado de Assis","Name":"Philosopher or dog","Price":"12.90","Description":"The rich and eccentric philosopher Quincas Borbas names his dog after himself because he knows his pet will outlive him. Quincas does die first, leaving his fortune to his friend Rube provided that he takes care for the dog. The dim-witted friend is hardly prepared for the life that awaits him.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Ancius Boethius","Name":"The consolation of philosophy","Price":"13.90","Description":"The Consolation of Philosophy has been described as the single most important and influential work in the West on medieval and early Renaissance Christianity, and is also the last great Western work of the Classical Period. Written while Boethius was in prison awaiting execution, the work consists of a dialogue in alternating prose and verse between the author, lamenting his own sorrows, and a majestic woman, who is the incarnation of his guardian Philosophy. The woman develops a modified form of Neo-Platonism and Stoicism, demonstrating the unreality of earthly fortunes, then proving that the highest good and the highest happiness are in God, and reconciling the apparent contradictions concerning the existence of everything.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Caroline Taggart","Name":"I used to know that","Price":"12.90","Description":"If you've forgotten the capital city of Chile; the basics of osmosis; how to solve a quadratic equation; the names of the Bennet sisters in Pride and Prejudice; who wrote the famous poem about daffodils; the use of a conjunction or the number of continents in the world, I Used to Know That will provide all the answers. A light-hearted and informative reminder of all the things that we learnt in school but have since become relegated to the backs of our minds, I Used to Know That features hundreds of important snippets of wisdom, facts, theories, equations, phrases, rules and sayings. A practical guide to turn to when an answer is eluding you, when helping a child with homework or preparing them for the new school year, or maybe just to brush up on trivia for the pub quiz. I Used to Know That covers English Language and Literature, Mathematics, Biology, Chemistry, Physics, History, Geography and General Studies, so never again will you find yourself stumped!","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"A C Grayling","Name":"The heart of things","Price":"13.90","Description":"The new bestseller from one of Britain's most pre-eminent philosophers and arguably the best known, A.C. Grayling Everyone wishes to live a life that is satisfying and fulfilling, in which there is achievement and pleasure, and which has the respect of people one, in turn, respects. And one of the fundamentals to living such a life is to reflect on the choices we make. In this new collection, A.C. Grayling invites the reader into a conversation with ideas. From personal questions about happiness and quality of life to wider public concerns such as war and democracy, these essays provide a springboard to thought and to exploring what is best about the human heart and mind.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Victoria Clark","Name":"Why Angels Fall: A Journey Through Orthodox Europe From Byzantium To Kosovo","Price":"11.90","Description":"'Compelling, powerful, magnificent' - \"The Times\". In revealing encounters with monks, nuns, bishops and archbishops, in monasteries ancient and modern Victoria Clark measures the depth and width of the gulf now separating Europe's Orthodox East from the Catholic and Protestant West. Many of the differences in outlook, priorities and even values can be traced back to the 1054 schism between the churches of Rome and Constantinople which created Europe's most durable fault-line. Travelling from Mount Athos to Istanbul and unravelling the tangled history, Victoria Clark demonstrates a rare sympathy with Eastern Orthodox Europe. 'I finished the book wanting to meet this intelligent, warm-hearted writer, and to follow her to some of the places she visited' - \"Literary Review\". 'A masterful synthesis of vivid and often humorous travel writing, a series of probing interviews and a pertinent historical context' - \"The Times\". 'Exhilarating ...her book will be immensely helpful to anyone occasionally puzzled by events, especially politics, in Eastern Europe.' - \"Financial Times\".","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"E. A. Burtt","Name":"The metaphysical foundations of modern science","Price":"15.90","Description":"Originally published: The metaphysical foundations of modern physical science. 2nd, rev. ed. Garden City, N.Y.: Doubleday, 1954.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"James Gleick","Name":"Faster: Our Race Against Time","Price":"12.90","Description":"Time rules our lives. The frenetic purpose - more than we want to admit, is to save time. Think of one of those conveniences that best convey the most elemental feeling of power over the passing seconds: the microwave oven. In your hurry sickness, you may find yourself punching 88 seconds instead of 90 because it is faster to tap the same digit twice. Do you stand at the microwave for that minute and a half? Or is that long enough to make a quick call or run in the next room to finish paying a bill? If haste is the gas pedal for the pace of our lives, then multi-tasking is overdrive.FASTER dissects with acute insight and mordant wit our unceasing daily struggle to squeeze as much as we can - but never enough - into the 1440 minutes of each day. Speed is the key strategy for saving time, and James Gleick shows us how in just about every area - from business cycle time to beeper medicine, from Federal Express to quick playback buttons on answering machines, from the pace of television to our growing need to do two things at once, how speed has become the experience we all have in common - it, more than the message, is what connects us.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"David Brazier","Name":"The new Buddhism","Price":"12.90","Description":"\"The New Buddhism\" states clearly and boldly that Buddhism should be and originally was about engagement with the world and about the practice of truth and compassion. It shows that for genuine spiritual renewal Buddhism must be about more than contemplation and personal growth. Buddhism is 'a raft to carry one across the stream, not something to burden one when one reaches the other shore. Get across that stream as quickly as possible, was [the Buddha's] message, there's work to do on the other side'. Brazier restores the idea of the Buddha as a spiritual leader with a vision of a peaceful revolution and takes a completely new look at many aspects of Buddhism, reinterpreting them in terms of the Buddha's social aims.In this title, western and eastern visions of enlightenment are compared; the mystique of lineage is questioned; the positive social record of Buddhism is examined and Buddhist practice - ethics, mind-training, the teacher-disciple relationship, refuge and renunciation - is reassessed. Above all, the author draws a line between 'extinction' Buddhism and 'liberation' Buddhism - the former aiming to free the individual from this world, and the latter aiming to perfect this world by freeing it from the large scale forces of greed and delusion. This book is a manifesto for a more active, compassionate and socially engaged Buddhism - one grounded in the Buddha's original intention.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Richard Norman","Name":"The moral philosophers","Price":"15.90","Description":"Adopting a historical approach, this introducion discusses in chronological sequence the theories of some of the major ethical philosophers. Norman redraws the traditional boundaries of the philosophical tradition to include not only Plato, Aristotle, Hume, Kant, and Mill, but also Hegelian ethics and the contributions of Marx and Freud to our understanding of the nature and limits of morality. Students and general readers will find this book an exceptionally clear survey of this important field of philosophical inquiry.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Richard E. Cytowic","Name":"The man who tasted shapes","Price":"12.90","Description":"The ten people in one million who are synesthetes are born into a world where one sensation (such as sound) conjures up one or more others (such as taste or color). Extensive experiments with more than 40 synesthetes led Richard Cytowic to an explanation of synesthesia and reveals the brain to be an active explorer, not just a passive receiver--a fascinating breakthrough in our understanding of what it means to be human. 15 illustrations.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Terry Eagleton","Name":"Why Marx Was Right","Price":"11.90","Description":"In this combative, controversial book, Eagleton takes issue with the prejudice that Marxism is dead and done with. Taking 10 of the most common objections to Marxism, he demonstrates in each case what a woeful travesty of Marx's own thought these assumptions are.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"J.O. Urmson","Name":"The Concise Encyclopedia Of Western Philosophy And Philosophers","Price":"14.90","Description":"On its first appearance in 1960, J.O. Urmson's Concise encyclopedia of Western philosophy and philosophers established itself as a classic. Its contributors included many of the leading philosophers of the English-speaking world: Ryle, Hare, Strawson, Ayer, Dummett, Williams and many others. They wrote with an authority and individuality which made the Encyclopedia into a lively and engaging introduction to philosophy as well as a convenient reference work.For this edition, supervised by Jonathan REe, the original articles have been revised and updated, and eighty articles by thirty one new authors have been added. The additions take account of recent developments in philosophy, of literary, historical and political issues in philosophy, and of developments in continental thought, including in Marxism, psychoanalysis, phenomenology, existentialism, structuralism, post-structuralism and deconstruction. There is a clear, integral cross-referencing system which allows the reader to identify points of overlap between philosophical traditions and their personalities at a glance.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Thomas Hobbes","Name":"Leviathan","Price":"12.90","Description":"Thomas Hobbes's Leviathan is the greatest work of political philosophy in English and the first great work of philosophy in English. In addition, it presents the fundamentals of his beliefs about language, epistemology, and an extensive treatment of revealed religion and its relation to politics. Beginning with premises that were sometimes controversial, such as that every human action is caused by the agent's desire for his own good, Hobbes derived shocking conclusions, such as that the civil government enjoys absolute control over its citizens and that the sovereign has the right to determine which religion is to be practiced in a commonwealth. Hobbes's contemporaries recognized the power of the arguments in Leviathan and many of them wrote responses to it. Selections from books by John Bramhall, Robert Filmer, Edward Hyde, George Lawson, William Lucy, Samuel Pufendorf and Thomas Tenison are included in this edition. Leviathan is divided into four parts: In the first part, Of Man, Hobbes presents a view of human beings and of the natural world in general that is materialistic and mechanistic. In the second part, Of Commonwealth, he defends the theory of absolute sovereignty, the view that the government has all the political power and has the right to control any aspect of life. In the third part, Of a Christian Commonwealth, he critiques concepts like revelation, prophets, and miracles in such a way that it becomes doubtful whether they can be rationally justified. In the fourth part, Of the Kingdom of Darkness, he explains various ways in which priestly religion has corrupted religion and transgressed the rights of the sovereign. In this revised edition of Hobbes's classic work, A.P. Martinich improves Hobbes's punctuation for the sake of clarity. He has also added new notes for readers, extensive cross references, and substantial part of Hobbes's reply to Bramhall's The Catching of Leviathan.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Gilbran","Name":"The prophet","Price":"11.90","Description":"The prophet, Almustafa, has lived in the foreign city of Orphalese for 12 years and is about to board a ship which will carry him home. He is stopped by a group of people, with whom he discusses topics such as life and the&nbsp;human condition. The book is divided into chapters dealing with love, marriage, children, giving, eating and drinking, work, joy and sorrow, houses, clothes, buying and selling, crime and punishment, laws, freedom, reason and passion, pain, self-knowledge, teaching, friendship, talking, time, good and evil, prayer, pleasure, beauty, religion, and death.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Wallace Benn","Name":"Learning About True Spirituality","Price":"3.90","Description":"Most of us could not reply to such a question with a straight answer. We might say that we respect God or fear him. Some would admit to worshipping God, or to even love God - but few are heard to say that they enjoy him. Surely this is wrong! But it is what true spirituality is all about.People outside the church are eager to explore 'spirituality'. Wallace Benn presents here an opportunity to introduce them to something completely fulfilling - or rather 'someone'.Wallace doesn't want you to just believe in God, he wants you to enjoy God. He takes, as his starting point, the epistle to the Philippians because Paul says here that he wants to know Jesus, so that he can know God - and thus have joy.He shows that true spirituality flows out from a personal relationship with Christ and involves increasing your knowledge of him, trusting his, and our, heavenly Father and getting involved in Christ-like service.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"John Stott","Name":"Basic Christianity","Price":"5.90","Description":"In 2006, Christianity Today voted this title to be one of the top 50 books that have shaped evangelicals!Who is Jesus?\"If Jesus was not God in human flesh, Christianity is exploded,\" writes John Stott. \"We are left with just another religion with some beautiful ideas and noble ethics; its unique distinction has gone.\"If Jesus is not who he said he was, and if he did not do what he said he had come to do, the whole superstructure of Christianity crumbles in ruins to the ground. Is it plausible that Jesus was truly divine? And what might this mean for us?John Stott's clear, classic statement examines the historical facts on which Christianity stands. Here is a sound, sensible guide for all who seek an intellectually satisfying explanation of the Christian faith.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Roy Crowne","Name":"The Art Of Connecting: How To Change Your Relationships Forever","Price":"5.90","Description":"Most Christian teenagers are not interested in sharing their faith because doing so seems unnatural, phony, and manipulative. The Art of Connecting helps teenagers discover a new, natural, and real way to live their Christian life that causes people around them to ask them about their hope and joy. Teenagers can learn how to share their faith by building strong relationships with others.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Dalai Lama","Name":"Dalai Lama's Book Of Transformation","Price":"5.90","Description":"This practical little gem will guide and inspire Buddhists and non-Buddhists alike. It contains the Dalai Lama's clear and simple teachings that can be used to transform personal attitudes and generate love, understanding, and wisdom","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"A.C. Grayling","Name":"Thinking Of Answers","Price":"9.90","Description":"The essays in this book, drawn mainly from A. C. Grayling's columns in Prospect, the Dubliner and The Times, are in fact responses to questions set by editors and readers. ~ If beauty existed only in the eye of the beholder, would that make it an unimportant quality? ~ Are human rights political? ~ Can ethics be derived from evolution by natural selection? If both sides in a conflict can passionately believe that theirs is the just cause, does this mean that the idea of justice is empty? ~ Does being happy make us good? And does being good make us happy? ~ Are human beings especially prone to self-deception? As in his previous books of popular philosophy, including the best-selling The Reason of Things and The Meaning of Things, rather than presenting a set of categorical answers Grayling offers instead suggestions for how to think about every aspect of a question, and arrive at one's own conclusions. As a result Thinking of Answers is both an enjoyable and inspirational collection.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"C.S. Lewis","Name":"Screwtape Proposes A Toast","Price":"9.90","Description":"The Screwtape Letters by C.S. Lewis is a classic masterpiece of religious satire that entertains readers with its sly and ironic portrayal of human life and foibles from the vantage point of Screwtape, a highly placed assistant to \"Our Father Below.\" At once wildly comic, deadly serious, and strikingly original, C.S. Lewis's The Screwtape Letters is the most engaging account of temptation--and triumph over it--ever written.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Erich Fromm","Name":"Greatness and limitations of Freuds thought","Price":"15.90","Description":"Renowned social psychologist Erich Fromm's classic study of Freud's most important--and controversial--ideasBestselling philosopher and psychoanalyst Erich Fromm contends that the principle behind Freud's work--the wellspring from which psychoanalysis flows--boils down to one well-known belief: \"And the truth shall set you free.\" The healing power of truth is what Freud used to cure depression and anxiety, cutting through repression and rationalizations, and it provided the foundation for modern psychology. Freud's work, however, was not without its flaws. Though he pioneered many of the practices still in use today, Freud's perspective was imperfect. In \"Greatness and Limitation of Freud's Thought,\" Fromm deepens the understanding of Freud by highlighting not just his remarkable insights, but also his flaws, on topics ranging from dreams to sexuality. This ebook features an illustrated biography of Erich Fromm including rare images and never-before-seen documents from the author's estate.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Dr. Wayne W. Dyer","Name":"Inspiration: Your Ultimate Calling","Price":"16.90","Description":"ThereвЂ™s a voice in the universe calling each of us to remember our purposeвЂ”our reason for being here now, in this world of impermanence. The voice whispers, shouts, and sings to us that this experience of being in form, in space and time, knowing life and death, has meaning. The voice is that of inspiration, which is within each and every one of us.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Thomas A. Harris","Name":"Im ok you're ok","Price":"15.90","Description":"Transactional Analysis delineates three observable ego-states (Parent, Adult, and Child) as the basis for the content and quality of interpersonal communication. \"Happy childhood\" notwithstanding, says Harris, most of us are living out the Not ok feelings of a defenseless child, dependent on ok others (parents) for stroking and caring. At some stage early in our lives we adopt a \"position\" about ourselves and others that determines how we feel about everything we do. And for a huge portion of the population, that position is \"I'm Not OK -- You're OK.\" This negative \"life position,\" shared by successful and unsuccessful people alike, contaminates our rational Adult capabilities, leaving us vulnerable to inappropriate emotional reactions of our Child and uncritically learned behavior programmed into our Parent. By exploring the structure of our personalities and understanding old decisions, Harris believes we can find the freedom to change our lives.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Eric Chaline","Name":"Zen and the art of travel","Price":"17.90","Description":"Zen is a spiritual journey that can transform and enrich our lives. Many of the great Zen masters were themselves world travelers, starting with Bodhidharma, who brought Zen from India to China in the sixth century. Divided into eight meditations, writer Eric Chaline examines how a deeper understanding of the Zen way of life can enrich every journey one takes, from a simple country ramble to an epic journey across the world.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Erich Fromm","Name":"To Have Or To Be?","Price":"15.90","Description":"To Have Or to Be? is one of the seminal books of the second half of the 20th century. Nothing less than a manifesto for a new social and psychological revolution to save our threatened planet, this book is a summary of the penetrating thought of Eric Fromm. His thesis is that two modes of existence struggle for the spirit of humankind: the having mode, which concentrates on material possessions, power, and aggression, and is the basis of the universal evils of greed, envy, and violence; and the being mode, which is based on love, the pleasure of sharing, and in productive activity. To Have Or to Be? is a brilliant program for socioeconomic change.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Erich Fromm","Name":"Man for himself","Price":"14.90","Description":"Erich Fromm fought long and hard for the rights and freedoms of the individual. He also recognized that fundamental to this pursuit is the promotion of self-knowledge. In encouraging people to analyze their own behavior, Fromm identified the crucial link between psychology and ethics that underpins all our actions. Moreover, he saw in this a way out of the meaningless impasse which he regarded as the plight of the modern human race. The task that Fromm sets himself, therefore, in Man for Himself is no less than to identify \"what man is, how he ought to live, and how the tremendous energies within man can be released and used productively.\" The resulting book is ample witness to Fromm's success. It makes for exciting, illuminating, even life-changing reading.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Philip Stokes","Name":"Philosophy: 100 Essential Thinkers","Price":"11.90","Description":"Philosophy in the West has a long and venerable tradition, stretching back to almost six centuries before the birth of Christ. Philosophy 100 Essential Thinkers introduces one hundred of the world's greatest philosophers and locates them within the school to which their work belongs.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Erich Fromm","Name":"The Crisis of Psycho-Analysis: Essays on Freud, Marx, and Social Psychology","Price":"13.90","Description":"Erich Fromm's new book is of special importance in bringing together his basic statements on the application of psychoanalytic theory to social dynamics. It contains the first translation into English of his important early papers on social psychology, which laid the foundation for his synthesis of Marx and Freud. The title essay, specially written for this volume, argues that most psychoanalysis failed to develop Freud's theories in the spirit of a continual unmasking of rationalizations and ideologies.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Stephen Russell","Name":"Twisted Fables For Twisted Minds","Price":"12.90","Description":"Teacher of all things Taoist, including meditation, philosophy, Chinese medicine and T'ai Chi, The Barefoot Doctor follows in the tradition of the barefoot doctors of the Orient, who wandered the hinterlands keeping the locals in good health and spirits. The Barefoot Doctor's followers appreciate his original concept and approach and this fable should further satisfy his readers by breaking out again with this sub-genre of self-help.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Ted Honderich","Name":"The Oxford Companion to Philosophy","Price":"12.90","Description":"With The Oxford Companion to Philosophy, readers have the most authoritative and engaging one-volume reference work on philosophy available, offering clear and reliable guidance to the ideas of all notable philosophers from antiquity to the present day, and to the major philosophical systems around the globe, from Confucianism to phenomenology. 94 illustrations.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Barefoot Doctor","Name":"Handbook for heroes","Price":"12.90","Description":"Calling all heroes of the 21st century! Your time has come! Develop your hero qualities and use them to acquire fame and fortune in a spiritually sound fashion. In the Far East, barefoot doctors, experts in Taoist healing, martial arts and magic, wandered the hinterlands like oriental Robin Hoods, keeping the locals in good health and spirits. Contemporary Barefoot Doctor, romantic hero of modern folklore and author of the cult hit Handbook for the Urban Warrior, wanders the flawed paradise of Planet Earth doing likewise. Now, for the first time, Barefoot Doctor's new manual demystifies the secret Taoist path to wealth, renown and fulfilment in irreverent and high-intensity-entertainment style. For more information on the Barefoot Doctor","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Robin Skynner","Name":"John Cleese | Families And How To Survive Them","Price":"11.90","Description":"What makes a family happy? Why do some marriages 'succeed' and others end in divorce? How can we free ourselves from the legacy of past mistakes and bring about positive change? Love, sex and marriage and parenthood, depression and sadness, independence and experience are just a few of the many issues explored in conversation by family therapist Robin Skynner and his former patient and comedian, John Cleese. Guiding us through the daily issues that confront us all, FAMILIES AND HOW TO SURVIVE THEM offers vital advice in helping each of us to maintain a happy, healthy family life. Looking candidly at everything from our relationships with our parents to why and how we choose our partners, no emotional stone is left unturned: jealousy, rage, fear, envy, love, obsession, hope and despair   all are featured with practical advice on how to turn round a negative situation and bring about change for the better.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Oliver Sacks","Name":"Uncle Tungsten","Price":"13.90","Description":"This memoir from Oliver Sacks is both a departure from and an enhancement of his previous psychologically orientated 'medical' writing. Not only is it a beautifully written account of an English childhood   seasoned by a childish passion for science   but it is told from the intimate and revelatory perspective of one of the most important and humane writers on psychology alive today. Oliver Sacks has the literary artistry of W.H. Auden and the intellectual rigour and questioning mind of Stephen Jay Gould. The world authority in his field, this is a remarkable insight into the mind and background of one of the finest and most accessible scientists today. Case history as literature, in the most personal, delightful and fascinating way possible.&nbsp;","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Daniel Goleman","Name":"Working with emotional intelligence","Price":"0","Description":"Do you want to be more successful at work? Do you want to improve your chances of promotion? Do you want to get on better with your colleagues? Daniel Goleman draws on unparalleled access to business leaders around the world and the thorough research that is his trademark. He demonstrates that emotional intelligence at work matters twice as much as cognitive abilities such as IQ or technical expertise in this inspiring sequel.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Immanuel Kant","Name":"What is enlightenment","Price":"0","Description":"First published in 1784, Kant's immortal essay is now a part of the Penguin Great Ideas series. This series is ideal for readers who want to explore and savor the Great Ideas that have shaped our world.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Julian Baggini","Name":"Making Sense: Philosophy Behind The Headlines","Price":"0","Description":"In Making Sense, Julian Baggini examines the philosophical issues and disputes that lie behind such news stories as the Clinton-Lewinsky affair, the war against terrorism, the siege at Waco, genetically modified foods, and advances in human therapeutic cloning. Baggini, founding editor of the highly popular Philosopher's Magazine, shows how we can use the techniques of philosophy and the insights of its greatest practitioners to understand the issues behind the headlines.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Caterina Rando","Name":"Learn to power think","Price":"0","Description":"\"Learn to Power Think\" offers thoughtful affirmations and 25 step-by-step exercises to help the reader develop a unique, positive, and proactive approach to making decisions and getting the most out of life.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Jared Diamond","Name":"Why is sex fun","Price":"0","Description":"Why are humans one of the few species to have sex in private? Why do humans have sex any day of the month or year, including when the female is pregnant, beyond her reproductive years, or between her fertile cycles? Why are human females one of the few mammals to go through menopause? Human sexuality seems normal to us but it is bizarre by the standards of other animals. Jared Diamond argues that our strange sex lives were as crucial to our rise to human status as were our large brains. He also describes the battle of the sexes in the human and animal world over parental care, and why sex differences in the genetic value of parental care provide a biological basis for the all-too-familiar different attitudes of men and women towards extramarital sex.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Bryan Magee","Name":"The great philosophers","Price":"0","Description":"Conversations with 15 contemporary writers and philosophers provide an accessible and exciting account of Western philosophy and its greatest thinkers. Includes contributions from A.J. Ayer, Bernard Williams, Martha Nussbaum, Peter Singer, and John Searle. 28 halftones.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Joshua Piven; David Borgenicht; Jennifer Worick","Name":"The Worst-Case Scenario Survival Handbook: Dating And Sex","Price":"0","Description":"Just in time for Valentine's Day, here are dozens of scenarios covering every phase of the romantic--or not so romantic--turn of events. Learn how to remove stubborn articles of clothing, slip away from a blind date, and deal with a bad kisser. The creators of the bestselling \"Worst-Case Scenario Survival Handbook\" now present hands-on, step-by-step illustrated instructions to guide readers through these and many more perils d'amor. 2-color diagrams.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Christopher Johnson","Name":"Derrida","Price":"0","Description":"A short book combining extracts from the work of one of the world's greatest thinkers with commentary by one of Britain's most distinguished writers on philosophy.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"C.J. McKnight","Name":"Mysticism the experience of the divine","Price":"0","Description":"Mysticism: The Experience of the Divine&nbsp;is a beautifully illustrated introduction to the divine and daunting tradition of mystical contemplation that marked the religious evolution of the middle ages...(from the distcover)","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Diane Collinson","Name":"Fifty major philosophers","Price":"0","Description":"A comprehensive update of the best-selling first edition, this revitalized new text presents readers with a series of clear, well-written entries focusing on fifty of the most influential philosophers from the last two thousand years. Chosen to present the traditional mainstream of European philosophy, the text also provides a critical survey that meets the needs of readers seeking a broad basic understanding as well as a foundation for further philosophical enquiry. Encompassing a wide range of ancient, medieval and modern philosophers, features of the second edition include: new entries on Dewey, Collingwood, Popper, Quine, Merleau-Ponty, Ayer and Rawls a thorough revision of existing entries a complete update of the further reading section an expanded glossary the addition of an alphabetical table of contents and an index for ease of use. Authoritative and highly readable, this book is a vital reference tool for all those wishing to improve their understanding of some of the world s most fascinating intellectual figures. \"","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Tom Hodgkinson","Name":"The book of idle pleasures","Price":"0","Description":"The Art of Doing Nothing meets The Dangerous Book for Boys in this charming celebration of simple delights. In \"The Book of Idle Pleasures,\" the United Kingdom's expert Idlers Tom Hodgkinson and Dan Kieran stand up for the simple pleasures in life . . . by lying down for a nap. With its tongue firmly in its cheek, \"The Book of Idle Pleasures\" renounces our world of ever-growing consumer overload in favor of the timelessly true adage that the best things in life really are free. Clever and sometimes all too true in its reflections on 100 simple pastimes--among them slouching, skipping stones, staring out the window, doodling, and, natch, taking a nap--\"The Book of Idle Pleasures\" is a charming celebration of simple pleasures for the sake of pleasure itself, making it a soothing antidote for our nonstop culture and an ideal restorative against the costly confusion of our daily existence.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Joshua Piven","Name":"The Worst-Case Scenario Survival Handbook: Parenting","Price":"0","Description":"The authors of the bestselling Worst-Case Scenario Survival Handbook series now keep parents safe, from cradle to teens. From baby-proofing the house to dealing with a dead pet, from the perils of the play-date to explaining about the birds and the bees, this essential guide tells parents what to really expect when their worst-case scenario is all in the family.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Alain De Botton","Name":"The Consolations Of Philosophy","Price":"0","Description":"The Consolations of Philosophy is Alain de Botton's internationally bestselling guide to life. Alain de Botton, bestselling author of How Proust Can Change Your Life, has set six of the finest minds in the history of philosophy to work on the problems of everyday life. Here then are Socrates, Epicurus, Seneca, Montaigne, Schopenhauer and Nietzsche on some of the things that bother us all: lack of money, the pain of love, inadequacy, anxiety; the fear of failure and the pressure to conform. \"Singlehandedly, de Botton has taken philosophy back to its simplest and most important purpose: helping us live our lives.\" (Independent).\"No doubt about it, philosophy is the new rock and roll and Alain de Botton is its Colonel Tom Parker...A pleasure to read. And good writing, like good philosophy, is always a consolation.\" (John Banville, Irish Times). \"Few discussions on the great philosophers can have been so entertaining...an ingenious, imaginative book.\" (Humphrey Carpenter, Sunday Times).\"Witty, thoughtful, entertaining...a stylish book, which manages to make philosophy both enjoyable and relevant.\" (Anthony Clare, Literary Review). \"Gentle, helpful and humane...De Botton's instinct is surely right: if we are to bring philosophy to life we should look again at those thinkers who have sought to be not clever or paradoxical, but simply wise. \" (Roger Scruton, Mail on Sunday).","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Paul Reps","Name":"Zen flesh Zen bones","Price":"0","Description":"When&nbsp;Zen Flesh, Zen Bones&nbsp;was published in 1957 it became an instant sensation with an entire generation of readers who were just beginning to experiment with Zen. Over the years it has inspired leading American Zen teachers, students, and practitioners. Its popularity is as strong today as ever.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"David Boyle","Name":"Authenticity","Price":"0","Description":"David Boyle guides us through the next big thing in Western living -- the determined rejection of the fake, the virtual, the spun and the mass-produced, in the search for authenticity.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Aeon J. Skoble","Name":"The Simpsons and philosophy","Price":"0","Description":"This unconventional and lighthearted introduction to the ideas of the major Western philosophers examines The Simpsons вЂ” TVвЂ™s favorite animated family. The authors look beyond the jokes, the crudeness, the attacks on society вЂ” and see a clever display of irony, social criticism, and philosophical thought. The writers begin with an examination of the characters. Does Homer actually display AristotleвЂ™s virtues of character? In what way does Bart exemplify American pragmatism? The book also examines the ethics and themes of the show, and concludes with discussions of how the series reflects the work of Aristotle, Marx, Camus, Sartre, and other thinkers.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Bertrand Russell","Name":"The problems of philosophy","Price":"0","Description":"A lively and still one of the best introductions to philosophy, this book pays off both a closer reading for students and specialists, and a casual reading for the general public.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Dr. Wayne W. Dyer","Name":"Being in balance","Price":"0","Description":"In this inspirational work, beloved best-selling author&nbsp;Dr. Wayne W. Dyer&nbsp;shows you how to restore balance in your life by offering nine principles for realigning your thoughts so that they correspond to your highest desires.Imagine a balance scale with one end weighted down to the ground, and the other end вЂ“ featuring the objects of your desires вЂ“ sticking up precariously in the air. This scale is a measurement of your thoughts. To restore the same balance that characterizes everything in our universe, you have to take up the weighty thoughts so that they match up to your desires.The seasons reflect the overall harmony of life. For example, winter passes and the blossoms emerge. This is balanced by a need to have the trees rest, so autumn arrives on time and helps the trees ready themselves for another period of repose. This book is dedicated to the idea that weвЂ™re a vital component of this creative process and have within ourselves the wherewithal to create all that we want if we recognize and revise out-of-balance thoughts.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Daniel C. Dennett","Name":"Kinds of Minds: Towards an Understanding of Consciousness","Price":"0","Description":"Combining ideas from philosophy, artificial intelligence, and neurobiology, Daniel Dennett leads the reader on a fascinating journey of inquiry, exploring such intriguing possibilities as: Can any of us really know what is going on in someone elseвЂ™s mind? What distinguishes the human mind from the minds of animals, especially those capable of complex behavior?If such animals, for instance, were magically given the power of language, would their communities evolve an intelligence as subtly discriminating as ours? Will robots, once they have been endowed with sensory systems like those that provide us with experience, ever exhibit the particular traits long thought to distinguish the human mind, including the ability to think about thinking? Dennett addresses these questions from an evolutionary perspective. Beginning with the macromolecules of DNA and RNA, the author shows how, step-by-step, animal life moved from the simple ability to respond to frequently recurring environmental conditions to much more powerful ways of beating the odds, ways of using patterns of past experience to predict the future in never-before-encountered situations.Whether talking about robots whose video-camera вЂќeyesвЂќ give us the powerful illusion that вЂќthere is somebody in thereвЂќ or asking us to consider whether spiders are just tiny robots mindlessly spinning their webs of elegant design, Dennett is a master at finding and posing questions sure to stimulate and even disturb.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Umberto Eco","Name":"Foucaults pendulum","Price":"0","Description":"Foucault's Pendulum&nbsp;is divided into ten segments represented by the ten Sefiroth. The novel is full of esoteric references to the Kabbalah. The title of the book refers to an actual pendulum designed by the French physicist LГ©on Foucault to demonstrate the rotation of the earth, which has symbolic significance within the novel.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"John Brockman","Name":"What We Believe But Cannot Prove","Price":"0","Description":"\"What do you believe is true even though you cannot prove it?\" This was the question posed by John Brockman, to a group of leading scientists and thinkers via his Edge.org website. The subsequent answers created a media storm and prompted a fiery debate about all aspects of science, technology and even the nature of \"proof\". \"What We Believe But Cannot Prove\" brings together the very best answers from the most eminent contributors. Here is Ian McEwan on the absence of an afterlife; Richard Dawkins on the relationship between design and evolution; and Jared Diamond on when humans first reached the Americans. Other contributions from luminaries like Steven Pinker, John Horgan and Martin Rees span the whole range of scientific endeavour and human experience, from the future of computing to the origins of intelligence; from insights into childhood behaviour to cutting-edge cosmology. Thought-provoking and hugely compelling, this collection is both a fascinating insight into the instinctive beliefs of some of the most brilliant minds alive today - and an invitation to answer the question yourself ...","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Gavin Pretor-Pinney","Name":"The Cloudspotter's Guide","Price":"0","Description":"'The clouds are nature's poetry, and the most egalitarian of her displays, since everyone has an equally fantastic view of them. Clouds are for dreamers, and their contemplation benefits the soul. Yet their beauty is so everyday as to be in danger of being overlooked ...' Gavin Pretor Pinney is the chairman and founder member of the Cloud Appreciation Society. He contends that we are blessed in this country with a uniquely rich and varied cloudscape, which has hitherto been sadly undervalued. His book teaches us to appreciate their different varieties -- the cumulus, nimbostratus and Morning Glory to name only a few -- and all their beauties and significances, both meteorological and cultural. We learn how Hindus believed the cumulus clouds were the spiritual cousins of elephants, how thermal air currents act on fair weather cumuli, and how to save a fortune in psychiatric bills by using the clouds as Rorschach images that reflect our state of mind as well as nature's moods. Looking up will never be the same again.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Mayank Chhaya","Name":"Dalai Lama","Price":"0","Description":"Written with the full cooperation of the Dalai Lama, this fascinating, up-to-date biography at once captures the public persona and enduring mystery behind one of the world's most important spiritual leaders. In 1997, the Indian journalist Mayank Chhaya was authorized by the Dalai Lama to write about his life and times. The only authorized biographer who is not a Buddhist, Chhaya conducted more than a dozen personal interviews with the Dalai Lama in McLeod Ganj in India's Himalayan north, home to Tibet's government-in-exile. In Dalai Lama: Man, Monk, Mystic he presents an in-depth, insightful portrait of a figure of perennial interest to people all over the world. Chhaya writes about Tibet and the Buddhist tradition from which the Dalai Lama emerged, helping readers understand the context that shaped his beliefs, politics, and ideals. Adding depth and nuance to his portrait, Chhaya depicts the Dalai Lama in the light of his life in exile and the various roles he has had to assume for his followers. He sheds light on the highly complex conflict between China and Tibet, and offers insights into the growing discontent among young Tibetans who are frustrated with the nonviolent approach to Chinese occupation that the Dalai Lama advocates. A balanced, informative view of the Dalai Lama and his work, this biography is both a compelling profile of a remarkable spiritual leader and his mission, and an engaging look at how the current unrest in his country will affect its future.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Christopher Ross","Name":"Tunnel Visions: Journeys Of An Underground Philosopher","Price":"0","Description":"Christopherr Ross, philosopher and traveller, decided to cease his journeyings and go underground, quite literally. Seeking an antidote to incurable restlessness he chose to work for a year as a Station Assistant on Platform 6 (northbound Victoria Line) at Oxford Circus Station. After Training School, where he is taught how not to electrocute himself and always to look in the eye a member of the public as they are assaulting you, he faces up to his new duties with a mixture of curiosity and foreboding.What, exactly, will he find deep under the surface of London? \"Tunnel Visions\" is a mixture of lived experience in the surreal world of London's Underground and the more elevated ideas, thoughts and imaginings that experience provokes. Oxford Circus Station, complete with its weeping wall, its streakers, buskers, onanists and cupboard containing one employee whose ideal working day was to sleep soundly 100 feet below ground, is a Plato's Cave of reflection and human comedy.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"L Ron Hubbard","Name":"Dianetics","Price":"0","Description":"Albert Einstein said: We are using only 10% of our mental potential. DIANETICS tells you how you can free a significantly larger part of your potential. Self confidence, harmonic relationships and a positive attitude towards life can absolutely be achieved. It makes Positive Thinking a reality. You can achieve your goals with more certainty if you are able to find the cause of upsets, unwanted reactions or emotions. The human mind is not a mysterious puzzle - impossible to resolve. Read and work with Dianetics, see how it works for you and make up your own mind. The book gives a clear description of what is happening in the mind and explains a practical method, enabling you to explore your own subconscious, and rid yourself of what holds you down, resulting in increased IQ and well-being. Watching the DVD called 'How to Use Dianetics' along with the book is recommended to have a visual illustration of the concepts and the practical application.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Alain de Botton","Name":"The Art of Travel","Price":"0","Description":"The \"Art of Travel\" is Alain de Botton's travel guide with a difference: an exploration of why we travel and what we learn when we do. As seen on Channel 4 Few activities seem to promise is as much happiness as going travelling: taking off for somewhere else, somewhere far from home, a place with more interesting weather, customs and landscapes. But although we are inundated with advice on where to travel to, we seldom ask why we go and how we might become more fulfilled by doing so. With the help of a selection of writers, artists and thinkers - including Flaubert, Edward Hopper, Wordsworth and Van Gogh - Alain de Botton's bestselling \"The Art of Travel\" provides invaluable insights into everything from holiday romance to hotel minibars, airports to sightseeing. The perfect antidote to those guides that tell us what to do when we get there, \"The Art of Travel\" tries to explain why we really went in the first place - and helpfully suggest how we might be happier on our journeys. \"Richly evocative, sharp and funny. De Botton proves himself to be a very fine travel writer indeed\". (Sunday Telegraph\"). \"Delightful, profound, entertaining, I doubt if de Botton has written a dull sentence in his life\". (Jan Morris). \"An elegant and subtle work, unlike any other. Beguiling\". (Colin Thubron, \"The Times\"). Alain de Botton was born in 1969 and is the author of non-fiction essays on themes ranging from love and travel to architecture and philosophy. His bestselling books include \"Essays in Love\"; \"The Romantic Movement\"; \"Kiss and Tell\"; \"Status Anxiety\"; \"How Proust Can Change Your Life\"; \"The Pleasures and Sorrows of Work\"; \"The Art of Travel\"; \"The Architecture of Happiness and Religion for Atheists\". He lives in London and founded The School of Life and Living Architecture.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Noam Chomsky","Name":"Selected Readings","Price":"0","Description":"These concise, scholarly essays explore the distinguished philosopher's influential concept of generative grammar. Topics include syntactic structure, features, and categories; phonology, syntax, and semantics; language acquisition; and language teaching.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Erich Fromm","Name":"To have or to be","Price":"0","Description":"To Have Or to Be? is one of the seminal books of the second half of the 20th century. Nothing less than a manifesto for a new social and psychological revolution to save our threatened planet, this book is a summary of the penetrating thought of Eric Fromm. His thesis is that two modes of existence struggle for the spirit of humankind: the having mode, which concentrates on material possessions, power, and aggression, and is the basis of the universal evils of greed, envy, and violence; and the being mode, which is based on love, the pleasure of sharing, and in productive activity. To Have Or to Be? is a brilliant program for socioeconomic change.&nbsp;","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Bertrand Russell","Name":"The Problems Of Philosophy","Price":"0","Description":"'Is there any knowledge in the world which is so certain that no reasonable man could doubt it?' Philosophy is the attempt to answer such ultimate questions, not carelessly and dogmatically, as we might deal with them in ordinary life, but critically, after analysing how and why the questions arise and clarifying the assumptions and concepts on which they are based. This classic work, first published in 1912, has never been supplanted as an approachable introduction to the theory of philosophical enquiry. It gives Russell's views on such subjects as the distinction between appearance and reality, the existence and nature of matter, idealism, knowledge by acquaintance and by description, induction, and the limits and value of philosophical knowledge. This edition includes an introduction by John Skorupski contextualizing Russell's work, and a guide to further reading.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Bertrand Russell","Name":"Principles of social reconstruction","Price":"0","Description":"This book, originally entitled Why Men Fight, is generally seen as the fullest expression of Russell's political philosophy. Russell argues that after the experience of the Great War the individualistic approach of traditional liberalism has reached its limits. Political theory must be based on the motivated forces of creativity and impulse rather than on competition.Both are best fostered in the family, in education, and in religion - each of which Russell proceeds to discuss. The ideas expressed in Principles of Social Reconstruction have greatly contributed to Russell's fame as a social critic and anti-war activist. The new introduction by Richard Rempel locates them in the context of Russell's other writings and show that neither his ideas nor his language have lost their force and topicality over the years.","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Malcolm Gladwell","Name":"Blink | The Power Of Thinking Without Thinking","Price":"0","Description":"Intuition is not some magical and mysterious property that arises unbidden from the depths of our mind. It is a product of long hours and intelligent design, of meaningful work enviroments and particular rules and principles. For too long we have thought of intuition as a kind of black box at the very core of who we are and why we act the way we do. This book shows us how we can hone our instinctive ability to know in an instant, helping us to bring out the best in our thinking and become better decision makers in our homes, offices and in everyday life. Just as he did with his revolutionary theory of the tipping point, Gladwell reveals how the power of blink' could fundamentally transform our relationships, the way we consume, create and communicate, how we run our businesses and even our societies.You'll never think about thinking in the same way again","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Field Guide To Dreams","Name":"How To Identify And Interpret The Symbols | Kelly Regan","Price":"0","Description":"You wake up in a sweat, or crying, or with a heartbeat so quick you feel like you just ran a mile. Who was the faceless man chasing you over the rainbow? What did it mean when you turned around and kissed him? Why did he not say anything about you being naked? Why were you naked? Whether you want to find out what a dream symbol or person means or to discover their common themes and interpretations, \"Field Guide to Dreams\" will guide you to the keys of your subconscious. Featuring useful tools to decipher the phenomena of your dreams, \"Field Guide to Dreams\" identifies symbols, patterns, and meanings of common dream sequences, including how Freud and Jung would each interpret them","Category":{"CategoryName":"Philosophy & Psychology"}},{"Author":"Benjamin Hoff","Name":"The Tao of Pooh","Price":"0","Description":"The author's explanations of Taoist philosophy and Te a Chinese word meaning virtue of the small) through Pooh and Piglet show that philosophy is not remote, but something that can be used by everyone in the here and now.","Category":{"CategoryName":"Philosophy & Psychology"}}]