[{"Author":"E E Cummings","Name":"Erotic poems","Price":"34.90","Description":"Many years ago the prodigious and famously prolific E. E. Cummings sat in his study writing and thinking about sex. His private brooding gave way to poems and drawings of sexual and romantic love that delight and provoke.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"William Shakespear","Name":"As You Like It","Price":"7.90","Description":"As You Like ItWilliam Shakespeare (baptised 26 April 1564) was an English poet and playwright, widely regarded as the greatest writer in the English language and the world's pre-eminent dramatist.He is often called England's national poet and the \"Bard of Avon\" (or simply \"The Bard\"). His surviving works consist of 38 plays, 154 sonnets, two long narrative poems, and several other poems. His plays have been translated into every major living language, and are performed more often than those of any other playwright.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Thomas Hardy","Name":"Collected Poems","Price":"12.90","Description":"With an Introduction, Bibliography and Glossary by Michael Irwin, Professor of English Literature University of Kent at Canterbury. Thomas Hardy started composing poetry in the heyday of Tennyson and Browning. He was still writing with unimpaired power sixty years later, when Eliot and Yeats were the leading names in the field. His extraordinary stamina and a consistent individuality of style and vision made him a survivor, immune to literary fashion. At the start of the twenty-first century his reputation stands higher than it ever did, even in his own lifetime. He is now recognised not only as a great poet, but as one who is widely loved. He speaks with directness, humanity and humour to scholarly or ordinary readers alike.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Kahlil Gibran","Name":"A second treasury","Price":"13.90","Description":"The poet, philosopher and artist, Kahlil Gibran - the \"prophet of Lebanon\" - lived from 1883 to 1931. This second selection of his work contains four books of poetry, translated into English by Anthony Ferris.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Sebastian Barry","Name":"Hinterland: A Play","Price":"11.90","Description":"A new play from the author of The Steward of Christendom, loosely based on the Charles Haughey Presidency. Johnny Silvester, from Derry, a successful but now retired Prime Minister of the Republic, lives in some opulence just outside Dublin. Daisy, his wife, is on her way to the country to see her cousin for the weekend but Johnny is staying at home to speak to a student coming to question him for her history PhD. In the course of the weekend, old domestic wounds are re-opened and Johnny's integrity in office is finally challenged.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Leonard Cohen God Is Alive Magic Is Afoot","Name":"Unknown","Price":"23.90","Description":"Leonard Cohen God Is Alive Magic Is Afoot&nbsp;God Is Alive, Magic Is Afoot is a poem/mantra from Cohen's second novel, Beautiful Losers. The piece is an extraordinary flash of optimism, of hope, of the celebration of a life force that is both God and Magic. It remains one of the most accessible pieces of writing from Leonard Cohen and is certainly one of his most beautiful works.The illustrations have been specially commissioned to complement the text, and the result is not only a beautiful book that every Cohen fan will want to own, but one that will surely bring him to an even wider audience.Hardcover","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Gilbran","Name":"The prophet","Price":"11.90","Description":"The prophet, Almustafa, has lived in the foreign city of Orphalese for 12 years and is about to board a ship which will carry him home. He is stopped by a group of people, with whom he discusses topics such as life and the&nbsp;human condition. The book is divided into chapters dealing with love, marriage, children, giving, eating and drinking, work, joy and sorrow, houses, clothes, buying and selling, crime and punishment, laws, freedom, reason and passion, pain, self-knowledge, teaching, friendship, talking, time, good and evil, prayer, pleasure, beauty, religion, and death.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Signed Book THE TALKING HORSE Mark Haddon","Name":"Unknown","Price":"24.90","Description":"Signed Book&nbsp;THE TALKING HORSE Mark HaddonThe talking horse and the Sad girl and the Village under the SeaOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.That Mark Haddon's first book after&nbsp;The Curious Incident of the Dog in the Night-Time&nbsp;was a poetry collection perhaps came as a surprise to his legions of fans; that it is a collection of such virtuosity and range did not. The gifts so admired in Haddon's prose are in strong evidence here too - the humanity of his voices, the dark humour and the uncanny ventriloquism - but Haddon is also a writer of considerable seriousness, lyric power and surreal invention, and&nbsp;The Talking Horse and the Sad Girl and the Village Under the Seacombines bittersweet love-lyrics, lucid and bold new versions of Horace, comic set-pieces, lullabies, wry postmodern shenanigans (including a note from the official board of censors on \"18\" certificate poetry), and an entire John Buchan novel condensed to five pages.&nbsp;","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Les Murray","Name":"Taller When Prone","Price":"9.90","Description":"Taller When Prone has at its heart Les Murray's celebrations of the rural world in Australia and elsewhere, evoked with a deep understanding of landscapes, and the seasons, working lives and languages that have shaped them. Stories and songs, fragments of conversations, memories and satire comprise this varied, habitable world. In Murray's vigorous and sinuous language, 'song and story are pixels / in a mirrorball', reflecting back to us endless possibilities.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Moliere","Name":"Don Juan: And Other Plays","Price":"9.90","Description":"Moli 'ere's prose plays demonstrate both his versatility as a playwright and the reasons for his enduring popularity from the France of Louis XIV to the present. This book is intended for general, paricularly those interested in drama; students of comparative literature, French drama, and French seventeenth-century literature.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Collected Poems Of A. E. Housman","Name":"Poetry Library","Price":"12.90","Description":"Collected Poems Of A. E. Housman | Poetry LibraryFive stars for the edition; four or perhaps four+ for&nbsp;Houseman's&nbsp;poetry. This is an excellent collection and good value for dollar. It includes the major pieces in a readable, well bound, inexpensive format.&nbsp;Houseman's&nbsp;output is such that it can be read and enjoyed in a brief period of time, so pour a drink, find the comfy chair and enjoy. Crime writers take note: Houseman's verse may not be uniformly superb, but it contains a number of&nbsp;brilliant passages&nbsp;which have served very nicely as epigraphs for&nbsp;crime novels.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Leonard Cohen","Name":"Book of longing","Price":"0","Description":"Book of Longing is Leonard Cohen's astonishing new collection of poems, the first since Book of Mercy was published nearly three decades ago. Leonard Cohen made his name as a poet before he came to worldwide attention as a singer and songwriter. Book of Longing, his new collection of poetry, was twenty years in the making and written in Montreal, Mumbai and during his retirement in Mt Baldy. Enhanced by Cohen's own playful and provocative illustrations, these poems show the full range of one of the most influential and enigmatic writers of his generation.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Charles Bukowski","Name":"Mockingbird wish me luck","Price":"0","Description":"Mockingbird Wish Me Luck captures glimpses of Charles Bukowski's view on life through his poignant poetry: the pain, the hate, the love, and the beauty. He writes of lechery and pain while finding still being able to find its beauty.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"E E Cummings","Name":"Selected Poems","Price":"0","Description":"This is the first selection from the poems of e.e. cummings to be published since 1959, five years before the poet's death. The 156 poems selected by cummings' biographer are arranged in twelve sections, each preceded by an illustration by cumming","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Dr Maya Angelou","Name":"Just Give Me A Cool Drink Of Water","Price":"0","Description":"Tenderly, joyously, sometimes in sadness, sometimes in pain, Maya Angelou writes from the heart and celebrates life as only she has discovered it. In this moving volume of poetry, we hear the multi-faceted voice of one of the most powerful and vibrant writers of our time. \"The wisdom, rue and humor of her storytelling are borne on a lilting rhythm completely her own, the product of a born writer's senses nourished on black church singing and preaching, soft mother talk and salty street talk, and on literature: James Weldon Johnson, Langston Hughes, Richard Wright, Shakespeare and Gorki.\" -- \"The New York Times Book Review.\" \"Black, bitter and beautiful, she speaks of our survival.\" -- James Baldwin.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Clive Bloom","Name":"American Poetry: The Modernist Ideal","Price":"0","Description":"Tracing its origins back to Walt Whitman, the Modernist tradition in American poetry is driven by the same concern to engage with the world in revolutionary terms, inspired by the concept of democracy vital to the American dream. But this tradition is not confined to a few writers at the beginning of the century: instead it has been an enduring force, extending from coast to coast and of varying hues: Imagist, Objectivist, Beat. International in flavour but shaped by the language and conditions of America, this poetry continues to speak to us today.This collection of specially commissioned essays brings together leading scholars and critics to define the American Modernist canon, providing a range of perspectives helpful to all those interested in this fascinating poetry.","Category":{"CategoryName":"Poetry & Plays"}},{"Author":"Bazzano","Name":"Haiku for lovers","Price":"0","Description":"Love is the most complicated and yet the simplest of emotions. Haiku poetry, with its clarity and poignancy, is able to wonderfully capture the different moods of this intensely human condition. This anthology features the work of poets - both ancient and modern - from around the world.","Category":{"CategoryName":"Poetry & Plays"}}]