[{"Author":"Eric Schlosser","Name":"Reefer Madness","Price":"11.90","Description":"Schlosser, author of \"Fast Food Nation, \" offers an unprecedented view of the nexus of ingenuity, greed, high-mindedness, and hypocrisy that is American culture. He reveals the vast and fascinating workings of the shadow economy by focusing on marijuana, pornography, and illegal migrant workers.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Louis Theroux","Name":"The Call Of The Weird: Travels In American Subcultures","Price":"9.90","Description":"The Call Of The Weird: Travels In American SubculturesNo, it doesn't get much weirder than this: Thor Templar, Lord Commander of the Earth Protectorate, who claims to have killed ten aliens. Or April, the Neo-Nazi bringing up her twin daughters Lamb and Lynx (who have just formed a white-power folk group for kids called Prussian Blue), and her youngest daughter, Dresden.For a decade now,&nbsp;Louis Theroux&nbsp;has been making programs about offbeat characters on the fringes of U.S. society. Now he revisits the people who have most intrigued him to try to discover what motivates them, and why they believe the things they believe.From his Las Vegas base (where else?), Theroux calls on these assorted dreamers, schemers, and outlaws--and in the process finds out a little about the workings of his own mind.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Michael Norton","Name":"365 Ways To Change The World","Price":"9.90","Description":"365 Ways To Change The WorldYou want to change the world? Of course you do. But where do you begin? This ingenious handbook shows how the smallest actions can impact on your local community and the wider world. Packed with ideas and facts from leading campaign organisations, it suggests one action for every day of the year.Some are intriguing, many are unusual, a few involve fundraising, almost all can be planned or done from your home or computer, most will be fun, all are achievable.They include: support trade justice: buy three footballs; avoid landfills by freecycling; create a lifeline for remote African villages with a wind-up radio; sow the seeds of a green revolution: guerrilla gardening; organise a fundraising event: speed dating for safer childbirth; get out of debt: join the Church of Stop Shopping; fight child slavery with fairtrade chocolate; and influence the world's media: become a blogger.This is the book to get you started...one day at a time.","Category":{"CategoryName":"Politics & Society"}},{"Author":"David King","Name":"The Hot Topic","Price":"7.90","Description":"The Hot TopicWe all know that global warming is a problem, but the blizzard of information and misinformation on the subject makes it hard to know what to do.The Hot Topic&nbsp;is the first book to set out the problems and the solutions in a straightforward way - no hidden agenda, no breast-beating, no hair shirts. Science - how the climate is already changing and what the future is likely to bring Adaptation - preparing for the changes we can't stop Technological solutions - new, clean ways to live, travel and keep the lights on Political solutions - the inside track on what it will take to bring the whole world to the same negotiating table, and how to deal with the 'problem' countries - China, India, Russia and the US Personal and local solutions - what you can do and why it will make a difference","Category":{"CategoryName":"Politics & Society"}},{"Author":"Anatole Kaletsky","Name":"Capitalism 4.0","Price":"7.90","Description":"Capitalism 4.0'The global financial crisis of 2007 to 2009 ruined businesses and banks, individuals and even nations, and seemed to land a mortal blow to the capitalist system. But capitalism has not been destroyed, rather it has been irrevocably altered: the forces that precipitated the crisis are now contributing to the evolution of a new, stronger version of the capitalist model.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Libby Brooks","Name":"The Story Of Childhood: Growing Up In Modern Britain","Price":"7.90","Description":"The Story Of Childhood: Growing Up In Modern BritainChildren now make up forty per cent of the world's population. The bestseller charts would suggest that we savour stories of unhappy upbringings - are in fact greedy for them, the worse the better - but in today's ASBO-afflicted Britain, it is clear that there is much we don't understand about contemporary childhood.Children today are the focus of much of society's anxieties: about behaviour, nutrition, sexuality, consumerism, achievement, responsibility, about what exactly is the proper shape of a life.But, how does it really feel to be growing up today, from the inside? This extraordinary book tracks ten very different children between the ages of two and sixteen, each chosen for how they illuminate a particular archetype of childhood experience, or an especial locus of adult anxiety.Woven through each chapter are trips into more discursive territory, but essentially, this is childhood told from the inside: a travel book about a state of being, telling the story of contemporary childhood with the help of those who still reside there.&nbsp;\"Childhood\"&nbsp;is a truly remarkable piece of writing that unearths many unusual truths about adulthood too.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Randall Baker","Name":"Bulgariana","Price":"24.90","Description":"A light-hearted view of life in todayвЂ™s Bulgaria written during two long stays in the country in 2008. The author brings a British sense of humor to bear on the many small things that make this a unique place. He does this through the lives of a number of Bulgarians dealing with life and the Global Financial Crisis. The book provides a unique insight by an outsider of the many things that Bulgarians take for granted, and reflects on the daily remark by Bulgarians вЂњвЂ¦if this was a вЂњnormal&nbsp;countryвЂќ but it wouldnвЂ™t be the Bulgaria the author loves if it were a normal countryвЂ”whatever that is. The book is well-illustrated and is written as the events unfold, giving a real sense of вЂњbeing there.вЂќ","Category":{"CategoryName":"Politics & Society"}},{"Author":"Michel Foucault","Name":"The history of sexuality 1","Price":"26.90","Description":"Why has there been such an explosion of discussion about sex in the West since the seventeenth century? Here, one of France's greatest intellectuals explores the evolving social, economic, and political forces that have shaped our attitudes toward sex.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Christopher Booker","Name":"Scared to Death: From BSE to Global Warming","Price":"11.90","Description":"This book tells the inside story of each of the major scares of the past two decades, showing for the first time how they have followed a remarkably consistent pattern.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Aldous Huxley","Name":"Point Counter Point","Price":"12.90","Description":"Aldous Huxley's lifelong concern with the dichotomy between passion and reason finds its fullest expression both thematically and formally in his masterpiece&nbsp;Point Counter Point. By presenting a vision of life in which diverse aspects of experience are observed simultaneously, Huxley characterizes the symptoms of \"the disease of the modern man\" in the manner of a composer--themes and characters are repeated, altered slightly, and played off one another in a tone that is at once critical and sympathetic.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Jean Paul Sartre","Name":"The age of reason","Price":"12.90","Description":"The first volume in his Roads to Freedom trilogy, Jean-Paul Sartre's The Age of Reason is a philosophical novel exploring existentialist notions of freedom, translated by Eric Sutton with an introduction by David Caute in Penguin Modern Classics. Set in the volatile Paris summer of 1938, The Age of Reason follows two days in the life of Mathieu Delarue, a philosophy teacher, and his circle in the cafes and bars of Montparnasse. Mathieu has so far managed to contain sex and personal freedom in conveniently separate compartments. But now he is in trouble, urgently trying to raise 4,000 francs to procure a safe abortion for his mistress, Marcelle. Beyond all this, filtering an uneasy light on his predicament, rises the distant threat of the coming of the Second World War.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Tim Flannery","Name":"We are the weather makers","Price":"11.90","Description":"In this adaptation of his massive international bestseller The Weather Makers , now revised for teen readers, Tim Flannery argues passionately and eloquently for the urgent need to address the global crisis that is threatening our survival. With expanded Canadian content and added illustrations, We Are the Weather Makers sets out, with devastating clarity, the science and evidence of global warming, and the perils of complacency.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Andrew Furlong","Name":"Tried for Heresy","Price":"9.90","Description":"This is the remarkable true story of Andrew Furlong and how he was forced out for stating what many in the Church believe to be true the historic Jesus and the Christ of salvation are different figures","Category":{"CategoryName":"Politics & Society"}},{"Author":"Siddhartha Deb","Name":"The Beautiful And The Damned","Price":"12.90","Description":"From leadership seminars in fancy hotels to medieval figures walking from town to town looking for work in small town factories; from the naive waitresses working in the mecca of five star hotels to farmers struggling to grow the right crops for the 21st century, Siddhartha Deb's book is the riveting, moving, darkly comic, brilliantly told story of modern India. With the novelist's vision, reminiscent of V.S. Naipaul's \"An Area of Darkness\", combined with the modern narrative force of \"Maximum City\", Deb's account paints a portrait of this country in turmoil through the story of its people: aspiring and deluded, desperate and hopeful, beautiful and damned.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Neill Sean","Name":"The Suicide Factory","Price":"12.90","Description":"Two veteran journalists tell the inside story of convicted hate-monger Abu Hamza, his infamous Finsbury Park Mosque and how it turned out a generation of militants willing to die - and kill - for their cause...In the heightened atmosphere following the terrorist attacks on 9/11, Mostafa Kemal Mostafa, aka. Abu Hamza al-Masri, was a gift to tabloid newspapers. His prosthetic hook hand, glass eye and rabid pronouncements as imam of the Finsbury Park Mosque made him the very image of a bogeyman, easily caricatured and ultimately dismissed by intelligence analysts who judged him offensive, but essentially foolish. They were wrong. In this chilling investigation, senior news journalists Daniel McGrory and Sean O'Neill reveal that the imam recently convicted for inciting murder and racial hatred not only indoctrinated vulnerable young Muslims into a firebrand version of Islam, but supported Taliban leaders, had direct contact with al-Qaeda and recommended recruits for terrorist training camps in Afghanistan.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Annettte Kuhn","Name":"Womens pictures","Price":"15.90","Description":"This pioneering and influential work of feminist theory has been extensively updated by the author to chart the changes in feminist film theory and practice between the eighties and the nineties. Readers, whether engaged in the making of films, the study of them, or simply the pleasure of viewing them, will appreciate the way in which the author discusses and demystifies the current methods of analysis, including semiotic and psychoanalytical approaches. The films used as points of discussion are drawn from both mainstream and alternative cinema, institutions which are themselves examined in relation to their production, distribution and exhibition practices. The thesis proposed by Annette Kuhn is an exciting one: namely, that feminism and cinema, taken together, could provide the basis for new forms of expression, providing the opportunity for a truly feminist alternative cinema in terms of film language, of reading that language and of representing the world.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Bridget Watson Payne","Name":"This is happening","Price":"12.90","Description":"Over 100 million people use the Instagram app to take beautiful, lo-fi-looking photos of the special moments in their lives and then instantly share them with the world. This is Happening is the first-ever crowd-sourced book of Instagram photos, all capturing that single, fleeting moment that makes us happy and just begs to be photographed--the perfect cup of coffee, a scenic moment on the morning commute, the joy of new shoes, a loved one's shy smile. Featuring over 200 stunning shots by as many distinctive photographers, this petite yet chunky volume is an inspiring showcase of the easily-overlooked details that fill us with wonder each day, all captured through the dreamy lens of Instagram","Category":{"CategoryName":"Politics & Society"}},{"Author":"Stephen J Dubner","Name":"Super freakonomics","Price":"15.90","Description":"Chinese edition of SuperFreakonomics: Global Cooling, Patriotic Prostitutes, and Why Suicide Bombers Should Buy Life Insurance by Steven D. Levitt and Stephen J. Dubner challenges with its extraordinary Vietnamesews and unique perspectives on the hidden side of everything again. New York Times, Amazon's #1 bestseller. In Traditional Chinese. Distributed by Tsai Fong Books, Inc.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Ian Bone","Name":"Bash the Rich: True-Life Confessions of an Anarchist in the UK","Price":"12.90","Description":"In 1984, \"The People\" newspaper branded Ian Bone 'the most dangerous man in Britain'. They weren't far wrong. From the inner city riots of 1981 to the miners' strike and beyond the butler's son and founder of Class War was indeed a greater thorn in Margaret Thatcher's side than the useless blatherings of the Official Opposition. Class War were the real opposition! It was Ian Bone who linked the inner city rioters of Brixton and Handsworth with the striking miners.It was Bone who \"The People\" spotted rioting with miners in Mansfield, attacking laboratories with the Animal Liberation Front and being fingered by the \"Guardian\" as the man behind the 1985 Brixton Riot. But that was only the half of it...from 1965 to 1985, from Swansea to Cardiff and London the mayhem spread countrywide. In \"Bash The Rich,\" Ian Bone tells it like it was. From The Angry Brigade to The Free Wales Army, from the 1967 Summer of Love to 1977 anarcho-punk, from Grosvenor Square to the Battle of the Beanfield from the Stop the City riots to Bashing the Rich at the Henley Regatta, Ian Bone breaks his silence.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Terry Eagleton","Name":"Why Marx Was Right","Price":"11.90","Description":"In this combative, controversial book, Eagleton takes issue with the prejudice that Marxism is dead and done with. Taking 10 of the most common objections to Marxism, he demonstrates in each case what a woeful travesty of Marx's own thought these assumptions are.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Thomas Hobbes","Name":"Leviathan","Price":"12.90","Description":"Thomas Hobbes's Leviathan is the greatest work of political philosophy in English and the first great work of philosophy in English. In addition, it presents the fundamentals of his beliefs about language, epistemology, and an extensive treatment of revealed religion and its relation to politics. Beginning with premises that were sometimes controversial, such as that every human action is caused by the agent's desire for his own good, Hobbes derived shocking conclusions, such as that the civil government enjoys absolute control over its citizens and that the sovereign has the right to determine which religion is to be practiced in a commonwealth. Hobbes's contemporaries recognized the power of the arguments in Leviathan and many of them wrote responses to it. Selections from books by John Bramhall, Robert Filmer, Edward Hyde, George Lawson, William Lucy, Samuel Pufendorf and Thomas Tenison are included in this edition. Leviathan is divided into four parts: In the first part, Of Man, Hobbes presents a view of human beings and of the natural world in general that is materialistic and mechanistic. In the second part, Of Commonwealth, he defends the theory of absolute sovereignty, the view that the government has all the political power and has the right to control any aspect of life. In the third part, Of a Christian Commonwealth, he critiques concepts like revelation, prophets, and miracles in such a way that it becomes doubtful whether they can be rationally justified. In the fourth part, Of the Kingdom of Darkness, he explains various ways in which priestly religion has corrupted religion and transgressed the rights of the sovereign. In this revised edition of Hobbes's classic work, A.P. Martinich improves Hobbes's punctuation for the sake of clarity. He has also added new notes for readers, extensive cross references, and substantial part of Hobbes's reply to Bramhall's The Catching of Leviathan.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Misha Glenny","Name":"The Fall Of Yugoslavia: The Third Balkan War","Price":"12.90","Description":"In this penetrating book--now with a new chapter covering events through 1995, including U.S. involvement--Misha Glenny offers a sobering eyewitness chronicle of the countdown to war, exploring the human realities behind the headlines, and puts one of the most ferocious civil wars of our time into its true, historical context. Winner of the Overseas Press Club Award for Best Book on Foreign Affairs.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Misha Glenny","Name":"Mcmafia: Seriously Organised Crime","Price":"12.90","Description":"When an appalling and seemingly inexplicable murder shattered the peace of a quiet English suburban street it revealed the extent to which organised crime has now seeped into our lives, often without our knowledge. In his groundbreaking book Misha Glenny takes us on a journey through the new world of international organised crime, from gun runners in Ukraine to money launderers in Dubai, by way of drug syndicates in Canada and cyber criminals in Brazil. During his investigation into the dark side he spoke to countless gangsters, policemen and victims of organised crime, while also exploring the ferocious consumer demands for drugs, trafficked women, illegal labour and arms across five continents. This constantly riveting account unveils the nature of crime in today's world but it also offers profound insights into the pitfalls of globalisation where the rules dividing the legal from the illegal are often far from clear.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Michelle Baker","Name":"Queer Facts: The Greatest Gay And Lesbian Trivia Book Ever","Price":"12.90","Description":"Filled with trivia about gay and lesbian culture, this unique collection of fascinating facts reveals the first openly gay politician to be elected to office as well as the first lesbian soap opera character, as well as many other interesting tidbits.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Hunter S. Thompson","Name":"Gonzo three","Price":"11.90","Description":"A collection of journalism, social commentary, short fiction and autobiography, this book is divided into sections of writing on each decade: 1950s, '60s, '70s, '80s and '90s.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Stephen Jay Gould","Name":"Questioning The Millennium","Price":"12.90","Description":"Gould addresses three questions about the millennium with his typical erudition, warmth, and whimsy: What is the concept of a millennium and how has its meaning shifted over time? How did the projection of Christ s 1,000-year reign become a secular measure? And when exactly does the millennium begin January 1, 2000, or January 2, 2001?\"","Category":{"CategoryName":"Politics & Society"}},{"Author":"Craig Goldman","Name":"Natural born fighters","Price":"11.90","Description":"Plunged into a brutal world that exists beyond the authority of any sporting body,&nbsp;Natural Born Fightersuncovers today's kings of underground combat. From bare-knuckle fights that take place in country lanes and inner-city building sites to bloody, raw gladiatorial cage fighting, you'll meet hard men, villains, gypsies, maybe even the bloke who lives next door to you. They're all connected by a common threadвЂ”they all love fighting, and they'll do anything to win.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Terry Pratchett","Name":"Reaper Man","Price":"11.90","Description":"They say there are only two things you can count on. But that was before Death started pondering the existential. Of course, the last thing anyone needs is a squeamish Grim Reaper and soon his Discworld bosses have sent him off with best wishes anda well-earned gold watch. Now Deathis having the time of his life, findinggreener pastures where he can put hisscythe to a whole new use. But like every cutback in an importantpublic service, Death's demise soon leads to chaos and unrest literally, for those whose time was supposed to be up, like Windle Poons.The oldest geezer in the entire faculty of Unseen University home of magic, wizardry, and big dinners Windle was looking forward to a wonderful afterlife, not this boring been-there-done-that routine. To get the fresh start he deserves, Windle and the rest of Ankh-Morpork's undead and underemployed set off to find Death and save the world for the living(and everybody else, of course). \"","Category":{"CategoryName":"Politics & Society"}},{"Author":"Julie Burchill","Name":"The Guardian columns","Price":"11.90","Description":"The iconoclast of her generation, Julie Burchill - who started her infamous career aged 17 on the \"NME\" - has been thrilling and dismaying readers most recently in the \"Guardian on Saturday\". Whether lampooning the cult of celebrity, old men who behave like young lads, two ex-husbands or the hypocrisy of New Labour and the middle classes, Britain's Worst Mother (a title bestowed on her by the \"Daily Mail\") applies her idiosyncratic and dissecting wit to the world we think is around us. This is a collection of her \"Guardian\" columns from January 1998 through to December 2000, a period that has seen the Kosovan war, the decline and fall of the Dome, and the eventual election of a new American President.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Mark Dow","Name":"Machinery of death","Price":"15.90","Description":"This book is a must read for anybody who purports to have arrived at a conclusion regarding the merits of state execution. It is not an academic examination of the pros and cons of the death penalty in America. Rather, it is a description of state execution arranged in a collection of essays written by people intimately involved in the process. The essays describe the process of state execution from the vantage points of capital defense attorneys, relatives of the victims of capital crimes, and even state executioners. It even includes the transcript of an actual execution that occurred in Georgia in 1984.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Malcolm Gladwell","Name":"what the dog saw","Price":"0","Description":"In What the Dog Saw Malcolm Gladwell covers everything from criminology to spaghetti sauce to show how the most ordinary subjects can illuminate the most extraordinary things about ourselves and our world. Looking under the surface of the seemingly mundane, he explores the underdogs, the overlooked, the curious, the miraculous and the disastrous, and reveals how everyone and everything contains an incredible story. What the Dog Saw is Gladwell at his very best - asking questions and finding surprising answers.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Noam Chomsky","Name":"Rogue States","Price":"0","Description":"Noam Chomsky argues that, contrary to popular perception, the real arogueA states in the world today are not the dictator-led developing countries we hear about in the news, but the United States and its allies. He challenges the legal and humanitarian reasons given to justify intervention in global conflicts in order to reveal the WestAs reliance on the rule of force. He examines NATOAs intervention in Kosovo, the crisis in East Timor, and US involvement in the Middle East, Southeast Asia and Latin America. Chomsky relies on both historical context and recently released government documents to trace the paths of self-interest and domination that fuelled these violent regional conflicts. Throughout, he reveals the United StatesA increasingly open dismissal of the United Nations and international legal precedent in justifying its motives and actions. Characteristically incisive and provocative, Chomsky demonstrates that the rule of law has been reduced to farce.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Immanuel Kant","Name":"What is enlightenment","Price":"0","Description":"First published in 1784, Kant's immortal essay is now a part of the Penguin Great Ideas series. This series is ideal for readers who want to explore and savor the Great Ideas that have shaped our world.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Noam Chomsky","Name":"Deterring Democracy","Price":"0","Description":"From World War II until the 1980s, the United States reigned supreme as both the economic and the military leader of the world. The major shifts in global politics that came about with the dismantling of the Eastern Bloc have left the United States unchallenged as the pre-eminent military power, but American economic might has declined drastically in the face of competition, first from Germany and Japan and more recently from the newly prosperous countries elsewhere. In this book, Noam Chomsky points to the potentially catastrophic consequences of this imbalance. He reveals a world in which the United States exploits its advantage ruthlessly to enforce its national interests - and in the process destroys weaker nations. Deterring Democracy offers a devastating analysis of American Imperialism, drawing alarming connections between its repression of information inside the US and its aggressive empire-building abroad.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Peter Truscott","Name":"Putins progress","Price":"0","Description":"Vladimir Putin seemed to have come from nowhere when he succeeded the ailing and incompetent Boris Yeltsin as President of Russia in March 2000. It was as if he had taken the Kremlin by stealth - perhaps, it was whispered, using the skills he acquired as a senior agent in the KGB. In fact, Putin's rise to prominence owes more to a combination of canny manoeuvring and blat, the traditional Russian system of cronyism and patronage. PUTIN'S PROGRESS is the first comprehensive exploration in English of Putin's character and offers many insights into his likely legacy, shedding new light on one of the most enigmatic of modern leaders and what it means to live in Putin's Russia.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Alex de Waal","Name":"Darfur","Price":"0","Description":"The humanitarian tragedy in Darfur has stirred politicians, Hollywood celebrities and students to appeal for a peaceful resolution to the crisis. Beyond the horrific pictures of sprawling refugee camps and lurid accounts of rape and murder lies a complex history steeped in religion, politics, and decades of internal unrest. \"Darfur\" traces the origins, organization and ideology of the infamous Janjawiid and other rebel groups, including the Sudan Liberation Army and the Justice and Equality Movement. It also analyzes the confused responses of the Sudanese government and African Union. This thoroughly updated edition also features a powerful analysis of how the conflict has been received in the international community and the varied attempts at peacekeeping","Category":{"CategoryName":"Politics & Society"}},{"Author":"Jennifer McKnight Trontz","Name":"The good citizens handbook","Price":"0","Description":"This crucial collection of real guidance from government, civics, and scouting handbooks of the 1920s through the1960s shows readers how--through proper dental hygiene, a pleasant demeanor, and obedience to even minor laws--they can ensure the health and happiness of nation, neighbor, and kin. 150 illustrations, some in color.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Patrick Matthews","Name":"Cannabis culture","Price":"0","Description":"Over the last 30 years, millions of people have come in contact with cannabis, but there is surprisingly little information available that examines the drug as a whole--its medicinal properties, its function as a commodity traded on a global scale, its role in religion, the many ways it can be cultivated, and its effect on body and mind. In \"Cannabis Culture, \" journalist Patrick Matthews finds that researchers have unraveled the complexities of the plant, uncovering in the process much of the chemistry of our minds and emotions. In addition to scientists, Matthews meets a colorful mix of characters--connoisseurs, criminals, and cultivators--who together make up the new cannabis culture.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Tony Juniper","Name":"How Many Lightbulbs Does it Take to Change a Planet?","Price":"0","Description":"The human world sits on the brink of potentially catastrophic environmental change. If we do not drastically reduce greenhouse gas emissions, and start that process now, then it is projected that by 2050 the cost of climate damage will exceed global GDP. The latest science confirms that there is now only a decade left for action.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Peter L Bernstein","Name":"The power of gold","Price":"0","Description":"From mines to myths, worship to war, art museums to financial markets, the role of gold has been engraved in the annals of human civilization. In the narrative style of his bestselling \"Against the Gods\", Bernstein reveals a record of human nature in the ubiquity of gold.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Noam Chomsky","Name":"Power And Terror: Post 9 11 Talks And Interviews","Price":"0","Description":"In this, his first new book since the international bestseller \"9-11,\" Noam Chomsky presents his latest thinking on terrorism and U.S. foreign policy, focusing on alternatives to the current course of armed provocation. Noam Chomsky is the author of, among many other books, \"Profit over People,\" and the international anti-war bestseller \"9-11,\" which has sold over 300,000 copies worldwide.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Christian Wolmar","Name":"The subterranean railway","Price":"0","Description":"Since the Victorian era, London's Underground has had played a vital role in the daily life of generations of Londoners. In The Subterranean Railway, Christian Wolmar celebrates the vision and determination of the nineteenth-century pioneers who made the world's first, and still the largest, underground passenger railway: one of the most impressive engineering achievements in history. From the early days of steam to electrification, via the Underground's contribution to twentieth-century industrial design and its role during two world wars, the story comes right up to the present with its sleek, driverless trains and the wrangles over the future of the system. The Subterranean Railway reveals London's hidden wonder in all its glory and shows how the railway beneath the streets helped create the city we know today.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Marshall Goldman","Name":"Oilopoly","Price":"0","Description":"Financially crippled and besieged by political crises following the fall of the Soviet Union, it looked as if Russia's days as a superpower had come and gone. That it should recover and go on to accumulate the world's third-largest holdings of foreign currency reserves in less than a decade is nothing short of an economic miracle. \"Oilopoly\" is the riveting tale of this dramatic resurgence, bringing to light the far-reaching and politically troubling implications of Russia's new-found dominance in global energy markets. A story of oil and gas, corruption and naked power, \"Oilopoly\" traces the rise of the Russian oil economy from its origins in the nineteenth century right through to Vladimir Putin's determined efforts to rein in the oil oligarchs, re-nationalize Russia's industries, and pay off its international debt. Charting Putin's astounding success in transforming the country into the world's largest oil producer, Marshall Goldman argues that Russia has rapidly evolved into a new breed of superpower - one whose energy-driven economy can, at the flick of a switch, deprive entire nations of their most important resource. Narrated with panache by a world expert on Russia, this is an indispensable read for anyone interested in world politics and the future of our global energy supply.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Jared Diamond","Name":"Collapse","Price":"0","Description":"In this fascinating book, Diamond seeks to understand the fates of past societies that collapsed for ecological reasons, combining the most important policy debate of this generation with the romance and mystery of lost worlds.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Johnathan Coe","Name":"What a carve up","Price":"0","Description":"What a Carve Up! -&nbsp;a hilarious 1980s political satire by Jonathan CoeIt is the 1980s and the Winshaw family are getting richer and crueller by the year:Newspaper-columnist Hilary gets thousands for telling it like it isn't; Henry's turning hospitals into car parks; Roddy's selling art in return for sex; down on the farm Dorothy's squeezing every last pound from her livestock; Thomas is making a killing on the stock exchange; and Mark is selling arms to dictators.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Sean Wilsey","Name":"State by State: A Panoramic Portrait of America","Price":"0","Description":"Editors Sean Wilsey and Matt Weiland have turned to 50 of the finest, funniest, and foremost writers in America to create a state by state celebration of their country: Jonathan Franzen on New York, Louise Erdrich on North Dakota, Dave Eggers on Illinois, Ann Patchett on Tennessee, Jhumpa Lahiri on Rhode Island-the list goes on. At turns poignant and hysterical, and uniformly insightful, these fifty writers capture the beauty, the kitsch, the unexpected and the quintessential things that make America. There is something and someone in \"State by State\" for everyone. With a roster of bestsellers and award winners, from Ann Patchett to Rick Moody to Myla Goldberg, Wilsey and Weiland have culled the best of the best from the literary creme de la creme to write on something all Americans are interested in: our country.","Category":{"CategoryName":"Politics & Society"}},{"Author":"David Boyle","Name":"Authenticity","Price":"0","Description":"David Boyle guides us through the next big thing in Western living -- the determined rejection of the fake, the virtual, the spun and the mass-produced, in the search for authenticity.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Hunter S. Thompson","Name":"Generation Of Swine","Price":"0","Description":"'Most smart people tend to feel queasy when the conversation turns to things like 'certain death' and 'total failure' and the idea of 'a doomed generation'. But not me. I am comfortable with these themes'. Hunter S. Thompson, celebrated author of \"Fear and Loathing in Las Vegas\", has been writing a weekly column for the \"San Francisco Examiner\" for the last two years.Those columns are collected here to offer a chronicle of the adventures of a Generation of Swine. The incomparable 'Dr Gonzo' has journeyed no small distance in search of intelligent life and reports back, instead, on the demented state of current events. He keeps tabs on the 1998 presidential race, quotes from the Bible (reference books in hotel rooms are supplied exclusively by the Gideons) and asks why the President appears to be a hundred and twenty-eight years old. 'He is working from a dementia that no one in his right mind would want to share. It is the dementia, however, that makes Thompson great' - \"Playboy\". 'His hallucinated vision strikes one as having been, after all, the sanest' - Nelson Algren","Category":{"CategoryName":"Politics & Society"}},{"Author":"Hunter S. Thompson","Name":"Kingdom Of Fear: Loathsome Secrets Of A Star Crossed Child In The Final Days Of The American Century","Price":"0","Description":"'Hot damn! Let us rumble, keep going and don't slow down...let's have a little fun...' In his much-anticipated memoir, Hunter S. Thompson looks back on a long and productive life. It is a story of crazed road trips fueled by bourbon and black acid, of insane judges and giant porcupines, of girls, guns, explosives and, of course, bikes. He also takes on his dissolute youth in Louisville; his adventures in pornography; campaigning for local office in Aspen; and what it's like to accidentally be accused of trying to kill Jack Nicholson. Alongside this 'depraved and terrifying adventure', Hunter S. Thompson exposes the darkness at the heart of America today: a time when the 'goofy child President' and the New Dumb have taken control, and the nation thralls to Bush's War on Terror, War on Evil, War on Iraq, and even War on Fat...a time when fear and loathing are greater than ever.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Misha Glenny","Name":"Darkmarket","Price":"0","Description":"\"This extraordinarily powerful book demonstrates how utterly we lack the shared supranational tools needed to fight cybercrime. Essential reading.\" --Roberto Saviano, author of \"Gommorah\" The benefits of living in a digital, globalized society are enormous; so too are the dangers. The world has become a law enforcer's nightmare and every criminal's dream. We bank online; shop online; date, learn, work and live online. But have the institutions that keep us safe on the streets learned to protect us in the burgeoning digital world? Have we become complacent about our personal security--sharing our thoughts, beliefs and the details of our daily lives with anyone who might care to relieve us of them? In this fascinating and compelling book, Misha Glenny, author of the international best seller \"McMafia,\" explores the three fundamental threats facing us in the twenty-first century: cybercrime, cyberwarfare and cyberindustrial espionage. Governments and the private sector are losing billions of dollars each year fighting an ever-morphing, often invisible and often supersmart new breed of criminal: the hacker. Glenny has traveled and trawled the world. By exploring the rise and fall of the criminal website DarkMarket he has uncovered the most vivid, alarming and illuminating stories. Whether JiLsi or Matrix, Iceman, Master Splynter or Lord Cyric; whether Detective Sergeant Chris Dawson in Scunthorpe, England, or Agent Keith Mularski in Pittsburgh, Pennsylvania, Glenny has tracked down and interviewed all the players--the criminals, the geeks, the police, the security experts and the victims--and he places everyone and everything in a rich brew of politics, economics and history. The result is simply unputdownable. \"DarkMarket\" is authoritative and completely engrossing. It's a must-read for everyone who uses a computer: the essential crime book for our times.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Eve Ensler","Name":"The Vagina Monologues","Price":"0","Description":"I decided to talk to women about their vaginas, to do vagina interviews, which became vagina monologues ...At first women were reluctant to talk. They were a little shy. But once they got going, you couldn't stop them. Women secretly love to talk about their vaginas. They get very excited, mainly because no one's ever asked them before.' Eve Ensler A poignant and hilarious tour of the last frontier, the ultimate forbidden zone, THE VAGINA MONOLOGUES is a celebration of female sexuality in all its complexity and mystery. Hailed as the bible for a new generation of women, it has been performed in cities and colleges throughout the world, and has inspired a dynamic grassroots movement - V-Day - to stop violence against women. Witty and irreverent, compassionate and wise, Eve Ensler's award-winning masterpiece gives voice to real women's deepest fantasies and fears, guaranteeing that no one who reads it will ever look at a woman's body, or think of sex, in quite the same way again.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Dale Carnegie","Name":"How to Enjoy Your Life and Your Job","Price":"0","Description":"A title by the author of HOW TO WIN FRIENDS AND INFLUENCE PEOPLE, which explains how feelings of harmony and purpose can overcome boredom, fatigue and frustration, and how to realise our full potential. First published by Mandarin in 1990.","Category":{"CategoryName":"Politics & Society"}},{"Author":"Do Gentlemen Really prefer Blondes","Name":"Jena Pincott","Price":"0","Description":"Do Gentlemen Really prefer Blondes | Jena Pincott","Category":{"CategoryName":"Politics & Society"}},{"Author":"Malcolm Gladwell","Name":"Blink | The Power Of Thinking Without Thinking","Price":"0","Description":"Intuition is not some magical and mysterious property that arises unbidden from the depths of our mind. It is a product of long hours and intelligent design, of meaningful work enviroments and particular rules and principles. For too long we have thought of intuition as a kind of black box at the very core of who we are and why we act the way we do. This book shows us how we can hone our instinctive ability to know in an instant, helping us to bring out the best in our thinking and become better decision makers in our homes, offices and in everyday life. Just as he did with his revolutionary theory of the tipping point, Gladwell reveals how the power of blink' could fundamentally transform our relationships, the way we consume, create and communicate, how we run our businesses and even our societies.You'll never think about thinking in the same way again","Category":{"CategoryName":"Politics & Society"}},{"Author":"What We Say Goes","Name":"Noam Chomsky","Price":"0","Description":"In this new collection of conversations, \"What We Say Goes\" explores the most immediate and urgent concerns confronting America. As always, Chomsky presents his ideas vividly and accessibly, with uncompromising principle and clarifying insight.","Category":{"CategoryName":"Politics & Society"}}]