[{"Author":"Orson Scott Card","Name":"Enders game","Price":"11.90","Description":"The human race faces annihilation. An alien threat is on the horizon, ready to strike. And if humanity is to be defended, the government must create the greatest military commander in history. The brilliant young Ender Wiggin is their last hope. But first he must survive the rigours of a brutal military training programme - to prove that he can be the leader of all leaders. A saviour for mankind must be produced, through whatever means possible. But are they creating a hero or a monster? This is the multiple award-winning classic ENDER'S GAME - a groundbreaking tale of war, strategy and survival.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Ursula K. Le Guin","Name":"Changing Planes","Price":"11.90","Description":"ARMCHAIR TRAVEL FOR THE MIND: It was Sita Dulip who discovered, whilst stuck in an airport, unable to get anywhere, how to change planes - literally. By a mere kind of a twist and a slipping bend, easier to do than describe, she could go anywhere - be anywhere - because she was already between planes ...and on the way back from her sister's wedding, she missed her plane in Chicago and found herself in Choom. The author, now armed with this knowledge and Rornan's invaluable Handy Planetary Guide - although not the Encyclopedia Planeria, as that runs to forty-four volumes - has spent many happy years exploring places as diverse as Islac and the Veksian plane. Changing Planes is an intriguing, enticing mixture of GULLIVER'S TRAVELS and THE HITCH HIKER'S GUIDE TO THE GALAXY; a cross between Douglas Adams and Alain de Botton: a mix of satire, cynicism and humour by one of the world's best writers. It's both fiction and pop philosophy, and it's all cool!","Category":{"CategoryName":"Sci-fi"}},{"Author":"Jules Verne","Name":"The underground city","Price":"11.90","Description":"A novel about the fortunes of a mining community called Aberfoyle which is near Stirling, Scotland. Miner James Starr, after receiving a letter from an old friend, leaves for the Aberfoyle mine. Although believed to be mined out a decade earlier, James Starr finds a mine overman, Simon Ford, along with his family living deep inside the mine.Simon Ford has found a large vein of coal in the mine but the characters must deal with mysterious and unexplainable happenings in and around the mine. Jules Gabriel Verne (February 8, 1828-March 24, 1905) was a French author who pioneered the science-fiction genre. He is best known for novels such as Journey To The Center Of The Earth (1864), Twenty Thousand Leagues Under The Sea (1870), and Around the World in Eighty Days (1873).","Category":{"CategoryName":"Sci-fi"}},{"Author":"Arthur C. Clarke","Name":"The Last Theorem","Price":"13.90","Description":"The final work from the brightest star in science fiction's galaxy. Arthur C Clarke, who predicted the advent of communication satellites and author of 2001: A Space Odyssey completes a lifetime career in science fiction with a masterwork. 30 light years away, a race known simply as the One Point Fives are plotting a dangerous invasion plan, one that will wipe humankind off the face of the Earth...Meanwhile, in Sri Lanka, a young astronomy student, Ranjit Subramanian, becomes obsessed with a three-hundred-year-old theorem that promises to unlock the secrets of the universe.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"Gold: The Final Science Fiction Collection","Price":"11.90","Description":"The last Isaac Asimov science fiction collection which contains all of his previously uncollected stories. Gold is Isaac Asimov's last science fiction collection' one containing all of his uncollected SF stories that had never before appeared in book form. Gold is the final and crowning achievement of the fifty-five year career of science fiction's transcendent genius' the world-famous author who defined the field of SF for its practitioners' for its millions of readers' and for the world at large. The stories collected here for the first time range from the humorous to the profound' for Asimov was engaged until the end of his days in the work of redefining and expanding the boundaries of the literature he loved' and indeed' helped create. And there is more. For at the heart of this extraordinary compendium is the title story' \"Gold'\" a moving and revealing drama about a writer who gambles everything on a chance at immortality-a gamble Asimov himself made. And won.","Category":{"CategoryName":"Sci-fi"}},{"Author":"David Mitchell","Name":"cloud atlas","Price":"15.90","Description":"By the author of THE THOUSAND AUTUMNS OF JACOB DE ZOET, David Mitchell's bestselling and Booker Prize-shortlisted novel, one of Richard &amp; Judy's 100 Books of the Decade, CLOUD ATLAS has now been adapted for film. The major motion picture, directed by the Wachowskis and Tom Tykwer, stars Tom Hanks, Halle Berry, Susan Sarandon, Jim Sturgess, Ben Whishaw, Jim Broadbent and Hugh Grant. The novel features six characters in interlocking stories, each interrupting the one before it: a reluctant voyager crossing the Pacific in 1850; a disinherited composer blagging a precarious livelihood in between-the-wars Belgium; a high-minded journalist in Governor Reagan's California; a vanity publisher fleeing his gangland creditors; a genetically modified dinery server on death-row; and Zachry, a young Pacific islander witnessing the nightfall of science and civilisation.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"The Winds Of Change","Price":"11.90","Description":"Asimov at his best! A 21-story salute featuring:* A levitating professor* Alien traders bringing something to sell* A black hole hurtling toward Earth* The universe being created* And many other matters of great import!","Category":{"CategoryName":"Sci-fi"}},{"Author":"Alan Dean Foster","Name":"Star Trek into darkness","Price":"12.90","Description":"The official novelization of the blockbuster film! Months after the dramatic events seen in the 2009 blockbuster film Star Trek , the crew of the U.S.S. Enterprise --including Cap-tain James T. Kirk, First Officer Spock, Doctor Leonard McCoy, Lieutenant Nyota Uhura, Chief Engineer Montgomery Scott, Lieu-tenant Hikaru Sulu, and Ensign Pavel Chekov--is called back home. But an unstoppable force of terror from within their own organization has declared all-out war on Starfleet and everything it stands for, leaving Earth in a state of crisis. Now with a personal score to settle as a result, Kirk must lead a covert manhunt to a war-zone world to capture a one-man weapon of mass destruc-tion. As these valiant heroes are propelled into an epic chess game of life and death, love will be challenged, friendships will be torn apart, and sacrifices must be made for the only family Captain Kirk has left: his crew.","Category":{"CategoryName":"Sci-fi"}},{"Author":"K W Jeter","Name":"Blade Runner","Price":"13.90","Description":"K.W. Jeter picks up the tale of Rick Deckard, the `blade runner' created by Phillip K. Dick and popularized by Ridley Scott's cult classic film.&nbsp;&nbsp;Consistent with the sordid vision of 21st century Los Angeles crafted by Dick and Scott, Jeter creates a stylish piece of thrilling, futuristic suspense that finds Deckard not only in the role of hunter, but also hunted.&nbsp;&nbsp;Again, Deckard is on the trail of an replicant, not knowing that it may be the most elusive and dangerous android of all.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Ender's Game","Name":"Orson Scott Card","Price":"14.90","Description":"The human race faces annihilation. An alien threat is on the horizon, ready to strike. And if humanity is to be defended, the government must create the greatest military commander in history. The brilliant young Ender Wiggin is their last hope. But first he must survive the rigours of a brutal military training programme - to prove that he can be the leader of all leaders. A saviour for mankind must be produced, through whatever means possible. But are they creating a hero or a monster? This is the multiple award-winning classic ENDER'S GAME - a groundbreaking tale of war, strategy and survival.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"The naked sun","Price":"11.90","Description":"The electrifying sequel to Caves of Steel in which Elijah Baley is once more teemed up with R. Daneel. The two must travel to Solaria, where no human has gone in over a thousand years...Reacting in fear against the technological superiority of the Outer Worlds, the people of Earth have hidden themselves in vast underground cities, nursing a hatred for Spacers. The fifty Outer Worlds of the Spacers together are home to fewer people than planet Earth. And home to many, many more robots. Earthmen hate Spacer robots, too...But Baley doesn't. He once had a robot partner, R. Daneel - and when the authorities of the planet Solaria request terrestrial assistance in investigating a murder, Baley is once again teamed with Daneel. He is the first Earthman in a millennium to travel to the Outer Worlds...and he must endure the glare of a sun far more deadly than Earth's.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"I, Robot","Price":"12.90","Description":"The classic collection of robot stories from the master of the genre. One of the Voyager Classics collection, now I, Robot is a major Fox movie starring Will Smith. In these stories Isaac Asimov creates the Three Laws of Robotics and ushers in the Robot Age. When Earth is ruled by master-machines, when robots often seem more human than mankind, the Three Laws ensure that humans remain superior and the robots are kept in their rightful place. But an insane telepathic robot results from a production error; a robot assembled in space logically deduces its superiority to non-rational humanity; and when machines serve mankind rather than individual humans, the machine's idea of what is good for society may itself contravene the sacred Three Laws...Amazing and timeless robot stories from the greatest science fiction writer of all time.","Category":{"CategoryName":"Sci-fi"}},{"Author":"E. A. Burtt","Name":"The metaphysical foundations of modern science","Price":"15.90","Description":"Originally published: The metaphysical foundations of modern physical science. 2nd, rev. ed. Garden City, N.Y.: Doubleday, 1954.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Scott Westerfeld","Name":"The risen empire","Price":"12.90","Description":"The undead Emperor has ruled the Eighty Worlds for sixteen hundred years. His is the power to grant immortality to those he deems worthy, creating an elite class known as the Risen. Along with his sister, the eternally young Child Empress, his power within the empire has been absolute. Until now. The empire's great enemies, the Rix, hold the Child Empress hostage. Charged with her rescue is Captain Laurent Zai. But when Imperial politics are involved the stakes are unimaginably high, and Zai may yet find the Rix the least of his problems. On the homeworld, Zai's lover, Senator Nara Oxham, newly appointed to the Emperor's War Council, must prosecute the war with the Rix while holding the inhuman impulses of the Risen councillors in check. If she fails at either task, millions will die. And at the centre of everything is the Emperor's great lie: a revelation so shattering that he is willing to sanction the death of entire worlds to keep it secret ...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Arthur C Clarke","Name":"2010 Odyssey two","Price":"11.90","Description":"This sequel to 2001: a space odyssey answers the questions left by its predecessor. Captain Chandler investigates the lapse in Hal's sanity and the disappearance of Dave Bowman.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Gary Gibson","Name":"Nova war","Price":"12.90","Description":"In Stealing Light, Dakota discovered the Shoal's dark and dangerous secret, now she works towards stopping not only the spread of this knowledge, but also the onset of the Nova war. Found adrift near a Bandati colony world far away from Consortium space, Dakota and Corso find themselves prisoners of the Bandati. It becomes rapidly clear to them, that the humanity's limited knowledge of the rest of the galaxy -- filtered through the Shoal -- is direly inaccurate. The Shoal have been fighting a frontier war with a rival species, the Emissaries, with their own FTL technology for over fifteen thousand years. Realising that the Shoal may be the Galaxy's one chance at sustained peace, Dakota is forced to work with Trader to prevent the spread of deadly knowledge carried on board the Magi ships. But it seems that the Nova War is inevitable...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Alfred Bester","Name":"The computer connection","Price":"11.90","Description":"Recruited by a band of immmortals, Cherokee physicist Dr. Guess seizes control of Extro, the supercomputer that controls all mechanical activity on Earth, with a plan to end all political repression and further his research into the evolution of a race of superman. When Extro overcomes Geuess instead, the immortals suddenly are faced with a fight that will determine the future of Earth.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Douglas Adams","Name":"Don't Panic &amp; The Hitchhiker's Guide To The Galaxy","Price":"11.90","Description":"Told in the same fanciful, irreverent style as the Hitchhiker trilogy, with scraps of scripts, letters and comments from Adams, Don't Panic is the perfect companion to one of the most successful series in publishing history.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Signed Book HALCYON DRIFT Brian Stableford","Name":"Unknown","Price":"24.90","Description":"Signed Book HALCYON DRIFT Brian StablefordOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.In a galactic culture that extends from quasi-Utopian worlds like New Alexandria to vermin-infested slums like Old Earth, starship pilots have become the great romantic heroes of the day. When Star-Pilot Grainger is rescued from a shipwreck, he finds himself pressed into reluctant service to fly the Hooded Swan, the prototype of a new kind of interstellar ship. He's also picked up an alien parasite that's determined to share his brain. Under these dire circumstances, can Grainger possibly stay out of trouble? Not a chance!Hardcover","Category":{"CategoryName":"Sci-fi"}},{"Author":"David West Reynolds","Name":"Star Wars Episode I : The Visual Dictionary Star Wars","Price":"15.90","Description":"This new Visual Dictionary features annotated photographs and film stills from The Phantom Menace. Along with stunning visual images it offers details of the Star Wars universe - the characters, equipment, costumes and armaments of the long-awaited prequel to the original Star Wars trilogy.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Ray Bradbury","Name":"Long after midnight","Price":"12.90","Description":"In twenty-two stories of amazing range and variety, Ray Bradbury once again works his special magic, sounding out life's mysteries in the past, present, and the future.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Moray Laing","Name":"The Ood (Doctor Who Files #14)","Price":"11.90","Description":"No description available","Category":{"CategoryName":"Sci-fi"}},{"Author":"Robert Sheckley","Name":"Mindswap","Price":"11.90","Description":"In the future, interstellar travel to alien worlds will be too expensive for most ordinary people. It certainly is for Marvin, a college student who wants to take a really good vacation. And so he signs up for what he can afford, a mindswap, in which your consciousness is swapped into the body of an alien lifeform. But Marvin is unlucky, and finds himself in the body of an interstellar criminal, a body that he has to vacate fast. But that criminal consciousness has stolen Marvin's earthly body, and Marvin has to find a body on the black market. Travel from world to world with Marvin, each one crazier than the last, as he keeps finding far from ideal bodies in awful situations, just to stay alive","Category":{"CategoryName":"Sci-fi"}},{"Author":"Vincent King","Name":"Another end","Price":"7.90","Description":"The story follows a \"Rider\" named Adamson, one of many of the \"Race\" sent out into the universe with probes in the search of other life. \"Riders\" are essentially immortal as their probes serve to rebuild them each and every time they die, hence the title \"Another End\".","Category":{"CategoryName":"Sci-fi"}},{"Author":"Douglas Adams","Name":"Life, The Universe And Everything","Price":"11.90","Description":"Thirty years of celebrating the comic genius of Douglas Adams...After a series of events which have involved Arthur Dent being alternately blown up and insulted in more bizarre regions of the Galaxy that he has ever dreamt existed, he finds himself stranded on Prehistoric Earth. Luckily an amazing rescue by Ford Prefect and a time eddy, cleverly disguised as a sofa, lands them in the middle of Lords two days before the world is due to end. It's just not cricket...Volume Three in the Trilogy of FiveIn consequence of a number of stunning catastrophes, Arthur Dent is surprised to find himself living in a hideously miserable cave on prehistoric Earth. However, just as he thinks that things cannot get possibly worse, they suddenly do. He discovers that the Galaxy is not only mind-boggingly big and bewildering but also that most of the things that happen in it are staggeringly unfair. VOLUME THREE IN THE TRILOGY OF FIVE.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Gerry Davis","Name":"Doctor Who And The Cybermen","Price":"11.90","Description":"In 2070, the Earth's weather is controlled from a base on the moon. But when the Doctor and his friends arrive, all is not well. They discover unexplained drops of air pressure, minor problems with the weather control systems, and an outbreak of a mysterious plague. With Jamie injured, and members of the crew going missing, the Doctor realises that the moonbase is under attack. Some malevolent force is infecting the crew and sabotaging the systems as a prelude to an invasion of Earth. And the Doctor thinks he knows who is behind it: the Cybermen. This novel is based on 'The Moonbase', a Doctor Who sci-fi story that was originally broadcast from 11 February-4 March 1967. Featuring the Second Doctor as played by Patrick Troughton, and his companions Polly, Ben and Jamie.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Peter Grimwade","Name":"Doctor Who Time-Flight","Price":"11.90","Description":"On a standard flight from New York to London, Concorde Golf Victor Foxtrot is nearing Heathrow Airport when its signal begins to break up. Before long all trace of the aircraft is lost - the Concorde has disappeared! Arriving at Heathrow shortly after, the Doctor, along with Nyssa and Tegan, is enlisted by the authorities to help in the investigation of the missing craft.Boarding a similar Concorde, and following the same flight path, the Doctor finds traces of disturbance and, although they arrive safely at Heathrow, they discover that they have travelled 140 million years into the past!As the Doctor and the crew struggle to come to terms with their situation they are faced with many important questions - What is the significance of a mysterious nearby citadel and who is the strange magician Kalid who lives there? How can they evade the deadly Plasmaton energy creatures? And just how are the events on prehistoric Earth connected to the fate of an ancient race of aliens called the Xeraphin?As the Doctor struggles for answers he discovers that many of them may be explained by the unexpected appearance of an old and very unwelcome enemy.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Hand of Fear","Price":"11.90","Description":"Eldrad was once hailed as the saviour of the world of Kastria. He erected force-barriers around the planet, preventing its imminent destruction. However, when the Kastrians refused to submit to his dictatorship, he removed his force-fields, condemning an entire civilisation to a slow and agonising death. For this, the mightiest of crimes, the people of Kastria sentenced Eldrad to obliteration.Millions of years later, the Doctor's TARDIS materialises in an English quarry. A freak accident traps the Doctor's young friend, Sarah Jane Smith, under tons of rock. When she is rescued, she is frantically clinging to a large stone hand. Taken to a local hospital, it soon becomes clear that Sarah has been possessed.After she goes missing - still clutching the hand - the Doctor follows the trail of death and destruction to a nearby atomic power station.What strange power does the hand have over Sarah? Why has she fought her way to the very core of the nuclear reactor? How can she possibly survive the normally lethal radiation? To answer these questions, the Doctor must travel across the galaxy to a long-dead world - after which, life will never be quite the same again...&nbsp;","Category":{"CategoryName":"Sci-fi"}},{"Author":"Gerry Davis","Name":"Doctor Who and The Tenth Planet","Price":"11.90","Description":"The Sergeant blinked again. Three lights were moving towards him through the murk of the blizzard. Even as he looked, the lights changed into three tall, straight figures, clad in silver-armored suits, advancing across the ice with a slow, deliberate step. Horror-struck, the Sergeant reached for his gun, and a stream of bullets sprayed across the marching figures. BUT THEY CONTINUED MARCHING...The CYBERMEN have arrived. The first invasion of Earth by this invincible, fearless race - and the last thrilling adventure of the first DOCTOR WHO.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who nad The Brain of Morbius","Price":"11.90","Description":"Tom Baker, regarded by many as being the definitive Doctor Who, narrates this novelization based on a serial from the original TV series. Why do so many spaceships crash-land on Karn, a bleak, lonely and seemingly deserted planet? Are they doomed by the mysterious powers of the strange, black-robed Sisterhood, jealously guarding their secret of eternal life? Or does the mad Dr. Solon, for some evil purpose of his own, need the bodies of the victims - and more especially, the body of Doctor Who?","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Mutants","Price":"11.90","Description":"What was happening to the people of Solos? Why are they gradually turning into Monsters? Hands that become claws, flesh that turns scale-like...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who Meglos","Price":"11.90","Description":"Zastor, Leader of the planet Tigella, rules a divided people. Savants and Deons are irrevocably opposed on one crucial issue - the Dodecahedron, mysterious source of all their power.To the Savants the Dodecahedron is a miracle of science to be studied, observed and used to benefit Tigellan civilisation. To the Deons it is a god and not to be tampered with.When the power supply begins to fluctuate wildly the whole planet is threatened, but the Tigellans cannot agree how they should deal with the problem.Zastor welcomes the arrival of the Doctor and invites him to arbitrate, but the Deons are suspicious of the Time Lord - and perhaps rightly so...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who Warriors of The Deep","Price":"11.90","Description":"The year is 2084, and two power-blocs are poised on the brink of war. Using a series of undersea complexes and deep-space satellites, each bloc carefully monitors the other's movements, slowly edging towards the moment when one will launch an all-out nuclear attack on the other.Arriving on Sea Base Four, the Doctor, Tegan and Turlough are rapidly drawn into the web of intrigue which enmeshes this era's paranoid political manoeuvrings. Not everyone on board the base is working for the same team, and the officer directly responsible for implemementing the base's nuclear capability has died in mysterious circumstances.Amid this already tenses atmosphere, the crew of Sea Base Four faces an even greater threat to mankind. The Silurians and Sea Devils, prehistoric reptiles who went into hibernation millions of years before, have reawoken and intend to launch another attempt to reclaim the Earth from humanity.The Doctor must tackle enemy sabotage and face the Myrka, a giant marine monster - but can he prevent the Silurians from implementing their 'final solution' - launching the missiles to start a war that threatens to wipe out the human race?","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Revenge of The Cybermen","Price":"11.90","Description":"A mysterious plague strikes Space Beacon Nerva, killing its victims within minutes. When Doctor Who lands, only four humans remain alive. One of these seems to be in league with the nearby planet of gold, Voga... Or is he in fact working for the dreaded Cybermen, who are now determined to finally destroy their old enemies, the Vogans?The Doctor, Sarah and Harry find themselves caught in the midst of a terrifying struggle to the death - between the ruthless, power-hungry Cybermen and the desperate determined Vogans.&nbsp;","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Image of The Fendahl","Price":"11.90","Description":"When a tussle with a sonic time scan leads the TARDIS back to Earth, the Doctor and Leela discover strange happenings in a nearby lab run by the secretive Dr Fendelman. By night an eight million year old skull glos with a devastating power, leaving destruction in its wake. Already two people lie dead in mysterious circumstances. The Doctor is appalled. Can the Fendahl, the creature from his childhood fairytales, really be emerging from its twelve million year hibernation? And if so, can he stop its energy-draining progress through the Earth's population? The very safety of the planet depends upon it...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Philip Martin","Name":"Doctor Who Mission to Magnus","Price":"11.90","Description":"The TARDIS has been pulled off course and sent hurtling through space and time. When it finally stops, Peri is amazed to witness the Doctor's transformation into a cringing coward.The takeover of the TARDIS by the school bully from the class of the fourth millennium on Gallifrey is only the first of the Doctor's problems. On the surface of the planet Magnus more of his old enemies are conspiring to trick the planet's all-female rulers; the Doctor and Peri have to foil a plot to freeze the entire world and wipe out most of the population.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Malcolm Hulke","Name":"Doctor Who and The Space War","Price":"11.90","Description":"'Doctor!' screamed Jo. 'Look at that thing. It's coming straight at us!' A small, black spaceship, about a mile away, was approaching rapidly. It had no lights, no markings. But some instinct told Jo that the tiny craft meant danger. The year is 2540, and two powers loom large in the Galaxy - Earth and Draconia. After years of peace, their spaceships are now being mysteriously attacked and cargoes rifled. Each suspects the other and full-scale war seems unavoidable.The Doctor, accused of being a Draconian spy, is thrown into prison. And only when the Master appears on the scene do things really begin to move...Geoffrey Beevers, who played an incarnation of the Master in the classic BBC TV \"Doctor Who\" series, reads Malcolm Hulke's complete and unabridged novelisation, based on the TV adventure \"Frontier in Space\" and first published by Target Books in 1976. 'BBC Audiobooks has chosen well with its books and has taken the right approach with its readers...they benefit from new music and sound effects' - \"Doctor Who Magazine\".","Category":{"CategoryName":"Sci-fi"}},{"Author":"Brian Hayles","Name":"Doctor Who and The Curs of Peladon","Price":"11.90","Description":"Again, the terrifying cry rang out. The Doctor quickened his pace along the gloomy tunnels of the castle. Suddenly, from the darkness lumbered the mighty Aggedor, Royal Beast and Protector of the Kingdom of Peladon!The Doctor fumbled in his pocket. Would the device work? As he trained the spinning mirror on the eyes of Aggedor, the terrible claws came closer and closer...What is the secret behind the killings on the Planet of Peladon? Is Aggedor seeking revenge because the King of Peladon wants his kingdom to become a member of the Galactic Federation? Will the Doctor escape the claws of Aggedor and discover the truth?","Category":{"CategoryName":"Sci-fi"}},{"Author":"David Fisher","Name":"Doctor Who and The Leisure Hive","Price":"11.90","Description":"The Argolin-Foamasi War lasted for just 20 minutes, during which time the planet of Argolis was turned into a blasted cinder - a radioactive wasteland deadly to almost all.The few surviving members of the now ageing and sterile Argolin race made a remarkable decision: the story of their people and the husk of their world would stand as a lesson to the galaxy about the horrors of war. The planet would become the most unlikely of holiday resorts...To the Doctor and Romana, Argolis seems like a restful and fascinating place to relax after their recent adventures. They can take in the beauty of the multi-coloured shifting sands from the safety of the towering Leisure Hive, and catch up with Argolin advances in the obscure science of tachyonics.Typically enough, however, murder and intrigue follow the time travellers wherever they go; and a lunatic's plan to restore Argolis' proud warrior past could, quite literally, tear the Doctor and his friend apart...","Category":{"CategoryName":"Sci-fi"}},{"Author":"David Fisher","Name":"Doctor Who and The Creature From The Pit","Price":"11.90","Description":"Tom Baker, regarded by many as being the definitive Doctor Who, narrates this novelization based on a serial from the original TV series. The planet Chloris is very fertile, but metal is in short supply, and has therefore become extremely valuable. A huge creature, with most unusual physical properties, arrives from an alien planet which can provide Chloris with metal from its own unlimited supplies, in exchange for chlorophyll. However, the ruthless Lady Adrasta has been able to exploit the shortage of metal to her own advantage, and has no wish to see the situation change. The Doctor and Romana land on Chloris just as the creature's alien masters begin to lose patience over their ambassador's long absence. The action the aliens decide to take will have devastating consequences for Chloris, unless something is done to prevent it.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Carnival of Monsters","Price":"11.90","Description":"Novelization of the&nbsp;Doctor Who&nbsp;TV episodes/story of the same name. The Doctor and Jo take the TARDIS on a test flight. They arrive on a cargo ship, the SS Bernice, that appears to be crossing the Indian Ocean in 1926 but is in fact trapped inside a miniscope вЂ” a banned peepshow of miniaturised life-forms вЂ” on the planet Inter Minor. They enter another section of the scope but find themselves confronted by ferocious Drashigs. The Doctor eventually breaks out of the scope and returns to full size. The device is owned by a pair of Lurman entertainers, Vorg and Shirna, who hope to make a quick profit from Inter Minor's hitherto reclusive natives.&nbsp;","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Armageddon Factor","Price":"11.90","Description":"The Doctor, Romana and K-9 conclude their search for the segments that make up the powerful Key to Time.Arriving on the planet Atrios, the Doctor and his companions become embroiled in the Atrians' seemingly endless war with their neighbouring planet of Zeos. Their ruler, the Princess Astra, has been kidnapped, leaving the deranged Marshal in sole charge of the war effort. However, the Marshal is being controlled, receiving orders from behind a strange black mirror in the command centre.The Doctor learns that no-one on Atrios has ever seen a Zeon, and travels to Zeos in an attempt to bring the war to an end, and hopefully find the Princess Astra - who seems to be linked in some way to the Sixth Segment. He finds the planet deserted, run entirely by a huge computer, Mentalis. When the Marshal launches an all-out final attack on Zeos, Mentalis responds by activating its Armageddon Program - rather than lose the war, the computer will destroy everything.However, a third planet hangs in space between Atrios and Zeos, shielded from their sensors. This is the lair of the Shadow. He has been waiting for the Doctor to arrive, manipulating the war to his advantage. He is willing to use the Doctor's own friends against him and he wants the Key to Time.Although the Doctor's quest is nearly over, he begins to realise that he may lose everything. For the Shadow is a servant of the Black Guardian.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Eric Saward","Name":"Doctor Who The Twin Dilemma","Price":"11.90","Description":"Colin Baker reads this thrilling novelization of a classic Doctor Who adventure, his debut as the Sixth Doctor. The Doctor has regenerated, having sacrificed his fifth persona to save PeriвЂ™s life. But things are not going well.On this occasion the process of regeneration is by no means smooth, for the evenвЂ“tempered, goodвЂ“humored Fifth Doctor has given way to a rather disturbed and unsettled successor. In a particularly irascible moment, the new Doctor comes dangerously close to committing a shocking crime. Overwhelmed with guilt for his violent behavior, the repentant Time Lord decides to become a hermit...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Douglas Adams","Name":"The Hitchhiker Trilogy","Price":"0","Description":"THE HITCHIKER'S GUIDE TO THE GALAXY: One Thursday lunchtime the Earth gets demolished to make way for a hyperspace bypass. For Arthur, who has just had his house demolished, this is too much. Sadly, the weekend's just begun. THE RESTAURANT AT THE END OF THE UNIVERSE: When all issues of space, time, matter and the nature of being are resolved, only one question remains: Where shall we have dinner? The Restaurant at the End of the Universe provides the ultimate gastronomic experience and, for once, there is no morning after. LIFE, THE UNIVERSE AND EVERYTHING: In consequence of a number of stunning catastrophes, Arthur Dent is surprised to find himself living in a hideously miserable cave on prehistoric Earth. And then, just as he thinks that things cannot possibly get any worse, they suddenly do.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Iain M. Banks","Name":"Consider Phlebas","Price":"0","Description":"TLS The war raged across the galaxy. Billions had died, billions more were doomed. Moons, planets, the very stars themselves, faced destruction, cold-blooded, brutal, and worse, random. The Idirans fought for their Faith; the Culture for its moral right to exist. Principles were at stake. There could be no surrender. Within the cosmic conflict, an individual crusade. Deep within a fabled labyrinth on a barren world, a Planet of the Dead proscribed to mortals, lay a fugitive Mind. Both the Culture and the Idirans sought it. It was the fate of Horza, the Changer, and his motley crew of unpredictable mercenaries, human and machine, actually to find it, and with it their own destruction.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"Foundation's Edge","Price":"0","Description":"It is 498 years since the two Foundations came into existence - half-way through the Interregnum planned by Hari Seldon. The Second Foundation has once more successfully concealed its existence so that the laws of psychohistory can operate to usher in a new Empire ruled by the mental sciences. The Second Foundation is thought to be extinct...except by Councilman Golan Trevize.","Category":{"CategoryName":"Sci-fi"}},{"Author":"James Gleick","Name":"Chaos","Price":"0","Description":"This book brings together different work in the new field of physics called the chaos theory, an extension of classical mechanics, in which simple and complex causes are seen to interact. Mathematics may only be able to solve simple linear equations which experiment has pushed nature into obeying in a limited way, but now that computers can map the whole plane of solutions of non-linear equations a new vision of nature is revealed. The implications are staggeringly universal in all areas of scientific work and philosophical thought.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Alfred Bester","Name":"Tiger Tiger","Price":"0","Description":"One hundred and seventy days adrift in the fathomless black frost of space, Gulliver Foyle, Mechanic's Mate 3rd Class, is at the end of his tether. But Gulliver doesn't know that he's the 24th century's most valuable commodity","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"The Rest Of The Robots","Price":"0","Description":"The Rest of the Robots is the third timeless, amazing and amusing volume of Isaac Asimov's robot stories, offering golden insights into robot thought processes. Asimov's Three Laws of Robotics have since been programmed into real computers the Massachusetts Institute of Technology and used as the outline for a legal robotic charter in Korea. ROBOT TONY is the first robot designed to perform domestic duties by the US Robots and Mechanical Men Corporation. Is it Tony's fault that the lady of the house where he's field tested falls in love with him? - ROBOT AL was intended for shipment to a mining outfit on the moon. Instead, he's loose in the mountains of Virginia...building from scraps of junk his very own, very dangerous disintegrator. - ROBOT LENNY answers workaday questions in babytalk. So why is Dr Susan Calvin, the world's top robopsychologist, fascinated by this messed up specimen of an industrial robot?","Category":{"CategoryName":"Sci-fi"}},{"Author":"Iain M. Banks","Name":"Use of weapons","Price":"0","Description":"The man known as Cheradenine Zakalwe was one of Special Circumstances' foremost agents, changing the destiny of planets to suit the Culture through intrigue, dirty tricks or military action. The woman known as Diziet Sma had plucked him from obscurity and pushed him towards his present eminence, but despite all their dealings she did not know him as well as she thought. The drone known as Skaffen-Amtiskaw knew both of these people. It had once saved the woman's life by massacring her attackers in a particularly bloody manner. It believed the man to be a burnt-out case. But not even its machine intelligence could see the horrors in his past.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"Foundation","Price":"0","Description":"The first volume in Issac Asimov's world-famous saga, winner of the Hugo Award for Best All-Time Novel Series. Long after Earth was forgotten, a peaceful and unified galaxy took shape, an Empire governed from the majestic city-planet of Trantor. The system worked, and grew, for countless generations. Everyone believed it would work forever. Everyone except Hari Seldon. As the great scienctific thinker of his age Seldon could not be ignored. Reluctantly, the Commission of Public Safety agreed to finance the Seldon Plan. The coming disaster was predicted by Seldon's advances in psychohistory, the mathematics of very large human numbers, and it could not be averted. The Empire was doomed.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Audrey Niffenegger","Name":"The time travelers wife","Price":"0","Description":"This extraordinary, magical first novel is the story of Clare, a beautiful art student, and Henry, a librarian, who have known each other since Clare was six and Henry was thirty-six, and were married when Clare was twenty-two and Henry thirty. Impossible but true, because Henry is one of the first people diagnosed with Chrono-Displacement Disorder: periodically his genetic clock resets and he finds himself misplaced in time, pulled to moments of emotional gravity in his life, past and future. His disappearances are spontaneous, his experiences unpredictable, alternately harrowing and amusing.\"The Time Traveler's Wife\" depicts the effects of time travel on Henry and Clare's marriage and their passionate love for each other as the story unfolds from both points of view.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"The Robots Of Dawn","Price":"0","Description":"Called to the Spacer world to solve a case of roboticide, New York City detective Elijah Baley teams up with humanoid robot R. Daneel Olivaw. Together they are tasked with proving that the prime suspect, a renowned roboticist, is innocent of the crime. Plain clothes man Elijah Baley must travel to the planet Aurora to investigate the murder of Robot Jander. He would rather not. His last trip off-Earth on police business resulted in a TV drama being made of the case - as a result of which even his son Bentley suspects Elijah had an affair with Gladia Delmarre, the murder suspect whom he proved innocent. Not only does Gladia now live on Aurora, the murdered robot belonged to her...and was her lover! Elijah is teamed once more with Robot Daneel, and they are joined by another interesting robot, Giskard. The investigation should benefit from a secret and unique ability possessed by Robot Giskard. But Elijah is disturbed by his presence, sensing perhaps that Giskard's positronic brainpaths function to a hidden agenda. What Giskard knows but Elijah does not is that the future of mankind in space hangs on the outcome of this investigation...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Isaac Asimov","Name":"Forward the foundation","Price":"0","Description":"The days of the Empire are numbered. On the Imperial world of Trantor, Cleon II rules over a multitude of worlds slowly descending into anarchy. Two individuals' destinies intertwine in the fight against chaos - Hari Seldon, and Eto Demerzel, a robot and the real power behind Cleon's throne.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Signed Book SONGS OF THE DYING EARTH George R R Martin","Name":"Unknown","Price":"0","Description":"Signed Book SONGS OF THE DYING EARTH George R R MartinOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Songs of the Dying Earth: Stories in Honor of Jack Vance&nbsp;is a collection of short fiction and shorter essays composed in appreciation of the&nbsp;science fiction&nbsp;and&nbsp;fantasy&nbsp;author&nbsp;Jack Vance, especially his&nbsp;Dying Earth&nbsp;series. Edited by&nbsp;George R.R. Martin&nbsp;and Gardner Dozois, it was published in 2009 by&nbsp;Subtererranean Press.&nbsp;Twenty-two authors contributed short fiction and an Afterword, about thirty pages on average. Fifteen of the stories are novelettes (7500 to 17,500 words), six are shorter, and&nbsp;The Guiding Nose of UlfГ¤nt BanderЕЌz&nbsp;by Dan Simmons is a novella&nbsp;highlighted on the cover of the second U.S. edition.","Category":{"CategoryName":"Sci-fi"}},{"Author":"George Mann","Name":"The Solaris Book of New Science Fiction","Price":"0","Description":"An eclectic collection of all-original science fiction stories from some of the foremost luminaries in the genre. Featuring new tales of far future murder, first contact, love and war from such well-regarded and award winning authors as Peter F. Hamilton, Stephen Baxter, Adam Roberts, Jeffrey Thomas, Eric Brown, Paul Di Filippo, Neal Asher, Jay Lake and Ian Watson, this collection is sure to delight all fans of good science fiction. \"A wide range of topics and diverse styles characterizes this enjoyable collection of science-fiction stories. While mediocre science fiction fails to work on any level other than the conceptual, the best of the stories in this new Solaris anthology successfully navigate both conceptual and emotional territory... Editor Mann has gathered a collection that should appeal to science-fiction buffs, and make a worthwhile introduction for novices. Stands as proof that science fiction is alive and well.\" Kirkus Discoveries, VNU US Literary Group","Category":{"CategoryName":"Sci-fi"}},{"Author":"James Dashner","Name":"The Maze Runner","Price":"0","Description":"When the doors of the lift crank open, the only thing Thomas remembers is his first name. But he's not alone. He's surrounded by boys who welcome him to the Glade - a walled encampment at the centre of a bizarre and terrible stone maze. Like Thomas, the Gladers don't know why or how they came to be there \\- or what's happened to the world outside. All they know is that every morning when the walls slide back, they will risk everything \\- even the Grievers, half-machine, half-animal horror that patrol its corridors, to try and find out.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Eoin Colfer","Name":"And Another Thing","Price":"0","Description":"Released to coincide with the 30th anniversary of the bestselling works \"The Hitchhiker's Guide to the Galaxy\" and \"Artemis Fowl, And Another Thing . . .\" continues the popular series started by the late Douglas Adams.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Stephen Wyatt","Name":"Doctor Who The Greatest Show in The Galaxy","Price":"0","Description":"The TARDIS takes the Doctor and Ace to the planet Segonax, the latest home of the famous Psychic Circus. But Ace finds the clowns a bit creepy and would much rather stay out in the sun, which may be just as well...This is no ordinary circus and people come from planets far and wide to audition for the opportunity to take part. But there's a darker side to the show - who are the three members of the audience upon whose whims the performers' lives depend? And why is the Chief Clown driving a hearse and trying to capture the local youths?The Doctor decides to investigate further and, while Ace tries to befriend some of the more terrified workers, he realises that the Psychic Circus is really a front for a far older, and deadlier, menace from his past. He and Ace must ward off killer bus conductors, werewolves, the walking dead, and some murderous robot clowns before they can hope to stop an evil from the very dawn of history...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Ian Marter","Name":"Doctor Who The Invasion","Price":"0","Description":"Materialising in outer space, the TARDIS is attacked by a missile fired from the dark side of the moon. Back on Earth, the newly-formed United Nations Intelligence Taskforce, led by Brigadier Lethbridge-Stewart, is disturbed by a series of UFO sightings over Southern England. Meanwhile, a large consignment of mysterious crates is delivered to the headquarters of International Electromatix, the largest computer and electronics firm in the world. Three seemingly unconnected events вЂ” but in reality the preparations for a massive Cyberman invasion of Earth with one aim вЂ” the total annihilation of the human race.&nbsp;","Category":{"CategoryName":"Sci-fi"}},{"Author":"Nigel Robinson","Name":"Doctor WhoThe Time Meddler","Price":"0","Description":"When the TARDIS materialises on an apparently deserted Northumbrian beach, Steven disputes the Doctor's claim that they have travelled back to the eleventh century. The discovery of a modern wristwatch in a nearby forest merely reinforces his opinion.But it is 1066, the most important date in English history, and the Doctor's arrival has not gone unnoticed. Observing the appearance of the TARDIS is a mysterious monk who recognises the time-machine for what it is. He also knows that the Doctor poses a serious threat to his master plan - a plan which, if successful, could alter the future of the entire world...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Claws of Axos","Price":"0","Description":"'Axos calling Earth, Axos calling Earth...'The creatures stood before them, beautiful golden humanoids, offering friendship and their priceless Axonite, in return for вЂ” what?Only Doctor Who remains suspicious. What is the real reason for the Axons' sudden arrival on Earth? And why is the evil Master a passenger on their spaceship? He very soon finds out...","Category":{"CategoryName":"Sci-fi"}},{"Author":"Bill Strutton","Name":"Doctor Who and The Zarbi","Price":"0","Description":"The Zarbi, huge ant-like creatures with metallic bodies and pincer claws, are waiting for Tardis [sic] when its police-box shape materializes on the cold and craggy planet Vortis. They capture Doctor Who, Ian and Vicki and take them to their weird Headquarters, a city of web-like organic matter.But the Zarbi are not the only beings on Vortis. Barbara has fallen into the hands of the butterfly-like creatures with soft voices and iridescent wings, whose civilisation has been destroyed by the Zarbi. She learns that her captors are only the advance party of Menoptera in exile who plan to win back their planet by an invasion from outer space. For the Zarbi 'have brought the dark age to Vortis'.In the final thrilling chapters, Doctor Who and the crew of Tardis encounter the power which controls both the Zarbi and the living Web City. How can they defeat this strange bladder of blazing light which draws in and absorbs all who come into its presence?","Category":{"CategoryName":"Sci-fi"}},{"Author":"Terrance Dicks","Name":"Doctor Who and The Auton Invasion","Price":"0","Description":"Put on trial by the Time Lords, and found guilty of interfering in the affairs of other worlds, the Doctor is exiled to Earth in the 20th century, his appearance once again changed. His arrival coincides with a meteorite shower. But these are no ordinary meteorites.The Nestene Consciousness has begun its first attempt to invade Earth using killer Autons and deadly shop window dummies. Only the Doctor and UNIT can stop the attack. But the Doctor is recovering in hospital, and his old friend the Brigadier doesn't even recognise him. Can the Doctor recover and win UNIT's trust before the invasion begins?This novel is based on 'Spearhead from Space', a Doctor Who story which was originally broadcast from 3 - 24 January 1970.Featuring the Third Doctor as played by Jon Pertwee, and his companion Liz Shaw and the UNIT organisation commanded by Brigadier Lethbridge-Stewart.","Category":{"CategoryName":"Sci-fi"}},{"Author":"Eric Saward","Name":"Doctor Who The Visitation","Price":"0","Description":"Tegan, the young air hostess who quite unintentionally became a member of the TARDIS's crew, wants to return to her own time, but when the Doctor tries to take her back to Heathrow Airport in the twentieth century the TARDIS lands instead on the outskirts of seventeenth-century London.The Doctor and his companions receive a decidedly unfriendly welcome вЂ” but it soon becomes clear that the sinister activities of other visitors from time and space have made the villagers extremely suspicious of outsiders.And as a result of the aliens' evil schemes, the Doctor finds himself on the point of playing a key role in a gruesome historical event...","Category":{"CategoryName":"Sci-fi"}}]