[{"Author":"Arthur C Clarke","Name":"Greetings carbon based bipeds","Price":"13.90","Description":"The most visionary and versatile thinker of this century here gathers together in a single volume his most significant and prophetic nonfiction writings to present a personal view of the twentieth century. Sir Arthur C Clarke lucidly demonstrates in this beautiful book that he not only anticipated many of the twentieth century's great inventions and scientific innovations, he also inspired the careers of thousands of scientists, and in fact has shaped our path ahead in to the next millennium. The reader is swept into the course of events and becomes an active and informed participant rather than a remote bystander. From predicting the role of geosynchronous satellites decades before they existed to his groundbreaking reporting from Kennedy Space Center in the 60s, to anticipating the internet decades before it happened, Clarke has acted both as technological prophet and cultural conscience, celebrating the great scientific powers of man -- but simultaneously warning of the perils of a world where power and greed reign unchecked. Each essay has a new introduction by Clarke to provide perspective. The pieces themselves enable the reader to experience the excitement of taking part in a journey of discovery. Sir Arthur's bona fide scientific understanding is combined with a generosity of spirit, the interests of a new renaissance man, a sublime lack of false modesty and a great flair for the dramatic. This is arguably the crowning achievement of an unrivalled personal odyssey that began in England in 1917 and has ascended to the stars. It will very possibly be one of the few uplifting accounts around!&nbsp;","Category":{"CategoryName":"Science"}},{"Author":"Gilbert White","Name":"The Natural History Of Selborne","Price":"4.00","Description":"&nbsp;The Natural History Of Selborne&nbsp;'I was much entertained last summer with a tame bat, which would take flies out of a person's hand.'&nbsp;Gilbert White's Natural History of Selborne (1789) reveals a world of wonders in nature. Over a period of twenty years White describes in minute detail the behaviour of animals through the changing seasons in the rural Hampshire parish of Selborne.He notes everything from the habits of an eccentric tortoise to the mysteries of bird migration and animal reproduction, with the purpose of inspiring others to observe their own surroundings with the same pleasure and attention. Written as a series of letters, White's book has all the immediacy of an exchange with friends, yet it is crafted with compelling literary skill.His gossipy correspondence has delighted readers from Charles Darwin to Virginia Woolf, and it has been read as a nostalgic evocation of a pastoral vision, a model for local studies of plants and animals, and a precursor to modern ecology.","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"Musicophilia: Tales Of Music And The Brain","Price":"11.90","Description":"An illuminating book about the power of music, from the bestselling author of \"The Man Who Mistook His Wife for a Hat\".Oliver Sacks has been hailed by the \"New York Times\" as 'one of the great clinical writers of the twentieth century'. In this eagerly awaited new book, the subject of his uniquely literate scrutiny is music: our relationship with it, our facility for it, and what this most universal of passions says about us.In chapters examining savants and synaesthetics, depressives and musical dreamers, Sacks succeeds not only in articulating the musical experience but in locating it in the human brain. He shows that music is not simply about sound, but also movement, visualization, and silence.","Category":{"CategoryName":"Science"}},{"Author":"Timothy Corrigan","Name":"A short guide to writing about film","Price":"13.90","Description":"For courses in Film Criticism, Film History, Writing for Film, or Film Appreciation. A succinct guide to thinking critically and writing precisely about film Both an introduction to film study and a practical writing guide, this brief text introduces students to major film theories as well as film terminology, enabling them to write more thoughtfully and critically. With numerous student and professional examples, this engaging and practical guide progresses from taking notes and writing first drafts to creating polished essays and comprehensive research projects. Moving from movie reviews to theoretical and critical essays, the text demonstrates how an analysis of a film can become more subtle and rigorous as part of a compositional process.","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"The Island Of The Colour-Blind","Price":"12.90","Description":"'Sacks is rightly renowned for his empathy ...anyone with a taste for the exotic will find this beautifully written book highly engaging' Sunday Times Always fascinated by islands, Oliver Sacks is drawn to the Pacific by reports of the tiny atoll of Pingelap, with its isolated community of islanders born totally colour-blind; and to Guam, where he investigates a puzzling paralysis endemic there for a century. Along the way, he re-encounters the beautiful, primitive island cycad trees -- and these become the starting point for a meditation on time and evolution, disease and adaptation, and islands both real and metaphorical.","Category":{"CategoryName":"Science"}},{"Author":"Henry Gray","Name":"Gray's Anatomy","Price":"14.90","Description":"Gray's preface states clearly, This Work is intended to furnish the Student and Practitioner with an accurate view of the Anatomy of the Human Body, and more especially the application of this science to Practical Surgery. Experts agree that subsequent editions have never surpassed the beauty and simplicity of the original, and Henry Gray's clarity of expression.An essential element of the book is the remarkable illustrative work of Henry Vandyke Carter, indisputedly the most talented medical artist of his day. This edition of Gray's Anatomy is a faithful digital facsimile of the 1858 classic first edition, presented in an easy-to-use, large format. The reappearance of the original work will be welcomed by all professionals and non-professionals alike with an interest in the structure and workings of the human body. It is as valid today as the day it was written.&nbsp;","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"An anthropologist on mars","Price":"11.90","Description":"This collection of essays are mainly casebook studies. Neurological patients, Oliver Sacks once wrote, are travellers to unimaginable lands. This book offers portraits of seven such travellers, including a surgeon consumed by the compulsive tics of Tourette's syndrome unless he is operating, an artist who loses all sense of colour in a car accident, but finds a new sensibility and creative power in black and white, and an autistic professor who cannot decipher the simplest social exchange between humans, but has built a career out of her intuitive understanding of animal behaviour.","Category":{"CategoryName":"Science"}},{"Author":"Isaac Newton","Name":"James Gleick","Price":"13.90","Description":"From one of the best writers on science, a remarkable portrait of Isaac Newton. The man who changed our understanding of the universe, of science, and of faith. Isaac Newton was the chief architect of the modern world. He answered the ancient philosophical riddles of light and motion; he effectively discovered gravity; he salvaged the terms 'time', 'space', 'motion' and 'place' from the haze of everyday language, standardized them and married them, each to the other, constructing an edifice that made knowledge a thing of substance: quantative and exact. Creation, Newton demonstrated, unfolds from simple rules, patterns iterated over unlimited distances.","Category":{"CategoryName":"Science"}},{"Author":"Michael A Strauss","Name":"Welcome to the universe","Price":"89.90","Description":"Welcome to the Universe is a personal guided tour of the cosmos by three of today's leading astrophysicists. Inspired by the enormously popular introductory astronomy course that Neil deGrasse Tyson, Michael A. Strauss, and J. Richard Gott taught together at Princeton, this book covers it all--from planets, stars, and galaxies to black holes, wormholes, and time travel. Describing the latest discoveries in astrophysics, the informative and entertaining narrative propels you from our home solar system to the outermost frontiers of space. How do stars live and die?","Category":{"CategoryName":"Science"}},{"Author":"J.M. Coetzee","Name":"Disgrace","Price":"9.90","Description":"A clearly written introduction to the novel's themes and form, inspired by the author's practical experience of several years of teaching the novel at university level in Britain, as well as his background as a South African-born and educated academic.","Category":{"CategoryName":"Science"}},{"Author":"Michio Kaku","Name":"Visions","Price":"17.90","Description":"New in paperback, from the bestselling author of Hyperspace, this spellbinding book brings together the cutting-edge research of today's foremost scientists to explore the science of tomorrow. Michio Kaku describes the development of computers and artificial intelligence, reveals how the decoding of the genetic structure of DNA will allow us to alter and reshape our genetic inheritance, and observes how quantum physicists are perfecting new ways of harnessing the matter and energy of the Universe. Visions is an exhilarating adventure into the future of our planet and ourselves.","Category":{"CategoryName":"Science"}},{"Author":"Blaise Pascal","Name":"Pascal's Pensees","Price":"12.90","Description":"t might seem that about Blaise Pascal, and about the two works on which his fame is founded, everything that there is to say had been said. The details of his life are as fully known as we can expect to know them; his mathematical and physical discoveries have been treated many times; his religious sentiment and his theological views have been discussed again and again; and his prose style has been analysed by French critics down to the finest particular. But Pascal is one of those writers who will be and who must be studied afresh by men in every generation. It is not he who changes, but we who change. It is not our knowledge of him that increases, but our world that alters and our attitudes towards it.","Category":{"CategoryName":"Science"}},{"Author":"Dudley Andrew","Name":"Concepts in film theory","Price":"15.90","Description":"Dudley Andrew is a master at making the world of film theory accessible to a largely mystified public. Since the publication of his \"Major Film Theories, \" a classic in the field, the sophistication of the debate concerning the proper approach to film has grown. It is now the province of critics and universities instead of directors and artists, and \"Concepts in Film Theory\" concentrates on the major areas of debate rather than on individual figures. Andrew provides lucid explanations of theories which involve perceptual psychology and structuralism; semiotics and psychoanalysis; hermeneutics and genre study.Throughout he presents his own strong views on the relationship of film theory to criticism, history, and analysis. His clear approach to obten obscure theories goes a long way towards bringing an important area of cultural discussion out of oits academic exile.","Category":{"CategoryName":"Science"}},{"Author":"Dava Sobel","Name":"A more perfect heaven","Price":"13.90","Description":"Traces the story of the reclusive sixteenth-century cleric who introduced the revolutionary idea that the Earth orbits the sun, describing the dangerous forces and complicated personalities that marked the publication of Copernicus's findings.","Category":{"CategoryName":"Science"}},{"Author":"Tom Hopkins","Name":"Selling for Dummies","Price":"17.90","Description":"This is your hands-on guide to the most up-to-date selling strategies and techniques. Are you looking to enter the world of sales, or are you already a salesperson who's looking for new tips and tactics to expand your business? No matter your level of skill, this guide will help you lay a foundation for sales success, with the latest information on how to research your prospects, break down the steps of the sales process, follow up with happy customers, and much more. This is the wonderful world of selling - discover what selling is (and isn't) and find out how mastering selling skills can benefit all areas of your life. Stand out from the crowd - find out how knowing your clients sets you apart from average persuaders and helps you hear more yeses. Scale the steps to success - discover the seven steps of the selling cycle to score appointments, make a good impression, give winning presentations, address client concerns, close sales, and more.","Category":{"CategoryName":"Science"}},{"Author":"Thomas Robert Malthus","Name":"An essay on the principle of population","Price":"13.90","Description":"This 1992 book provides a student audience with the best scholarly edition of Malthus' Essay on the Principle of Population.","Category":{"CategoryName":"Science"}},{"Author":"Michio Kaku","Name":"Hyperspace","Price":"13.90","Description":"Michio Kaku, author of Beyond Einstein and a leading theoretical physicist, offers the first book-length tour of the most exciting work in modern physics, work which includes research on the 10th dimension, time warps, black holes, and multiple universes. Written for general readers, the book conveys the excitement of scientists as they grapple with the meaning of space and time.","Category":{"CategoryName":"Science"}},{"Author":"Michio Kaku","Name":"Physics of the Impossible","Price":"15.90","Description":"Renowned physicist Kaku explores to what extent technologies and devices deemed impossible today might become commonplace in the future. From teleportation to force fields, Kaku uses the world of science fiction to explore the fundamentals--and the limits--of the laws of physics.","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"The Man Who Mistook His Wife For A Hat","Price":"12.90","Description":"'Oliver Sacks has become the world's best-known neurologist. His case studies of broken minds offer brilliant insight into the mysteries of consciousness' Guardian In his most extraordinary book, Oliver Sacks recounts the stories of patients lost in the bizarre, apparently inescapable world of neurological disorders. These are case studies of people who have lost their memories and with them the greater part of their pasts; who are no longer able to recognize people or common objects; whose limbs have become alien; who are afflicted and yet are gifted with uncanny artistic or mathematical talents. In Dr Sacks's splendid and sympathetic telling, each tale is a unique and deeply human study of life struggling against incredible adversity. 'Populated by a cast as strange as that of the most fantastic fiction ...Dr Sacks shows the awesome powers of our mind and just how delicately balanced they have to be' Sunday Times 'This book is for everybody who has felt from time to time that certain twinge of self-identity and sensed how easily, at any moment, one might lose it' The Times 'A gripping journey into the recesses of the human mind' Daily Mail","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"Awakenings","Price":"12.90","Description":"'The story of a disease that plunged its victims into a prison of viscous time, and the drug that catapulted them out of it' Guardian Hailed as a medical classic, and the subject of a major feature film as well as radio and stage plays and various TV documentaries, Awakenings is the extraordinary account of a group of twenty patients. Rendered catatonic by the sleeping-sickness epidemic that swept the world just after the First World War, all twenty had spent forty years in hospital: motionless and speechless; aware of the world around them, but exhibiting no interest in it - until Dr Sacks administered the then-new drug, L-DOPA, which caused them, temporarily, to awake from their decades-long slumber. 'A brilliant and humane book' Observer 'Not only a collection of astonishing case histories, Awakenings is also a memoir, a moral essay and a romance. It is a work of genius' Washington Post 'It makes you aware of what a knife edge we live on' Doris Lessing","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"A leg to stand on","Price":"13.90","Description":"'Oliver Sacks is a perfect antidote to the anaesthetic of familiarity. His writing turns brains and minds transparent' Observer When Oliver Sacks, a physician by profession, injured his leg while climbing a mountain, he found himself in an unusual position -- that of patient. The injury itself was severe, but straightforward to fix; the psychological effects, however, were far less easy to predict, explain, or resolve: Sacks experienced paralysis and an inability to perceive his leg as his own, instead seeing it as some kind of alien and inanimate object, over which he had no control. A Leg to Stand On is both an account of Sacks' ordeal and subsequent recovery, and an exploration of the ways in which mind and body are inextricably linked. 'In every way a marvellously rich and thoughtful tale' Sunday Telegraph 'Oliver Sacks is a neurologist, a man of humane eloquence, and a genuine communicator. The value of this book lies in its willingness to combine the technical and the demonic, to admit poetry and philosophy and the religious impulse. It is also intensely personal, and affirms the community of human experience' Observer 'A remarkable, generous, vivid and thoroughly intelligent piece of writing' Sunday Times","Category":{"CategoryName":"Science"}},{"Author":"James Gleick","Name":"What just happened","Price":"14.90","Description":"We are quick to acknowledge that our lives have been transformed by technology over the last ten years - that virtual reality has become as permanent a fixture in our lives as material reality; but the arrival of the electronic world over the last ten years was not a single invention, nor a single event; it could not be encompassed in a single moment. The last ten years can be characterized in three ways: the speed, the hysteria and the remarkable range of devices, aspects, and larger ramifications of what happened. Everyone knows about the accelerated pace of our lives. Everyone recognizes that the clamour has become unprecedented, but as much as we have all lived through the last ten years, it is hard to grasp the extent and expanse of what has happened. In 'Bits in the Ether', Jim Gleick sets down in chronological order the swirling bits and pieces of change: the new gadgets and the old that now have been given new power and new life - the resources - how the old resources have suddenly been enlivened by instant availability.","Category":{"CategoryName":"Science"}},{"Author":"Jan Zimmerman","Name":"Web marketing for Dummies","Price":"17.90","Description":"Just because you're launching a Web site for your product or service doesn't automatically mean you'll rake in big money. Billions of Web sites are competing for consumers' attention, and if you're new to online sales, it may be a little daunting.\"Web Marketing for Dummies\" provides the know-how for creating a solid Web marketing plan, from building a user-friendly site that draws attention to closing a sale on your site. This easily accessible guide leverages your offline knowledge of marketing into mastery of the Web. It shows you a number of strategies that you can apply to your business and how to put your site to work for you. The items you'll draw from this book will enable you to: Understand online marketing essentialsPrepare an online business planDesign the look and feel of your siteCreate a concept, develop content, and make it accessibleKnow the key components of an online storeUse buzzing, e-mailing, and other advertising tacticsMake your site search engine friendlyHandle Web transactions with easeStay out of legal troubleWow customers with new technology.This guide also features free ways to market your site, as well as ways to revamp tired sites. In addition, there is also a list of common mistakes that are easy to make, but also easy to avoid. With \"Web Marketing for Dummies,\" you'll be claiming your space in the online marketplace and maximizing your marketing dollars in no time.","Category":{"CategoryName":"Science"}},{"Author":"Daniel Chiras","Name":"Human Biology","Price":"11.90","Description":"Intended for non-majors, this textbook describes the structure and functions of each human body system, explores the body processes that regulate chemical levels in the blood and body temperature, and overviews genetics, human reproduction, and evolution. The fifth edition trims the overall length by 20% while adding short essays on past scientific","Category":{"CategoryName":"Science"}},{"Author":"Chandler Burr","Name":"A separate creation","Price":"19.90","Description":"Burr's 1993 cover story in the Atlantic Monthly, \"Homosexuality and Biology\", introduced many readers to the often astonishing research being conducted on the question of what--at the biological level--made a person either heterosexual or homosexual. With this book, Burr expands his investigation into a full-length examination of this highly contentious areas of science.&nbsp;","Category":{"CategoryName":"Science"}},{"Author":"Paul D. Stewart","Name":"Galapagos","Price":"15.90","Description":"The Galapagos archipelago is made up of thirteen main islands and more than sixty other islets, rocks and reefs, scattered over four hundred kilometres of open ocean. Sitting at a confluence of four major ocean currents, the islands are actually the summits of vast undersea volcanoes, and are steadily on the march. How has such an odd assortment of life managed to find a footing in this unruly world? Micro-climates and altitude have combined to form discrete environmental zones: perfect habitats for the islands diverse fauna marine iguanas, petrels, blue-footed boobies and giant tortoises being but a famous few. Galapagos is a rare insight into an incredible landscape, a natural laboratory and an exquisite evolutionary habitat that Darwin described as a 'world within itself'. Both fragile and furious, the Galapagos is unlike any other place on earth.","Category":{"CategoryName":"Science"}},{"Author":"Richard Dawkins","Name":"Climbing mount improbable","Price":"17.90","Description":"Builds an argument for evolutionary adaptation as the force behind all life on earth. Regarding evolution's complex achievements as peaks on a metaphorical mountain, this book reveals the ways in which the theory of natural selection can precisely explain the beautiful, bizarre and seemingly 'designed' complexity of living things.","Category":{"CategoryName":"Science"}},{"Author":"Nigel Cawthorne","Name":"A Brief Guide To J.R.R. Tolkien","Price":"0","Description":"A comprehensive guide that provides an excellent overview and is written by an acclaimed scholar of Tolkien.","Category":{"CategoryName":"Science"}},{"Author":"Ian Crofton","Name":"Brewers cabinet of curiosities","Price":"0","Description":"From the creators of \"Brewer's Dictionary of Phrase and Fable,\" considered by many the greatest trivia collection ever, comes another cool collection of fabulous facts, quirky quotes, and unbelievable-but-true happenings. The coverage includes various historic, literary, artistic, and scientific categories--each supplying its share of the bizarre and the hilarious. Some examples: a list of royal nicknames, from William the Bastard (a.k.a. the Conqueror) to Harry Potty (today's irrepressible Prince Harry); the longest and shortest wars, from the 100 Years' War to the Thirty-eight Minutes' War; the ship's cat that won a medal; and why the planet Uranus was nearly officially named George.","Category":{"CategoryName":"Science"}},{"Author":"Slavoj Zizek","Name":"Contingency hegemony universality","Price":"0","Description":"The Hegelian legacy, Left strategy, and post-structuralism versus Lacanian psychoanalysis","Category":{"CategoryName":"Science"}},{"Author":"Steve Jones","Name":"Darwins Island","Price":"0","Description":"The Origin of Species may be the most famous book in science but its stature tends to obscure much of Charles Darwin's other works. His visit to the Galapagos lasted just five weeks and on his return he never left Britain again. Darwin spent forty years working on the plants, animals and people of his native land and wrote over six million words on topics as different as dogs, insect-eating plants, orchids, earthworms, apes and human emotion. Together they laid the foundations of modern biology. In this beautifully written, witty and illuminating book, Steve Jones explores the domestic Darwin, tracing the great naturalist's journey across Britain: a voyage not of the body, but of the mind.","Category":{"CategoryName":"Science"}},{"Author":"Tim Glynne-Jones","Name":"The book of numbers","Price":"0","Description":"Pick a number, any number, and 'The Book of Numbers' will let you in on all its secrets. You'll be amazed at just how entertaining numbers can be.","Category":{"CategoryName":"Science"}},{"Author":"Jared Diamond","Name":"Why is sex fun","Price":"0","Description":"Why are humans one of the few species to have sex in private? Why do humans have sex any day of the month or year, including when the female is pregnant, beyond her reproductive years, or between her fertile cycles? Why are human females one of the few mammals to go through menopause? Human sexuality seems normal to us but it is bizarre by the standards of other animals. Jared Diamond argues that our strange sex lives were as crucial to our rise to human status as were our large brains. He also describes the battle of the sexes in the human and animal world over parental care, and why sex differences in the genetic value of parental care provide a biological basis for the all-too-familiar different attitudes of men and women towards extramarital sex.","Category":{"CategoryName":"Science"}},{"Author":"Tony Juniper","Name":"How Many Lightbulbs Does it Take to Change a Planet?","Price":"0","Description":"The human world sits on the brink of potentially catastrophic environmental change. If we do not drastically reduce greenhouse gas emissions, and start that process now, then it is projected that by 2050 the cost of climate damage will exceed global GDP. The latest science confirms that there is now only a decade left for action.","Category":{"CategoryName":"Science"}},{"Author":"Charlie Croker","Name":"Lost in translation","Price":"0","Description":"In today's world no self-respecting English-language enthusiast could have failed to notice the frequent and flagrant abuse of our native tongue by pesky foreigners? (Forgetting, for a moment, the fact that many nations speak our language better than we do.) \"Lost in Translation\" features hundreds of genuine, original and utterly ridiculous examples of the misadventures in English discovered all over the world by the author and his intrepid team of researchers. Everything from hotel signs to baffling advertisements, such as the German beauty product offering a 'Cream shower for pretentious skin' or the Japanese bar that boasts 'Special cocktails for ladies with nuts', or the French warning at a swimming pool - 'Swimming is forbidden in the absence of the saviour.' Published in paperback for the first time this autumn, \"Lost in Translation\" demonstrates how widely the English language has travelled, though unfortunately some of it seems to have got a bit scrambled en route.","Category":{"CategoryName":"Science"}},{"Author":"Alex Boese","Name":"Elephants on Acid: and Other Bizarre Experiments","Price":"0","Description":"When Tusko the Elephant woke in his pen on 3 August 1962, little did he know that he was about to be given the largest ever single dose of LSD ...\"Elephants on Acid\" is a wonderfully entertaining, authoritative collection of history's most bizarre experiments, from the 19th-century creation of zombie kittens to a University of Wisconsin study that answers, definitively, the question of whether women who play hard to get really are more desirable. As well as learning what happened to Tusko, you will discover the 1959 mathematical equation for the point at which chatter at a drinks party becomes loud; whether listening to Mozart makes children super-students; and the secret of how to sleep on planes ...If left to their own devices, would babies instinctively pick a well-balanced diet? If you were unfortunate enough to fall down a disused mine shaft, would your dog run to fetch help? Which really tastes better in a blind tasting - Coke, or Pepsi?","Category":{"CategoryName":"Science"}},{"Author":"Roger Highfield","Name":"The science of Harry Potter","Price":"0","Description":"Invisibility cloaks, flying broomsticks, magic doors - all the stuff of children's fantasy. But have you ever wondered if this magic could feasibly work? Roger Highfield explores the extraordinary world of the Harry Potter stories and shows how cutting edge science can explain much of it. Exciting new concepts are tackled, such as wormholes and general relativity, and also explained are the more historical links between magic and science, and investigating the archaeological and anthropological evidence for witchcraft and dragons.","Category":{"CategoryName":"Science"}},{"Author":"Signed Book WOMAN Natalie Angier","Name":"Unknown","Price":"0","Description":"Signed Book WOMAN Natalie AngierOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.With the clarity, insight, and sheer exuberance of language that make her one of&nbsp;The New York Times's premier stylists, Pulitzer Prize-winner Natalie Angier lifts the veil of secrecy from that most enigmatic of evolutionary masterpieces, the female body. Angier takes readers on a mesmerizing tour of female anatomy and physiology that explores everything from organs to orgasm, and delves into topics such as exercise, menopause, and the mysterious properties of breast milk.Hardcover","Category":{"CategoryName":"Science"}},{"Author":"Bill Bryson","Name":"Bill Bryson's Dictionary: For Writers And Editors","Price":"0","Description":"What is the difference between cant and jargon, or assume and presume? What is a fandango? How do you spell supersede? Is it hippy or hippie? These questions really matter to Bill Bryson, as they do to anyone who cares about the English language. Originally published as The Penguin Dictionary for Writers and Editors, Bryson's Dictionary for Writers and Editors has now been completely revised and updated for the twenty-first century by Bill Bryson himself.Here is a very personal selection of spellings and usages, covering such head-scratchers as capitalization, plurals, abbreviations and foreign names and phrases. Bryson also gives us the difference between British and American usages, and miscellaneous pieces of essential information you never knew you needed, like the names of all the Oxford colleges, or the correct spelling of Brobdingnag. An indispensable companion to all those who write, work with the written word, or who just enjoy getting things right, it gives rulings that are both authoritative and commonsense,all in Bryson's own inimitably goodhumoured way.","Category":{"CategoryName":"Science"}},{"Author":"Richard Dawkins","Name":"River Out Of Eden: A Darwinian View Of Life","Price":"0","Description":"The No.1 SUNDAY TIMES bestseller. A fascinating explanation of how evolution works, from bestselling author of THE GOD DELUSION, Richard Dawkins. The river of Dawkins's title is a river of DNA, flowing through time from the beginning of life on earth to the present - and onwards. Dawkins explains that DNA must be thought of as the most sophisticated information system imaginable: 'Life is just bytes and bytes of information,' he writes.Using this perspective, he describes the mechanisms by which evolution has taken place, gradually but inexorably, over a period of three thousand million years. It is the story of how evolution happens, rather than a narrative of what has actually happened in evolution. He discusses current views on the process of human evolution, including the idea that we all trace back to a comparatively recent African 'Eve', and speculates that the 'information explosion' that was unleashed on Earth when DNA came into being has almost certainly happened in other places in the universe.","Category":{"CategoryName":"Science"}},{"Author":"Oliver Sacks","Name":"The Island of the Colour-Blind","Price":"0","Description":"'Sacks is rightly renowned for his empathy ...anyone with a taste for the exotic will find this beautifully written book highly engaging' Sunday Times Always fascinated by islands, Oliver Sacks is drawn to the Pacific by reports of the tiny atoll of Pingelap, with its isolated community of islanders born totally colour-blind; and to Guam, where he investigates a puzzling paralysis endemic there for a century.Along the way, he re-encounters the beautiful, primitive island cycad trees -- and these become the starting point for a meditation on time and evolution, disease and adaptation, and islands both real and metaphorical. 'This is a wonderful book, made better by Sacks' exceptionally gentle descriptions of patients.He also captures the unimaginable sadness of the Pacific' Spectator 'Dr Sacks is an elegant and beguiling writer, and when he describes a condition such as achromatopsia (total colour-blindness), he is not content merely to describe it from the outside, but he tries to imagine what the world is like to a person with the condition' Sunday Telegraph 'There is no one at the present time who writes like Oliver Sacks ...He is a superb clinician who can take a seemingly arid and obscure medical condition, and convert it into a moving, personal odyssey, a testament of tenacity, courage and will' Literary Review","Category":{"CategoryName":"Science"}},{"Author":"Henry Gray","Name":"Gray's anatomy","Price":"0","Description":"Gray's preface states clearly, This Work is intended to furnish the Student and Practitioner with an accurate view of the Anatomy of the Human Body, and more especially the application of this science to Practical Surgery. Experts agree that subsequent editions have never surpassed the beauty and simplicity of the original, and Henry Gray's clarity of expression. An essential element of the book is the remarkable illustrative work of Henry Vandyke Carter, indisputedly the most talented medical artist of his day. This edition of Gray's Anatomy is a faithful digital facsimile of the 1858 classic first edition, presented in an easy-to-use, large format. The reappearance of the original work will be welcomed by all professionals and non-professionals alike with an interest in the structure and workings of the human body. It is as valid today as the day it was written.","Category":{"CategoryName":"Science"}},{"Author":"Fritjof Capra","Name":"The Tao of physics","Price":"0","Description":"Fritjof Capra's classic exploration of the parallels between modern physics and Eastern mysticism is now in its third edition, for which book Capra has written a special afterword assessing the impact the book has made in the 15 years since its first publication and reflecting upon the ways in which recent scientific developments have tended to support the book's main thesis.","Category":{"CategoryName":"Science"}},{"Author":"Thinking In Numbers","Name":"Daniel Tammet","Price":"0","Description":"This is the book that Daniel Tammet, bestselling author and mathematical savant, was born to write. In Tammet's world, numbers are beautiful and mathematics illuminates our lives and minds. Using anecdotes and everyday examples, Tammet allows us to share his unique insights and delight in the way numbers, fractions and equations underpin all our lives. Inspired by the complexity of snowflakes, Anne Boleyn's sixth finger or his mother's unpredictable behaviour, Tammet explores questions such as why time seems to speed up as we age, whether there is such a thing as an average person and how we can make sense of those we love. Thinking in Numbers will change the way you think about maths and fire your imagination to see the world with fresh eyes.&lt;/div&gt;","Category":{"CategoryName":"Science"}}]