[{"Author":"Cycling Plus Magazine","Name":"The Bicycle Book","Price":"12.90","Description":"If you are thinking of abandoning the train, tube, car or bus andtaking to the streets on two wheels (and if not, why not?), then you need this book. THE BICYCLE BOOK contains a mine of usefulinformation, from selecting your bike to caring for it, from how to ride it to where to ride it and what to wear while riding it. With THE BICYCLE BOOK you will learn to distinguish your bottom bracket from your headset, how to repair a puncture in just 5 minutes and the simple secrets of keeping your bike in top condition with only three basic tools.","Category":{"CategoryName":"Sport"}},{"Author":"Jeremy Clarkson","Name":"The top gear years","Price":"17.90","Description":"The Top Gear Years brings together Jeremy Clarkson's collected magazine columns for the first time. Clarkson at his pithy, provocative, hilarious best We now know all about the world according to Clarkson. In a series of bestselling books Jeremy has revealed it to be a puzzling, frustrating place where all too often the lunatics seem to be running the asylum. But in The Top Gear Years, we get something rather different. Because ten years ago, at an ex-RAF aerodrome in Surrey, Jeremy and his friends built a world that was rather more to his liking: they called it Top Gear HQ.","Category":{"CategoryName":"Sport"}},{"Author":"Lewis Erenberg","Name":"The greatest fight of our generation","Price":"12.90","Description":"Held on June 22, 1938, in Yankee Stadium, the second Joe Louis-Max Schmeling fight sparked excitement around the globe. For all its length--the fight lasted but two minutes--it remains one of the most memorable events in boxing history.","Category":{"CategoryName":"Sport"}},{"Author":"Charlie Woods","Name":"Bikie","Price":"12.90","Description":"Charlie Woods traces his love of cycling from childhood to adulthood, recalling the challenges and new horizons which served as a rite of passage into manhood. He explores a sport which has been a source of pleasure and comfort to him throughout his life. However, this is much more than one man's homage to cycling.","Category":{"CategoryName":"Sport"}},{"Author":"Jeremy Clarkson","Name":"Round the bend","Price":"15.90","Description":"Jeremy Clarkson gets really riled in Round the Bend. What's it like to drive a car that's actively trying to kill you? This and many other burning questions trouble Jeremy Clarkson as he sets out to explore the world from the safety of four wheels. Avoiding the legions of power-crazed traffic wombles attempting to block highway and byway, he he: Shows how the world of performance cars may be likened to Battersea Dogs Home Reveals why St Moritz may be the most bonkers town in all of the world Reminds us that Switzerland is so afraid of snow that any flakes falling on the road are immediately arrested Argues that washing a car is a waste of time Funny, globe-trotting, irreverent and sometimes downright rude, Round the Bend is packed with curious and fascinating but otherwise hopelessly useless stories and facts about everything under the sun (and just occasionally cars).","Category":{"CategoryName":"Sport"}},{"Author":"Jeremy Clarkson","Name":"Driven to distraction","Price":"15.90","Description":"Jeremy Clarkson is once more Driven to Distraction. Brace yourself. Clarkson's back. And he'd like to tell you what he thinks about some of the most awe-inspiring, earth-shatteringly fast and jaw-droppingly cool cars in the world (oh, and a few irredeemable disasters...). Or he would if he could just get one or two things off his chest first. Matters such as: * The prospect of having Terry Wogan as president * Why you'll never see a woman driving a Lexus * The unforeseen consequences of inadequate birth control * Why everyone should spend a weekend with a digger Driven to Distraction is Jeremy Clarkson at full throttle. So buckle up, sit tight and enjoy the ride. You're in for a hell of a lot of laughs. Praise for Jeremy Clarkson: 'Brilliant ...laugh-out-loud' Daily Telegraph 'Outrageously funny ...will have you in stitches' Time Out Number-one bestseller Jeremy Clarkson writes on cars, current affairs and anything else that annoys him in his sharp and funny collections. Born To Be Riled, Clarkson On Cars, Don't Stop Me Now, Driven To Distraction, Round the Bend, Motorworld and I Know You Got Soul are also available as Penguin paperbacks; the Penguin App iClarkson: The Book of Cars can be downloaded on the App Store. Jeremy Clarkson because his writing career on the Rotherham Advertiser. Since then he has written for the Sun and the Sunday Times. Today he is the tallest person working in British television, and is the presenter of the hugely popular Top Gear.","Category":{"CategoryName":"Sport"}},{"Author":"Tony Thacker","Name":"Dream cars of the fifties","Price":"19.90","Description":"Tony Thacker's dream cars of the fifties","Category":{"CategoryName":"Sport"}},{"Author":"Jeremy Clarkson","Name":"The world according to Clarkson","Price":"15.90","Description":"The world is an exciting and confusing place for Jeremy Clarkson - a man who can find the overgrown schoolboy in us all. In The World According to Clarkson, one of the country's funniest comic writers has free reign to expose absurdity, celebrate eccentricity and entertain richly in the process. And the net is cast wide: from the chronic unsuitablity of men to look after children for long periods or as operators of 'white goods', Nimbyism, cricket and PlayStations, to astronomy, David Beckham, 70's rock, the demise of Concorde, the burden of an Eton education and the shocking failure of Tom Clancy to make it on to the Booker shortlist, The World According to Clarkson is a hilarious snapshot of the life in the 21st century that will have readers wincing with embarrassed recognition and crying with laughter. It's not about the cars!","Category":{"CategoryName":"Sport"}},{"Author":"Rob Van der Plas","Name":"The bicycle touring manual","Price":"13.90","Description":"For touring cyclists, this new edition of Rob van der Plas' best-seller is as essential as a helmet and a tire patch kit. It answers virtually every question a cyclist could have while planning a tour ride, whether it's to the edge of the county or across the continent. The author is an experienced tour rider who has pedaled across the country and ridden abroad. He uses his vast experience to guide riders around potential pitfalls and mistakes that would otherwise diminish their touring pleasure. Everything from the makeup of the bicycle to packing the essentials and seeking lodging are covered. Safety issues, touring with children and touring abroad are also addressed, and help to make this guide indispensable for the cycling enthusiast.","Category":{"CategoryName":"Sport"}},{"Author":"Gianluca Vialli","Name":"The Italian job","Price":"12.90","Description":"Why is football experienced one way in the Premiership and another way in Serie A? What makes a footballer? Why does football matter so much in both countries? Tackling these questions which inform football debate in England and Italy, this book covers issues ranging from the technical to the cultural and sociological.","Category":{"CategoryName":"Sport"}},{"Author":"Bella Bathurst","Name":"The bicycle book","Price":"13.90","Description":"\"You can keep the internet. You can keep the computer and the mobile phone. In the bicycle humanity has its most perfect invention of the last three hundred years and in Bella Bathurst the bike has found the best and brightest booster so far.\" BORIS JOHNSON Two wheels. A frame. Two pedals. What could be simpler than a bicycle? And yet the bike -- old, and cheap, and slightly comic -- continues to inspire a passionate following. Since the millennium its use in Britain has doubled, and then doubled again.Thousands now cycle to work, and more take it up every day. In trial after trial, it is the bike which reaches its urban destination faster than the car, the bus, the underground or the pedestrian. Self-reliant and straightforward, cycling has recycled itself. It is an antiquated idea, and its time has finally come. But what is it about the bicycle that so enchants us? And why do its devotees become so obsessed with it? Acclaimed and prize-winning author Bella Bathurst takes us on a journey through cycling's best stories and strangest incarnations, from the bicycle as weapon of twentieth-century warfare to the secret life of couriers and the alchemy of framebuilding.With a cast of characters including the woman who watercycled across the Channel, the man who raced India's Deccan Queen train and several of today's top cyclists, she offers us a brilliantly engaging portrait of cycling's past, present and world-conquering future. The result is a story of passion and obsession, of exultation, endeavour, and risk. Above all, it is the story of partnership between man and machine, perfectly balanced -- a story of love and souplesse.","Category":{"CategoryName":"Sport"}},{"Author":"Jeremy Clarkson","Name":"Motorworld","Price":"0","Description":"In a revamped, refreshed and expanded edition, Motorworld appears in paperback for the first time. From Iceland to Australia, Clarkson travels the world exploring car culture. This is comic travel writing at its laugh-out-loud funniest.","Category":{"CategoryName":"Sport"}},{"Author":"Les Woodland","Name":"The unknown Tour de France","Price":"0","Description":"The Tour de France. It's probably the world's greatest-and certainly toughest-professional sporting event. There is much more to the Tour than the daily stage victories and dope charges. This book take a close look behind the scenes of the Tour and brings up many fascinating stories from the race's 100-year history, as well as the events that preceded the Tour itself. \"The Unknown Tour de France\" makes fascinating reading for everyone interested in bicycle racing and professional sports in general. You'll hear about the great champions of the early days, and some of later years, who molded the public image of the Tour the way it has become known. You'll read about the beginnings of road racing and the men who started and promoted this great venture. Find out about the 'foreign legion', the early English-speaking riders, and the way some of them later placed their mark on the Tour.","Category":{"CategoryName":"Sport"}},{"Author":"Kelly Killoren Bensimon","Name":"The bikini book","Price":"0","Description":"A sexy alternative to the one-piece swimming costume, the bikini forever changed the way women relate to their bodies. \"Smaller than the world's smallest bathing suit,\" as it was first described by its creator Frenchman Louis Reard, the bikini has become a symbol of female sensuality and liberation. This spring, on the occasion of its sixtieth anniversary, Assouline celebrate the bikini with a spirited look at its highlights and history. Here is a four hundred page tribute to the Hollywood pinups of the 50s; Bond girls Ursula Andress and Halle Berry rising up from the sea; the beaches of Copacabana and Ipanema, birthplace of the tanga; Brigitte Bardot, topless and poolside in St. Tropez; the itsy bitsy teeny weeny styles of the 60s; beach bodies on spring break; the monokini, tankini, bandini, and v-kini; the strappy and the sporty; the sexy and the outrageous. But whether iconic or ordinary, scandalous or social, every image of the bikini in this luscious volume is about beauty.","Category":{"CategoryName":"Sport"}},{"Author":"Oliver Dewar","Name":"Extreme Sail","Price":"0","Description":"Sailing is becoming more and more extreme, as technological advancements mean that vessels are getting faster, while sailors are better equipped than ever to conquer the elements and explore uncharted waters with sophisticated satellite navigation systems. Today s sailors have an insatiable desire to smash records and make history, conquering near-impossible weather conditions and treacherous icy waters in the process. Maritime marathons such as The Race, in which competitors circumnavigate the globe in as fast a time as possible, are springing up around the globe and attracting more and more fearless individuals. \"Extreme Sail\" is a circumnavigation of the most extreme maritime featsincluding the Vendee Globe, the Sydney-Hobart, the America's Cup, and the Ostar. Engaging text is accompanied by visually breathtaking photographs capturing the true spirit of extreme sailing. There are also quotes throughout from sailors who have participated in extreme events, and a gazetteer at the back of the book gives information on all the races, events, and competitions mentioned.\"","Category":{"CategoryName":"Sport"}}]