[{"Author":"John Grisham","Name":"Playing For Pizza","Price":"5.90","Description":"Playing For PizzaRick Dockery was the third-string quarterback for the Cleveland Browns. In the deciding game at the climax of the season, to the surprise and dismay of virtually everyone, Rick actually got into the game. With a 17-point lead and just minutes to go, Rick provided what was arguably the worst single performance in the history of the NFL. Overnight, he became a national laughing stock and, of course, was immediately dropped by the Browns and shunned by all other teams. But all Rick knows is football, and he insists that his agent, Arnie, finds a team that needs him. Against enormous odds, Arnie finally locates just such a team and informs Rick that, miraculously, he can in fact now be a starting quarterback. Great says Rick - for which team?","Category":{"CategoryName":"Thrillers"}},{"Author":"Dan Brown","Name":"Deception Point","Price":"9.90","Description":"When a new NASA satellite spots evidence of an astonishingly\r\nrare object buried deep in the Arctic ice, the floundering space agency\r\nproclaims a much-needed victory...a victory that has profound implications for\r\nU.S. space policy and the impending presidential election. With the Oval Office\r\nin the balance, the President dispatches White House Intelligence analyst\r\nRachel Sexton to the Milne Ice Shelf to verify the authenticity of the find.","Category":{"CategoryName":"Thrillers"}},{"Author":"John Grisham","Name":"The Appeal","Price":"9.90","Description":"The AppealJohn Grisham is now an institution --\r\na writer whose bestselling status is assured, So assured, in fact, that\r\nexpectations for each new book are as high as can be imagined. Does&nbsp;The\r\nAppeal&nbsp;make the grade? And will it appeal to Grisham admirers -- or\r\ndisappoint them?\r\n\r\nThe stakes in the novel's plot are high: corporate\r\ncrime on the largest scale. The duo of lawyers at the centre of the narrative\r\nare Mary and Wes Grace, who succeed in a multimillion dollar case against a\r\nchemical company, who have polluted a town with dumped toxic waste. A slew of\r\nagonising deaths have followed this, but lawyers for the chemical company\r\nappeal, and a variety of legal shenanigans are employed -- and it is certainly\r\nnot clear which way the scales of justice will be finally balanced.","Category":{"CategoryName":"Thrillers"}},{"Author":"Nevil Shute","Name":"Pied Piper","Price":"9.90","Description":"Goaded by the evacuation of Dunkirk, a retired solicitor on holiday in the Jura mountains promises to escort two English children to safety. So swift and terrible is the Germans' advance that their progress is slow, and the old man finds himself chaperon to an increasing number of waifs and strays.","Category":{"CategoryName":"Thrillers"}},{"Author":"Walter Mosely","Name":"Walking the dog","Price":"13.90","Description":"Nine years after his release from prison, Socrates is still living in a two-room shack in Watts, now with a lover and a steady job. Having responsibilities and people he cares about makes acting morally even harder - he has so much more to lose with the police watching his every move. Socrates Fortlow, first introduced in \"Always Outnumbered, Always Outgunned\", is one of the essential fictional characters of our times. In \"Walkin' the Dog\", the philosopher with 'rock-breaking hands' has come in from the cold and has to decide at which point an individual must make a stand against the brutality and corruption that surrounds him. At a time when much contemporary fiction confines itself to the personal, Walter Mosley creates characters that speak to the universal and reflect on dilemmas that are the moral questions of our time.","Category":{"CategoryName":"Thrillers"}},{"Author":"J.K. Rowling","Name":"The Casual Vacancy","Price":"11.90","Description":"When Barry Fairbrother dies in his early forties, the town of Pagford is left in shock. Pagford is, seemingly, an English idyll, with a cobbled market square and an ancient abbey, but what lies behind the pretty facade is a town at war. Rich at war with poor, teenagers at war with their parents, wives at war with their husbands, teachers at war with their pupils...Pagford is not what it first seems. And the empty seat left by Barry on the parish council soon becomes the catalyst for the biggest war the town has yet seen. Who will triumph in an election fraught with passion, duplicity and unexpected revelations? A big novel about a small town, The Casual Vacancy is J.K. Rowling's first novel for adults. It is the work of a storyteller like no other.","Category":{"CategoryName":"Thrillers"}},{"Author":"Ian Fleming","Name":"From Russia With Love","Price":"9.90","Description":"Bond does not himself feature until quite late in this novel - the opening chapters, one of Fleming's most amazing fantasies, creates the nightmare world of SMERSH - the Russian counter-spy organisation, its sickeningly foul section head Rosa Klebb and her top assassin Grant.","Category":{"CategoryName":"Thrillers"}},{"Author":"Sergei Lukyanenko","Name":"The last watch","Price":"15.90","Description":"\"The Last Watch\" is the stunning sequel to the Night Watch trilogy, following the fortunes of the Others. Indistinguishable from normal people but possessed of supernatural powers and capable of entering the Twilight, a shadowy world that exists in parallel to our own, each Other owes allegiance either to the Dark, or to the Light...While on holiday in Scotland, visiting 'The Dungeons of Edinburgh', a young Russian tourist is murdered. As the police grapple with the fact that the cause of the young man's death was a massive loss of blood, the Watches are immediately aware that there is a renegade vampire on the loose. Anton - the hero of the Night Watch trilogy - is detailed to this seemingly mundane investigation, but begins to realise that there is much more to the story than a wildcat vampire and a single murder, and discovers that a team of unlicensed Others are hunting for a fabled magical treasure, hidden in the sixth level of the Twilight by Merlin himself.","Category":{"CategoryName":"Thrillers"}},{"Author":"Adrian McKinty","Name":"I hear the sirens in the street","Price":"12.90","Description":"Theres always a clue. Sometimes its just hard to see. A torso in a suitcase looks like an impossible case. But Sean Duffy isnt easily deterred, especially when his floundering love life leaves him in need of distraction. Duffy is caught between his romantic instincts, gross professional misconduct, and powerful men he should know better than to mess with.","Category":{"CategoryName":"Thrillers"}},{"Author":"Armitage Trail","Name":"Scarface","Price":"11.90","Description":"'I'm Scarface. I'm just about ten times as hard-boiled as Johnny Lovo ever thought of being. I've bumped off six or eight myself and another one - especially a rat like you - wouldn't mean a thing in my young life. Get me?' In the mean streets of Chicago, a young man is unwilling to follow his parents into a life of squalor and poverty and hungers to become a big shot. Tony Guarino has grown up in the hard world of the bar and the poolroom, where every gangster is a hero and every cop an enemy.","Category":{"CategoryName":"Thrillers"}},{"Author":"Michel Houellebecq","Name":"Atomised platform","Price":"12.90","Description":"Michel is a civil-servant at the Ministry of Culture. When his father is murdered, Michel takes a leave of absence to go on a package tour to Thailand. Infuriated by the shallow hypocrisy and mediocrity of his fellow travellers, only the awkward Valerie attracts his attention. Too bashful to pursue her, Michel prefers the uncomplicated pleasures of Thai massage parlours and sex with local women.&nbsp;","Category":{"CategoryName":"Thrillers"}},{"Author":"Charles Portis","Name":"True grit","Price":"12.90","Description":"There is no knowing what lies in a man's heart. On a trip to buy ponies, Frank Ross is killed by one of his own workers. Tom Chaney shoots him down in the street for a horse, $150 cash, and two Californian gold pieces. Ross's unusually mature and single-minded fourteen-year-old daughter Mattie travels to claim his body, and finds that the authorities are doing nothing to find Chaney. Then she hears of Rooster - a man, she's told, who has grit - and convinces him to join her in a quest into dark, dangerous Indian territory to hunt Chaney down and avenge her father's murder.","Category":{"CategoryName":"Thrillers"}},{"Author":"Richard Matheson","Name":"I am legend","Price":"12.90","Description":"Matheson's classic novel of fear and vampirism--the tale of the last human on an Earth overrun by the undead--returns to graphic novel format in a single volume collection of four long out-of-print books.","Category":{"CategoryName":"Thrillers"}},{"Author":"Marisha Pessl","Name":"Night film","Price":"13.90","Description":"On a damp October night, beautiful, young Ashley Cordova is found dead in an abandoned warehouse in lower Manhattan. Her death is ruled a suicide, but veteran investigative journalist Scott McGrath suspects otherwise. As he probes the strange circumstances surrounding her death, McGrath comes face-to-face with the legacy of Ashley's father: cult horror film director Stanislas Cordova. Rumored to be shuttered away in a remote Adirondack estate, Cordova remains an enigma. Though much has been written about his unsettling films, very little is known about the man himself. With the help of two strangers, McGrath is slowly drawn into Cordova's eerie, hypnotic world as he pieces together the answers: What really happened to Ashley? Who is Cordova? And once we face our deepest fears - what lies on the other side?","Category":{"CategoryName":"Thrillers"}},{"Author":"K W Jeter","Name":"Blade Runner","Price":"13.90","Description":"K.W. Jeter picks up the tale of Rick Deckard, the `blade runner' created by Phillip K. Dick and popularized by Ridley Scott's cult classic film.&nbsp;&nbsp;Consistent with the sordid vision of 21st century Los Angeles crafted by Dick and Scott, Jeter creates a stylish piece of thrilling, futuristic suspense that finds Deckard not only in the role of hunter, but also hunted.&nbsp;&nbsp;Again, Deckard is on the trail of an replicant, not knowing that it may be the most elusive and dangerous android of all.","Category":{"CategoryName":"Thrillers"}},{"Author":"Walter Mosley","Name":"A red death","Price":"12.90","Description":"'It has come to my attention, sir, that between August 1948 and September of 1952 you came into possession of at least three real estate properties.' 'I have reviewed your tax records back to 1945 and you show no large income, in any year. This would suggest that you could not legally afford such expenditures...' When an income tax officer makes him an offer he can't refuse, Easy Rawlins is forced out of retirement and into the infiltration of his local church, the First African Baptist, and the surveillance of local radioals. Murderers strike and he becomes the prime suspect of the Los Angeles Police Department, who lose no sleep over the fate of 'freelance' private eyes.","Category":{"CategoryName":"Thrillers"}},{"Author":"Tana French","Name":"Broken harbour","Price":"13.90","Description":"In Broken Harbour, a ghost estate outside Dublin - half-built, half-inhabited, half-abandoned - two children and their father are dead. The mother is on her way to intensive care. Scorcher Kennedy is given the case because he is the Murder squad's star detective. At first he and his rookie partner, Richie, think this is a simple one: Pat Spain was a casualty of the recession, so he killed his children, tried to kill his wife Jenny, and finished off with himself. But there are too many inexplicable details and the evidence is pointing in two directions at once. Scorcher's personal life is tugging for his attention.&nbsp;","Category":{"CategoryName":"Thrillers"}},{"Author":"Michael Pye","Name":"Taking lives","Price":"12.90","Description":"Martin Arkenhout, a seventeen-year-old Dutchman travelling across the States, kills his young American travelling companion, Seth Goodman, and adopts his identity. Some months later he takes - and takes on - other lives, adopting another passport, set of credit cards and identity. A decade and many lives later, now back in the Netherlands, he kills and becomes a young British art historian, Christopher Hart, and follows his plans to go to Portugal. But Christopher is being followed from the London by Costas, another art historian, investigating the disappearance of a series of valuable prints from a priceless book, and before he leaves the Netherlands, Martin runs into his own mother on a tram. In the confusion of the moment he identifies himself as Hart and for the first time Martin's series of seamless killings and identities runs into trouble...","Category":{"CategoryName":"Thrillers"}},{"Author":"Robert Sheckley","Name":"Thrillers","Price":"11.90","Description":"This title, in a series of value-for-money c lassic short story anthologies, features the best of spine-c hilling&nbsp;thrillers&nbsp;from authors like Bram Stoker and Oscar Wild.&nbsp;","Category":{"CategoryName":"Thrillers"}},{"Author":"Jeffrey Archer","Name":"A quiver full of arrows","Price":"9.90","Description":"Two friends fall under the spell of a New York beauty - with an unexpected outcome. A casual remark is taken seriously by a Chinese sculptor, and the British Ambassador becomes the owner of a priceless work of art ...An insurance claims adviser has a most surprising encounter on the train home to Sevenoaks. The openings to three of this marvellous collection of stories that ends with a hauntingly written, atmospheric account of two undergraduates at Oxford in the 1930s, a tale of bitter rivalry that ends in a memorable love story.Quiver Full of Arrows is a collection of twelve exciting short stories from bestselling author, Jeffrey Archer. 'Jeffrey Archer has a gift for plot that can only be described as genius' Daily Telegraph","Category":{"CategoryName":"Thrillers"}},{"Author":"Jeffrey Archer","Name":"The Prodigal Daughter","Price":"7.90","Description":"Hers was the ultimate ambition ...The Prodigal Daughter is the magnificent story of love and politics that continues the saga Jeffrey Archer began with Kane and Abel. The titanic battle between two men obsessed with destroying each other follows on into the next generation. Florentyna Rosnovski, Abel's daughter, inherits all her father's drive, but none of his wealth. A woman gifted with beauty and spirit, but above all with indomitable will, she sets out in pursuit of an ambition that dwarfs both Kane and Abel, as she battles for the highest office of all ...'A storyteller in the class of Alexandre Dumas' Washington Post","Category":{"CategoryName":"Thrillers"}},{"Author":"Jeffrey Archer","Name":"To cut a long story short","Price":"9.90","Description":"The latest short-story collection from Britain's bestselling writer, 'the greatest storyteller of our age'. The latest collection from the master storyteller. The fourteen -- all new -- stories show Jeffrey Archer's great skills with a wide variety of character, of subject and of setting, but all with that trademark twist in the tail. Every reader will have their own favourites: the choices run from love at first sight across the railway tracks to the cleverest of confidence tricks, from the quirks of the legal profession to the creative financial talents of a member of Her Majesty's diplomatic service. One of the most intriguing describes a woman who only appears to her lover every six years. And one of the most powerful is the story of a wealthy man who declares himself bankrupt in order to discover which of his family and friends will support him. The last story, 'The Grass is Always Greener', is possibly the best piece Archer has written. To Cut a Long Story Short is Jeffrey Archer's fourth story collection, and shows him at the top of his form.","Category":{"CategoryName":"Thrillers"}},{"Author":"Ngaio Marsh","Name":"Death at the dolphin","Price":"6.90","Description":"The restoration of a bombed-out London theatre ends in violent death - and one of Marsh's most vivid and dramatic novels When the bombed-out Dolphin Theatre is given to Peregrine Jay by a mysterious wealthy patron, he is overjoyed. And when the mysterious oil millionaire also gives him a glove that belonged to Shakespeare, Peregrine displays it in the dockside theatre and writes a successful play about it. But then a murder takes place, a boy is attacked, the glove is stolen. Could it be that oil and water don't mix? Inspector Roderick Alleyn is determined to find out...","Category":{"CategoryName":"Thrillers"}},{"Author":"Arthur Hailey","Name":"Strong Medicine","Price":"8.00","Description":"Miracle drugs save lives and ease suffering, but for profit-motivated companies, the miracle is the money they generate...at any cost. Billions of dollars in profits will make men and women do many things--lie, cheat, even kill. now one beautiful woman will be caught in the cross fire between ethics and profits. As Celia Jordan's fast-track career sweeps her into the highest circles of an international drug company, she begins to discover the sins and secrets hidden in the research lab...and in the marketplace.&nbsp;Now the company's powerful new drug promises a breakthrough in treating a deadly disease. But Celia Jordan knows it may deliver a nightmare. \"A pure Hailey thriller. The action is fast paced; the dilemmas are true to life. \"Strong Medicine\" is just as labeled: an exciting stimulant.\" -- \"Tulsa World\"","Category":{"CategoryName":"Thrillers"}},{"Author":"Lee Child","Name":"One Shot","Price":"0","Description":"A lone gunman unleashes pandemonium when he shoots into a crowd of people in a public plaza in Indiana. Five people are killed in cold blood, shot through the head. But he leaves a perfect trail of evidence behind him, and soon the local police chief tracks him down. After his arrest, the shooter's only words are, 'Get Jack Reacher for me.' What could possibly connect this psychopath and the wandering dropout ex army cop? Critics call Lee Child's thriller series 'addictive', so here is our annual, much-longed for, Reacher fix","Category":{"CategoryName":"Thrillers"}},{"Author":"Derek Landy","Name":"Skulduggery pleasant playing with fire","Price":"0","Description":"Just when you think you've saved the world! \"You will kill her?\" the Torment asked. Skulduggery sagged. \"Yes.\" He hesitated, then took his gun from his jacket. \"I'm sorry, Valkyrie,\" he said softly. \"Don't talk to me,\" Valkyrie said. \"Just do what you have to do.\" Valkyrie parted her tunic, and Skulduggery pointed the gun at the vest beneath. \"Please forgive me,\" Skulduggery said, then aimed the gun at the girl and pulled the trigger. With Serpine dead, the world is safe once more. At least, that's what Valkyrie and Skulduggery think, until the notorious Baron Vengeous makes a bloody escape from prison, and dead bodies and vampires start showing up all over Ireland. With Baron Vengeous after the deadly armour of Lord Vile, and pretty much everyone out to kill Valkyrie, the daring detective duo face their biggest challenge yet. But what if the greatest threat to Valkyrie is just a little closer to home!?","Category":{"CategoryName":"Thrillers"}},{"Author":"Philip Pullman","Name":"The tiger in the well","Price":"0","Description":"Sally Lockhart is 25, and somebody wants to destroy her. She receives divorce papers from a man she has never met, let alone married - yet this trap is so well laid that she is powerless to prove otherwise. When custody of her precious daughter is awarded to this evil stranger, it is the beginning of a terrifying struggle in which Sally will have to fight, and kill if necessary, for the freedom of her family. Philip Pullman's ever-popular, action-packed Victorian melodramas are rejacketed for the bicentenary of Charles Dickens in 2012.","Category":{"CategoryName":"Thrillers"}},{"Author":"Hanif Kureishi","Name":"The black album","Price":"0","Description":"Shahid is a clean-cut student, trying to make an impression on his college lecturer, Deedee Osgood, who gives his spirits a lift when she takes him to a naked rave party. Shahid's academic prospects are threatened by the intervention of his gangster brother Chili, who, with his Armani suits and Gucci loafers, moves into Shahid's bedsit as a hideout, bringing unnecessary danger and excitement with him. Set in London in 1989, the year of the fall of the Berlin wall and the fatwah, \"The Black Album\" is a thriller with a characteristically lively background: raves, ecstasy, religious ferment and sexual passion in a dangerous time.","Category":{"CategoryName":"Thrillers"}},{"Author":"Kurt Singer","Name":"Tales from the unknown","Price":"0","Description":"THE HAUNTED AND THE HAUNTERWhat accursed force lurked in this ancient house?By Lord LyttonPSYCHIC ALERT SAVES A FILM STARHow Elke Sommer avoided an appointment with death.by Frank StevensTHE OUANGA CHARMWitness the mysterious Haitian voodoo rite.By W.B. SeabrookTHE GREEN JEWEL OF DEATHHow a great but bewitched emerald changed Russian history.by Princess Catherine RadziwillTHE MAN THEY COULDN'T HANGJohn Lee, the only an to cheat the gallows...and tellby Judge Marcus KavanaghTHE SHADOW AND THE FLESHA great writer's eerie experience with the supernaturalby Jack LondonWITCHCRAFT THE RELIGIONDoes the growth of Satan worship indicate a new power?by Raymond Buckland, ph.DI WALKED ON FIREOne man's incredible experience in the famous Tahitian ritual.By Wilmon Mendard","Category":{"CategoryName":"Thrillers"}},{"Author":"Lee Child","Name":"The Visitor","Price":"0","Description":"Sergeant Amy Callan and Lieutenant Caroline Cook have a lot in common. High-flying army career women, both are victims of sexual harassment from their superiors; both are force to resign from the service.And now they're both dead.Their unmarked bodies are discovered in their homes, naked, in baths filled with army-issue camouflage paint. Expert FBI psychological profilers start to hunt for a serial murderer, a smart guy with a score to settle, a loner, an army man, a ruthless vigilante known to them both.Jack Reacher, a former US military cop, is a smart guy, a loner and a drifter, as tough as they come. He knew both victims. For Agent-in-Charge Nelson Blake and his team, he's the perfect match. They're sure only Reacher has the answers to their burning questions: how did these women die? And why?","Category":{"CategoryName":"Thrillers"}},{"Author":"Bernard Cornwell","Name":"Excalibur","Price":"0","Description":"Arthur's final test of courage is upon him . . . Arthur has crushed Lancelot's rebellion, but at a cost. Guinevere's betrayal has left him reeling, and his Saxon enemies seek to destroy him while he is weak. Chaos threatens to engulf Britain. Yet Arthur is a military genius and noble leader. As the battle draws close, he prepares to fight his way to victory at Mount Badon and also win back the woman he lost. But in the final journey ofthe warlord, the intrigues of Mordred, now the adult heir to the throne of Britain, and the magics of the priestess Nimue could prove to be Arthur's downfall.","Category":{"CategoryName":"Thrillers"}},{"Author":"Paul McAuley","Name":"Players","Price":"0","Description":"A teenage girl, naked and badly injured, is discovered by two fisherman in mountain forest in Macabee County, Oregon. Before lapsing into a coma, she asks for someone called Billy, and dies before reaching hospital. The dead girl is identified as Edie Collier, last known to be living on the streets of Portland after quarrelling with her mother. That's how Summer Zeigler, a newly qualified police detective in the Portland Police Bureau gets involved: she arrested Edie for shoplifting six months before. Then the body of Edie's boyfriend, Billy, turns up in the Nevada desert. His manner of death, a wound caused by a crossbow bolt and the removal of his heart and eyes, links him to several other murders. Summer's investigations will lead her to the strange mansion of software millionaire Dirk Merrit, who made his fortune from a computer role-playing game known as Trans. But cyberspace is no longer enough to fulfil Merritt's grotesque fantasies. He wants to play a real-life version of his game. A game with deadly consequences&nbsp;...","Category":{"CategoryName":"Thrillers"}},{"Author":"Kathy Reichs","Name":"Break No Bones","Price":"0","Description":"It's the second-to-last day of archaeological field school. Dr Temperance Brennan's students are working on a site of prehistoric graves on Dewees, a barrier island north of Charleston, South Carolina, when a decomposing body is uncovered in a shallow grave off a lonely beach...The skeleton is articulated, the bone fresh and the vertebrae still connected by soft-tissue; the remains are encased in rotted fabric and topped by wisps of pale, blond hair - a recent burial, and a case Tempe must take. Dental remains and skeletal gender and race indicators suggest that the deceased is a middle-aged white male - but who was he? Why was he buried in a clandestine grave? And what does the unusual vertical hairline fracture of the sixth cervical vertebrae signify? While Tempe is trying to piece together the evidence, her personal life is thrown into turmoil. When a bullet - intended, perhaps, for her - puts Tempe's estranged husband Pete in hospital, her unexpectedly emotional response complicates her on-off relationship with Detective Andrew Ryan...But before long, another body is discovered - and Tempe finds herself drawn deeper into a shocking and chilling investigation, set to challenge her entire view of humanity","Category":{"CategoryName":"Thrillers"}},{"Author":"James Clavell","Name":"King Rat","Price":"0","Description":"Set in Changi, the most notorious prisoner of war camp in Asia, King Rat is an heroic story of survival told by a master story-teller who lived through those years as a young soldier. Only one man in fifteen had the strength, the luck, and the cleverness simply to survive Changi. And then there was King.","Category":{"CategoryName":"Thrillers"}},{"Author":"Agatha Christie","Name":"Cat Among The Pigeons","Price":"0","Description":"Late one night, two teachers investigate a mysterious flashing light in the sports pavillion, while the rest of the school sleeps. There, among the lacrosse sticks, they stumble upon the body of the unpopular games mistress   shot through the heart from point blank range.","Category":{"CategoryName":"Thrillers"}},{"Author":"Arthur Hailey","Name":"Hotel","Price":"0","Description":"A behind-the-scenes view of a major New Orleans hotel, the St Gregory, which introduces a host of characters - the tycoons who run the industry and the staff and guests in the hotel. The book became the basis of a major TV series.&nbsp;","Category":{"CategoryName":"Thrillers"}},{"Author":"James Clavell","Name":"Noble House","Price":"0","Description":"Over one hundred years have passed since Dirk Struan founded Hong Kong's oldest trading company. But now, the Noble House is in danger. As Hong Kong itself becomes the deadly playground of the CIA, the KGB and the People's Republic of China, rival tai-pans, seeking revenge for blood feuds over a century old, gather for the kill","Category":{"CategoryName":"Thrillers"}},{"Author":"The Listerdale Mystery","Name":"Agatha Christie","Price":"0","Description":"A selection of twelve classic mystery stories by the peerless Queen of Crime, including the acclaimed 'Philomel Cottage'...Twelve tantalizing cases...the curious disappearance of Lord Listerdale; a newlywed's fear of her ex fiance; a strange encounter on a train; a domestic murder investigation; a wild man's sudden personality change; a retired inspector's hunt for a murderess; a young woman's impersonation of a duchess; a necklace hidden in a basket of cherries; a mystery writer's arrest for murder; an astonishing marriage proposal; a soprano's hatred for a baritone; the case of the rajah's emerald. All have one thing in common: the skilful hand of Agatha Christie.","Category":{"CategoryName":"Thrillers"}},{"Author":"Agatha Christie","Name":"The Listerdale Mystery","Price":"0","Description":"A collection of 12 cases including the curious disappearance of Lord Listerdale, a strange encounter on a train, a domestic murder investigation, an astonishing marriage proposal and a necklace hidden in a basket of cherries.","Category":{"CategoryName":"Thrillers"}},{"Author":"Agatha Christie","Name":"Why didn't they ask Evans?","Price":"0","Description":"While playing an erratic round of golf, Bobby Jones slices a ball over the edge of a cliff. His ball is lost, but on the rocks below he finds the crumpled body of a dying man. With his final breath the man opens his eyes and says, \"Why didn't the ask Evans?\"","Category":{"CategoryName":"Thrillers"}},{"Author":"Agatha Christie","Name":"Evil Under The Sun","Price":"0","Description":"Agatha Christie's exotic seaside mystery thriller, reissued with a striking new cover designed to appeal to the latest generation of Agatha Christie fans and book lovers. It was not unusual to find the beautiful bronzed body of the sun loving Arlena Stuart stretched out on a beach, face down. Only, on this occasion, there was no sun...she had been strangled. Ever since Arlena's arrival at the resort, Hercule Poirot had detected sexual tension in the seaside air. But could this apparent 'crime of passion' have been something more evil and premeditated altogether?","Category":{"CategoryName":"Thrillers"}},{"Author":"Tai Pan","Name":"James Clavell","Price":"0","Description":"A thriller which tells of the founding of&nbsp;Hong Kong in the 1840s, where Dirk Struan, the ruler or tai pan, fights to establish himself and his dynasty as the masters of the Far East. From the author of&nbsp;SHOGUN, KING RAT, NOBLE HOUSE and GAI JIN.","Category":{"CategoryName":"Thrillers"}},{"Author":"The Girl Who Kicked The Hornet's Nest","Name":"Stieg Larsson","Price":"0","Description":"Lisbeth Salander  the heart of Larsson's two previous novels  is under close supervision in the intensive care unit of a Swedish city hospital. She's fighting for her life in more ways than one: when she's well enough, she'll stand trial for three murders. With the help of her friend, journalist Mikael Blomkvist, she will have to prove her innocence, and to identify the corrupt politicians who have allowed the vulnerable, like herself, to suffer abuse. And, on her own, she will plot her revenge  against the man who tried to kill her and the government institutions that very nearly destroyed her life. Once upon a time, she was a victim. Now Lisbeth Salander is ready to fight back. \"From the Hardcover edition.\"","Category":{"CategoryName":"Thrillers"}}]