[{"Author":"Colin Thubron","Name":"Among The Russians","Price":"11.90","Description":"A travel book recounting the author's experiences as he journeyed across a pre-Glasnost Soviet Union, describing the various places he visited and the different races of people he encounter","Category":{"CategoryName":"Travel"}},{"Author":"Dr. Angelika Taschen","Name":"Barcelona Hotels &amp; More","Price":"17.90","Description":"Angelika Taschen has selected a delectable range of hotels and hotspots for your stay in Barcelona, from the Hotel Neri in the Gothic district to the modern and minimal Hotel Omm with breathtaking views of GaudГ­'s Casa MilГ ; to the Casa Camper, a quirky and multicultural smoke-free hotel in the former prostitute quarter run by the famous Spanish shoe makers. She also tells you where to taste the best tapas and innovative Catalan cuisine as well as where to check out contemporary art exhibitions and the best markets.","Category":{"CategoryName":"Travel"}},{"Author":"Tim Flannery","Name":"The life and adventures of John Nicol mariner","Price":"12.90","Description":"In his many voyages, the Scottish-born sailor John Nicol (1755 - 1825) twice circumnavigated the globe, visiting every inhabited continent while participating in many of the greatest events of exploration and adventure of the eighteenth century. During his career Nicol battled pirates, traded with Native Americans, and fought for the British navy in the American and French revolutions. In Hawaii, he was entertained by the King's court mere days after the murder of Captain James Cook. In Jamaica, he saw firsthand the horrors of the slave system and befriended slaves who invited him to join in their dance celebrations. En route to Australia, he would meet the love of his life, Sarah Whitlam, a convict bound for the Botany Bay prison colony, who would bear his son before duty forced them apart forever. An international best-seller, The Life and Adventures of John Nicol, Mariner is a rousing memoir of an ordinary man's extraordinary life, a gripping true adventure tale. \"[Nicol has] made a lasting place for himself in the literature of the sea and ships he loved so deeply.\" -- Jonathan Yardley, The Washington Post","Category":{"CategoryName":"Travel"}},{"Author":"Rob Van der Plas","Name":"The bicycle touring manual","Price":"13.90","Description":"For touring cyclists, this new edition of Rob van der Plas' best-seller is as essential as a helmet and a tire patch kit. It answers virtually every question a cyclist could have while planning a tour ride, whether it's to the edge of the county or across the continent. The author is an experienced tour rider who has pedaled across the country and ridden abroad. He uses his vast experience to guide riders around potential pitfalls and mistakes that would otherwise diminish their touring pleasure. Everything from the makeup of the bicycle to packing the essentials and seeking lodging are covered. Safety issues, touring with children and touring abroad are also addressed, and help to make this guide indispensable for the cycling enthusiast.","Category":{"CategoryName":"Travel"}},{"Author":"Dan Kieran","Name":"Planes trains and automobilees","Price":"12.90","Description":"What is it about an engine roaring into life that makes grown men go weak at the knees? This is a book about machines and the men who love them. Some of these men are quite odd. Having always been a mechanaphobe himself, living in the slow lane, Dan Kieran is on a mission to discover the allure of machines and man's need for speed. Follow Dan as he climbs aboard a penny-farthing for a jaunt around west London, drives a steam train through the 'alps', joins the pit lane crew of Mitsubishi for the Britcar 24-hour race at Silverstone, discovers the link between Lawrence of Arabia and the 'wall of death', meets tank (yes, tank) collectors and the men behind 'digger ballet', learns to fly in the shadow of Douglas Bader and, along the way, wrestles with Aristotle, Jeremy Clarkson, Plato, Hunter S. Thompson and, mostly, himself. Join Dan as he makes a journey of discovery into another world, the happy and quirky world of the Great British potterer and machine enthusiast. Could he even be tempted to stay there?","Category":{"CategoryName":"Travel"}},{"Author":"Jeremy Clarkson","Name":"Don't Stop Me Now","Price":"11.90","Description":"Jeremy Clarkson knows there's more to life than cars. There is, after all, a whole world out there just waiting to be discovered. So, before he gets on with the job in hand, he'd like to take some time out to consider the bigger picture. Don't worry, he'll get on to the car bit eventually, but before he does, there's time to learn about: the unfortunate collapse of the British Empire; why Galapagos tortoises are all mental; France, reduced to the size of a small coconut; why Jeremy Paxman and the bass guitarist of AC/DC aren't so very different; the problems of being English; and, God's most stupid creation. And then there's the cars: whether it's the poxiest little runabout or an exotic, fire-breathing supercar, no one else writes about cars like Jeremy. Unmoved by official claims and uninterested in press junkets, he approaches anything on four wheels without fear or favour. What emerges from the ashes is not always pretty. But it is, invariably, very, very funny.","Category":{"CategoryName":"Travel"}},{"Author":"Peter Mayle","Name":"Bon Appetit","Price":"15.90","Description":"Gastronomy is a wonderful starting point to study France and the French. As the retired schoolmaster from Provence says 'The religion of France is food. And wine, of course.' And they put their money where their mouth is, spending a greater proportion of their income on food and drink than any other nation in the world. Literally hundreds of gastronomic fairs and festivals take place throughout the year all over France - a frog fair, an hommage to the sausage, to the turnip, to the quiche and the noble Camembert. What kind of person is a snail-fancier? Is there a brotherhood of sausage connoisseurs? How can you devote an entire weekend to the French fry? Peter Mayle finds out and brings hilariously and affectionately to life the people who can get passionate about a frog's leg or a well-turned omelette. Over ten years ago he transformed our feelings about Provence, now he captures the irresistible essence of France herself - and her food.","Category":{"CategoryName":"Travel"}},{"Author":"Rupert Attlee","Name":"The trail to Titicaca","Price":"12.90","Description":"A trio of inexperienced cyclists set out to pedal across South America, speared on by chocolate and vino, in this awe-inspiring tale spanning Chile, Argentina and Bolivia.","Category":{"CategoryName":"Travel"}},{"Author":"Christopher J A Smith","Name":"Why don't you fly","Price":"12.90","Description":"In May 2000 Chris Smith left his comfortable Worcestershire home, but instead of cycling the routine twelve miles to work, he kept on pedalling. Thirteen months later (having fallen off six times and worn out three sets of tyres, three chains and two pairs of boots) he arrived in Beijing. During a gruelling 16,500-mile examination of physical and mental stamina he traversed scorching deserts, scaled lofty peaks, crossed mighty rivers and risked extinction in the chaotic traffic of the cities. He ate and drank in roadside cafГ©s in the company of inquisitive lorry drivers and shared dormitories with farm hands and mosquitoes in remote Chinese villages. He survived bugs, blizzards, cockroaches, heat, hurricanes, sandstorms, cyclones, stone-throwing locals and lunatic drivers. Sceptical western existentialism encountered religious fatalism in the cafГ©s and teahouses of the Middle East and India during a physical and spiritual journey that constantly raised questions about attitudes and values widely taken for granted in the West. 'Why Don't You Fly?' is the account of an epic quest to rediscover a misplaced sense of identity in which exhilaration and exhaustion trade positions against a backdrop of prodigious physical endeavour. 'Fascinating reading.' -- 'Limited Edition' Magazine 'Smith's smart, honest prose is crafted superbly and peppered with wonderful moments of drama, dialogue and real humanity'. -- 'Asia and Away' Magazine","Category":{"CategoryName":"Travel"}},{"Author":"Signed Book DREAMING OF JUPITER Ted Simon","Name":"Unknown","Price":"24.90","Description":"Signed Book DREAMING OF JUPITER Ted SimonOur signed copies are brought to us by distributors of memorabilia and limited signed items in the UK and USA. Elephant Bookstore is responsible for the authentic origin of each product and adds itвЂ™s own certificate as a seller of limited and exclusive products.Back in the seventies, Ted Simon drove a Triumph motorcycle around the world. His book, Jupiter's Travels, became the acknowledged classic of motorcycle adventure. It inspired thousands, Ewan McGregor included, to roam the globe. Now in his own seventies, thirty years after his epic journey began, Ted has retraced that epic journey, still on a bike, to rediscover himself, his world and the memorable characters he met. A remarkable perspective on the world today.Hardcover","Category":{"CategoryName":"Travel"}},{"Author":"Anthony Smith","Name":"The old man and the sea","Price":"13.90","Description":"Octogenarian Anthony Smith's journey was originally inspired by both the Kontiki Expedition of Thor Heyerdahl (who he knew) and the incredible story of the survivors of a 1940 boat disaster, who spent 70 days adrift in the Atlantic, eventually reaching land emaciated and close to death.&nbsp;While this might sound like a voyage no-one would wish to emulate, to octogenarian Anthony Smith it sounded like an adventure, and he placed a typically straightforward advertisement in the Telegraph that read \"Fancy rafting across the Atlantic? Famous traveller requires 3 crew. Must be OAP. Serious adventurers only.\"&nbsp;In his inimitable style, Smith details their voyage and the hardships they endured with a matter-of-fact air that makes his story seem all the more impressive. His advanced age allows him a wider perspective not only on the journey but on life itself, and his never-say-die attitude to the difficulty of the journey is inspirational.&nbsp;вЂOld men ought to be explorersвЂ™ said T.S. Eliot, and this book certainly gives a compelling argument in his favour. It is both a great story (a huge storm on the final night of the voyage almost wrecked them on a reef) and a call to action for the older generation вЂ“ do not go quietly, says Anthony Smith, but seek out adventure as long as you are able.","Category":{"CategoryName":"Travel"}},{"Author":"Paul Torday","Name":"Salmon Fishing In The Yemen","Price":"12.90","Description":"Written as a 'report into the circumstances surrounding the decision to introduce salmon into the Yemen', this is a novel that is made up of emails, letters, diary extracts, records of Prime Minister's Question Time, interviews, and chapters from the memoirs of a fantastically weasely Peter Mandelson-type figure. The 'Yes Minister' comparisons are justified (and there is some brilliant, hilarious political and bureaucratic satire here), but at its heart it's the story of a hen-pecked, slightly pompous, middle-aged scientist who finds himself caught up in what seems like an impossible project, and of how this project changes his life. In the process he becomes an unlikely, and rather loveable hero, discovers true love for himself, finds himself both a pawn and then a victim of political spin, leaves his brilliantly horrible wife, and learns to believe in the impossible. And he takes the reader with him in the process' The author (a keen salmon fisherman himself) writes about salmon fishing with atmospheric reverence, deftly captures the hypocrisy of Western governments - who spot the PR angles of sending fish to the Middle East rather than soldiers - conveys the mindless bureaucracy of the civil service, and the government's skillful nurturing of deniability, and portrays a man who rather belatedly comes of age in extraordinary circumstances.","Category":{"CategoryName":"Travel"}},{"Author":"Bear Grylls","Name":"Born survivor","Price":"21.90","Description":"Bear Grylls is no stranger to extremes. During a three-year stint in the SAS he was involved in a horrific parachuting accident in Africa and broke his back in three places. Months of rehabilitation followed but, never losing sight of his childhood dream of climbing Everest, Bear went on to become the youngest Briton ever to reach the summit and survive. It was a close-run thing, however, as during the descent he was almost killed in a crevasse, his life saved only by his team-mate and a rope. In 2003 Bear completed another world-record-breaking expedition, leading his team through freezing spray and icebergs across the North Atlantic Ocean in a small inflatable boat. More drama followed as Bear, a karate black belt, set out to show the viewers of Channel 4 what it is really like to complete the gruelling basic training of the Foreign Legion. Now, in \"Born Survivor\" which accompanies a brand new eight-part series for Channel 4, the world's ultimate survivor shows us how to stay alive in the most unforgiving conditions on Earth. From crossing piranha-infested rivers and finding fresh food to building bush fires and fighting off grizzly bears - all manner of survival techniques from our most dangerous environments are covered. So, whether you find yourself stranded on a desert island in the Pacific, lost in the Lake District, or stuck in the snow on Greenland, once you've read this book, you too will be able to beat the elements and survive the wild.","Category":{"CategoryName":"Travel"}},{"Author":"Alec Le Sueur","Name":"The Hotel On The Roof Of The World: Five Years In Tibet","Price":"11.90","Description":"The very aptly named Mr Pong had the kind of breath that could stun at over ten meters...This wasn't just bad - there was something rotten down there. Something had crawled in and died. Gunter howled with laughter as he saw the look of horror on my face. It was the best entertainment he had seen since he had watched Chef chasing yaks through the kitchens. Few foreigners are lucky enough to set foot on Tibetan soil, but Alec Le Sueur spent five extraordinary years there, working in the unlikeliest Holiday Inn in the world. Against the breathtaking beauty of the Himalayas unfolds a highly amusing and enlightening account of his experiences. Fly infestations at state banquets, unexpected deliveries of live snakes, a predominance of yaks and everything yak-related, the unbelievable Miss Tibet competition, insurmountable communication problems and a dead guest are just some of the entertainments to be found at the 'Fawlty Towers' of Lhasa. Le Sueur, the only Westerner since the days of Heinrich Harrer to spend so long in Tibet, examines the country's intriguing cultural background, providing a fascinating insight into a country that was only just opening up to the outside world","Category":{"CategoryName":"Travel"}},{"Author":"Eric Newby","Name":"Slowly Down The Ganges","Price":"13.90","Description":"'Slowly Down the Ganges' is seen as a vintage Newby masterpiece, alongside 'A Short Walk in the Hindu Kush' and 'Love and War in the Apennines'. Told with Newby's self-deprecating humour and wry attention to detail, this is a classic of the genre and a window into an enchanting piece of history. On his forty-forth birthday, Eric Newby sets out on an incredible journey: to travel the 1,200-mile length of India's holy river. In a misguided attempt to keep him out of trouble, Wanda, his life-long travel companion and wife, is to be his fellow boatwoman. Their plan is to begin in the great plain of Hardwar and finish in the Bay of Bengal, but the journey almost immediately becomes markedly slower and more treacherous than either had imagined - running aground sixty-three times in the first six days. Travelling in a variety of unstable boats, as well as by rail, bus and bullock cart, and resting at sandbanks and remote villages, the Newbys encounter engaging characters and glorious mishaps, including the non-existence of large-scale maps of the country, a realisation that questions of pure 'logic' cause grave offense and, on one occasion, the only person in sight for miles is an old man who is himself unsure where he is. Newby's only consolation: on a river, if you go downstream, you're sure to end up somewhere...&nbsp;","Category":{"CategoryName":"Travel"}},{"Author":"Brian Jones","Name":"The greatest adventure","Price":"11.90","Description":"They could no longer be the first to climb Everest, reach the North and South Poles, sail around the globe, but they could be the first to fly around the world in a balloon - and they were. Written by the pilots, this is the account of their epic success. They describe the difficulties they faced and overcame during this feat of endurance.","Category":{"CategoryName":"Travel"}},{"Author":"Eric Newby","Name":"The last grain race","Price":"13.90","Description":"An engaging and informative first-hand account of the last 'grain race' of maritime history, from respected travel writer Eric Newby. In 1939, a young Eric Newby - later renowned as a travel writer of exceptional talent - set sail aboard Moshulu, the largest sailing ship still employed in the transportation of grain from Australia to Europe. Every year from 1921 to 1939, the vessels involved in the grain trade would strive to find the shortest, fastest passage home - 'the grain race' - in the face of turbulent seas, atrocious weather conditions and hard graft.First published in 1956, 'The Last Grain Race', featuring many photographs from the author's personal collection, celebrates both the spirit of adventure and the thrill of sailing on the high seas. Newby's first-hand account - engaging and informative, with frequent bursts of humour and witty observations from both above and below deck - chronicles this classic sailing voyage of the Twenties and Thirties, and records the last grain race of maritime history","Category":{"CategoryName":"Travel"}},{"Author":"Enamel Espresso Mug MOOMIN Snorkmaiden","Name":"Unknown","Price":"0","Description":"Enamel Espresso Mug MOOMIN Snorkmaiden&nbsp;Made&nbsp;in Finland by Muurla.Brighten your coffee- and teamoments with this mug. Fits even to a smaller hand due to its smaller size. Muurla combines design with durability in this retro&nbsp;Moomin&nbsp;metal mug.Size: 200ml.Color: RedMaterial: Metal /Does not contain Aluminium!/Dishwasher safe. Do not use in microwave.","Category":{"CategoryName":"Travel"}},{"Author":"Yann Arthus-Bertrand","Name":"The earth from the air 365 days","Price":"0","Description":"Yann-Arthus Bertrand's photographic daybook features over 200 completely new photographs. Each image is accompanied on its facing page by a thoughtful and thorough explanatory text. The images reach across the continents, from the icebergs of Antarctica to the cotton fields of India to the olive plantations of Spain. All 12 chapters of the book open with a thoughtful introduction by one of several noted authors who address a wide variety of subjects critical to the present and future health of our planet: agriculture, biodiversity, sustainable development, energy, forests, fresh water, seas, global warming. The book thus offers us a new perspective on our spectacular but fragile environment.","Category":{"CategoryName":"Travel"}},{"Author":"Richard Gordon Smith","Name":"The Japan diaries","Price":"0","Description":"The diaries of Richard Gordon Smith, an Edwardian explorer, naturalist and sportsman, are a fascinating personal record of the forty years he spent traveling throughout the world. With an unbound sense of adventure and curiosity, his journeys took him from the wilds of Quebec, to the exotic beauty of Burma, Ceylon and Singapore to Shanghai Korea and finally Japan, a country for which he formed a lasting passion.","Category":{"CategoryName":"Travel"}},{"Author":"Steve Jones","Name":"Darwins Island","Price":"0","Description":"The Origin of Species may be the most famous book in science but its stature tends to obscure much of Charles Darwin's other works. His visit to the Galapagos lasted just five weeks and on his return he never left Britain again. Darwin spent forty years working on the plants, animals and people of his native land and wrote over six million words on topics as different as dogs, insect-eating plants, orchids, earthworms, apes and human emotion. Together they laid the foundations of modern biology. In this beautifully written, witty and illuminating book, Steve Jones explores the domestic Darwin, tracing the great naturalist's journey across Britain: a voyage not of the body, but of the mind.","Category":{"CategoryName":"Travel"}},{"Author":"Ian Vince","Name":"Three men in a float","Price":"0","Description":"With a top speed of 15 miles per hour and fuel efficiency of a penny a mile, a decommissioned milk float is the ideal vehicle for an epic journey between England's most easterly and westerly points. After planning the entire trip on the back of a beer mat, buying a 1958 decommissioned milk float on eBay, and charging its tired batteries, the team set off from Lowestoft to Lands End. On the way, they discovered that their float needs to charge for eight hours for every two hours it spends on the road. Relying on the milk of human kindness, they were at the mercy of strangers every night, sometimes even using other people's cookers just to keep the show on the road.&nbsp;","Category":{"CategoryName":"Travel"}},{"Author":"Robert Byron","Name":"First Russia, Then Tibet: Travels Through a Changing World","Price":"0","Description":"Over the course of several months during 1931 and 1932, Robert Byron journeyed to three countries teetering on the brink of change. In Russia, which was stricken by famine, Lenin had just died, Stalin's dictatorship was in its infancy and the Great Terror was yet to begin. Having taken the first commercial flight to India, which took a week, Byron was thrown into the tumultuous last years of the British Raj. Gandhi was imprisoned while rioting and clashes between Hindus and Muslims had become commonplace. Finally Byron entered Tibet, the forbidden country. Exploring the Land of Snows, he saw Tibet as it was when the then Dalai Lama was still ensconced in the Potala Palace, twenty years before China's invasion. Blending classic travel writing with passionate observations on the deeper political and social issues of the time, Byron writes with uncanny prescience of the eventual horrors of the Soviet Union and the downfall of the Raj. As a piece of travel literature, \"First Russia, Then Tibet\" is compelling and beautifully-written. As a portrait of these countries in the 1930s, it is invaluable. Ultimately, it illuminates the constant quest for meaning that underscored Robert Byron's life and travels.","Category":{"CategoryName":"Travel"}},{"Author":"Joshua And David Borgenicht Piven","Name":"The Worst-Case Scenario Survival Handbook","Price":"0","Description":"From how to survive a volcanic eruption and how to escape from quicksand to how to fend off a shark attack or break down a door, this hands-on, illustrated, step-by-step instruction handbook provides frightening and funny real information in the bestselling tradition of \"The Paranoid's Guide\" and \"Hypochondriac's Handbook.\" Two-color diagrams.","Category":{"CategoryName":"Travel"}},{"Author":"Robert Macfarlane","Name":"Mountains of the mind","Price":"0","Description":"Combining accounts of legendary mountain ascents with vivid descriptions of his own forays into wild, high landscapes, Robert McFarlane reveals how the mystery of the world s highest places has came to grip the Western imagination and perennially draws legions of adventurers up the most perilous slopes. His story begins three centuries ago, when mountains were feared as the forbidding abodes of dragons and other mysterious beasts.In the mid-1700s the attentions of both science and poetry sparked a passion for mountains; Jean-Jacques Rousseau and Lord Byron extolled the sublime experiences to be had on high; and by 1924 the death on Mt Everest of an Englishman named George Mallory came to symbolize the heroic ideals of his day. Macfarlane also reflects on fear, risk, and the shattering beauty of ice and snow, the competition and contemplation of the climb, and the strange alternate reality of high altitude, magically enveloping us in the allure of mountains at every level.\"","Category":{"CategoryName":"Travel"}},{"Author":"Dervla Murphy","Name":"Full Tilt: Dunkirk To Delhi By Bicycle","Price":"0","Description":"Fulfilling a childhood dream, Dervla Murphy embarked in 1963 on an epic journey from Dunkirk to Delhi with her trusty bicycle, Roz. She began her trek during the worst winter in living memory, and even when the weather improved there were enough difficulties and dangers to satisfy the most intrepid of travellers. Her resourcefulness, however, matched up to her unexpected encounters, and she turned a blind eye to personal danger and discomfort. Yet, everywhere she ventured, she was met with kindness and hospitality, which is the focus of this travel diary.","Category":{"CategoryName":"Travel"}},{"Author":"Clive Johnson","Name":"Survival Tips","Price":"0","Description":"150 vital survival tips to get you out of every survival situation, wherever you are in the world- from the driest desert to the coldest ice cap.Clearly illustrated with more than 100 black-and-white illustrations.Includes a comprehensive appendix containing valuable travel information for more than 100 countries worldwide","Category":{"CategoryName":"Travel"}},{"Author":"Michael Palin","Name":"Inside Himalaya","Price":"0","Description":"Following the success of&nbsp;Inside Sahara, photographer Basil Pao documents another of Michael Palin's unforgettable journeys, this time to the top of the world: the amazing, breathtaking Himalayas. The 300 resulting photographs provide a dramatic visual record of an extraordinary trip, and will be tied to a Travel Channel special program.","Category":{"CategoryName":"Travel"}},{"Author":"Colin Thubron","Name":"Shadow Of The Silk Road","Price":"0","Description":"To be traveling the Silk Road is to be traveling the history of the world: tracing the passage not just of trade and armies, but also of ideas, religions, and inventions. Thubrons chosen route passes through China, Uzbekistan, Kyrgyzstan, Afghanistan, Iran, and Turkey.","Category":{"CategoryName":"Travel"}},{"Author":"Alain de Botton","Name":"The Art of Travel","Price":"0","Description":"The \"Art of Travel\" is Alain de Botton's travel guide with a difference: an exploration of why we travel and what we learn when we do. As seen on Channel 4 Few activities seem to promise is as much happiness as going travelling: taking off for somewhere else, somewhere far from home, a place with more interesting weather, customs and landscapes. But although we are inundated with advice on where to travel to, we seldom ask why we go and how we might become more fulfilled by doing so. With the help of a selection of writers, artists and thinkers - including Flaubert, Edward Hopper, Wordsworth and Van Gogh - Alain de Botton's bestselling \"The Art of Travel\" provides invaluable insights into everything from holiday romance to hotel minibars, airports to sightseeing. The perfect antidote to those guides that tell us what to do when we get there, \"The Art of Travel\" tries to explain why we really went in the first place - and helpfully suggest how we might be happier on our journeys. \"Richly evocative, sharp and funny. De Botton proves himself to be a very fine travel writer indeed\". (Sunday Telegraph\"). \"Delightful, profound, entertaining, I doubt if de Botton has written a dull sentence in his life\". (Jan Morris). \"An elegant and subtle work, unlike any other. Beguiling\". (Colin Thubron, \"The Times\"). Alain de Botton was born in 1969 and is the author of non-fiction essays on themes ranging from love and travel to architecture and philosophy. His bestselling books include \"Essays in Love\"; \"The Romantic Movement\"; \"Kiss and Tell\"; \"Status Anxiety\"; \"How Proust Can Change Your Life\"; \"The Pleasures and Sorrows of Work\"; \"The Art of Travel\"; \"The Architecture of Happiness and Religion for Atheists\". He lives in London and founded The School of Life and Living Architecture.","Category":{"CategoryName":"Travel"}},{"Author":"Patrick Leigh Fermor","Name":"Words Of Mercury","Price":"0","Description":"Patrick Leigh Fermor was only 18 when he set off to walk from the Hook of Holland to Constantinople, described many years later in A Time of Gifts and Between the Woods and the Water. It was during these early wanderings that he started to pick up languages, and where he developed his extraordinary sense of the continuity of history: a quality that deepens the colours of every place he writes about, from the peaks of the Pyrenees to the cell of a Trappist monastery.His experiences in wartime Crete sealed the deep affection he had already developed for Greece, a country whose character and customs he celebrates in two books, Mani and Roumeli, and where he has lived for over forty years. Whether he is drawing portraits in Vienna or sketching Byron's slippers in Missolonghi, the Leigh Fermor touch is unmistakable. Its infectious enthusiasm is driven by an insatiable curiosity and an omnivorous mind - all inspired by a passion for words and language that makes him one of the greatest prose writers of his generation.","Category":{"CategoryName":"Travel"}},{"Author":"Daeschner; J.R.","Name":"Eurotripping: A Bottom-Blowing, Baby-Jumping, Matchmaking Odyssey Around Europe","Price":"0","Description":"Not all Spaniards are Goat Tossers, not all Portuguese are Penis Cake Eaters and not all Frenchmen are Arse Blowers. But JR Daeschner knows quite a few who are. In Eurotripping, the American writer picks up where he left off with True Brits and crosses the Channel in search of Europe's most surreal traditions. From the far west of Ireland to the continental divide in Istanbul, he ventures where few foreigners have gone before, witnessing events such as the Rigor Mortis Procession in Galicia, Firedancing Festivals in Greek Macedonia and celebrations in honour of England's patron saint in the heart of the EU. Along the way, he's inducted into the Order of the Priceless Sardine in the Dordogne and meets countless characters, including a German detective turned 'love spy', the last of the Irish matchmakers, a Sicilian coprophile and a gay Turkish 'Bear'. Whether it's the furore over the camp following for Oil Wrestling in Turkey or the controversy surrounding the Dutch 'Santa' and his black sidekick, Daeschner finds that many of these centuries-old events reveal surprising insights into the issues facing Europe today. Eurotripping: if you think you know Europe, think again.","Category":{"CategoryName":"Travel"}},{"Author":"John Gisby","Name":"New Zealand with a hobbit botherer","Price":"0","Description":"What should you do if your spouse becomes addicted to the Lord of the Rings movies and swoons at the very mention of Orlando Bloom's name? (Thud. Quick, fetch the smelling salts.) How about taking the advice of a strange apparition that reveals itself in a dream? An apparition that looks remarkably like the director of the movies, Peter Jackson, but not quite remarkably enough to prompt legal action. An apparition that recommends touring New Zealand in an effort to prove that its sheep pastures aren't really filled by frolicking Hobbits. Just sheep and the occasional zorbing local. This is the hilarious tale of such a tour, featuring snow capped mountains and turquoise lakes, flightless birds and flying cattle, bungy jumping grannies and the carrot mafia, strange yellow eyes peering up from a road map and hotel receptionists always desperate to know win you are living","Category":{"CategoryName":"Travel"}},{"Author":"Patrick Leigh Fermor","Name":"A time of gifts","Price":"0","Description":"A Time of Gifts sees Patrick Leigh Fermor setting out at the age of 18 in 1933, on his epic journey across Europe from the Hook of Holland to Constantinople. This first volume takes the reader as far as Hungary.;Fermor offers compelling glimpses, not only of the events which were curdling Europe at that time, but also of the resplendent domes, the monasteries, the great rivers, the hospitable burgomasters, the sun on the Bavarian snow, the storks and frogs, the grandeurs and the courtesies.","Category":{"CategoryName":"Travel"}},{"Author":"Bruce Chatwin","Name":"In Patagonia","Price":"0","Description":"This \"little masterpiece of travel, history, and adventure\" (The New York Times) is Bruce Chatwick's exquisite account of his journey through the \"uppermost part of the earth\"--that stretch of land at the southern tip of South America, where bandits were once made welcome and Charles Darwin formed part of his \"survival of the fittest\" theory.","Category":{"CategoryName":"Travel"}}]