[{"Price":"7.90","Name":"Badge Old School United Black","Description":"Old school vintage badge with the words UNITED written in gold.&nbsp;This retro crimson enamel badge should take you back to your school days! Pin-backed, lozenge-shaped and perfect for general fans of United.Size:&nbsp;4.5 cm x 1 cm","Category":{"CategoryName":"Badges"}},{"Price":"7.90","Name":"Badge Old School United Red","Description":"Old school vintage badge with the words CHELSEA written in gold.&nbsp;This retro crimson enamel badge should take you back to your school days! Pin-backed, lozenge-shaped and perfect for general fans of Chelsea.Size:&nbsp;4.5 cm x 1 cm","Category":{"CategoryName":"Badges"}},{"Price":"7.90","Name":"Badge Old School Chelsea","Description":"Old school vintage badge with the words CHELSEA written in gold.&nbsp;This retro crimson enamel badge should take you back to your school days! Pin-backed, lozenge-shaped and perfect for general fans of Chelsea.&nbsp;Size:&nbsp;4.5 cm x 1 cm","Category":{"CategoryName":"Badges"}},{"Price":"7.90","Name":"Badge Old School Liverpool","Description":"Old school vintage badge with the words LIVERPOOL written in gold.&nbsp;This retro crimson enamel badge should take you back to your school days! Pin-backed, lozenge-shaped and perfect for Liverpudlians or just general fans of Liverpool.Size:&nbsp;4.5 cm x 1 cm","Category":{"CategoryName":"Badges"}},{"Price":"7.90","Name":"Badge Old School Dancing Queen","Description":"Old school vintage badge shaped like a shield with the words DANCING QUEEN written in gold on a pink background. The perfect accessory to your outfit if attending School Disco or Hen Night.The card which the badge is pinned to is like a old vintage school card, which the parents had to sign and hand back to the headmaster, if your grades were good you get a badge which suits you.Size: 33mm x 25mm","Category":{"CategoryName":"Badges"}},{"Price":"7.90","Name":"Badge Old School Birthday Girl","Description":"Old school vintage badge shaped like a shield with the words BIRTHDAY GIRL written in gold on a pink background. The perfect accessory to your outfit if attending School Disco or Hen Night.The card which the badge is pinned to is like a old vintage school card, which the parents had to sign and hand back to the headmaster, if your grades were good you get a badge which suits you.Size: 33mm x 25mm","Category":{"CategoryName":"Badges"}},{"Price":"7.90","Name":"Badge Old School Sinner&nbsp;","Description":"Old school vintage badge shaped like a shield with the word SINNER written in gold on a black back ground. The perfect accessory to your outfit if attending School Disco or Hen Night.The card which the badge is pinned to is like a old vintage school card, which the parents had to sign and hand back to the headmaster, if your grades were good you get a badge which suits you.\r\n\r\n\r\n\r\nSize: 33mm x 25mm","Category":{"CategoryName":"Badges"}},{"Price":"12.90","Name":"Pin Badge&nbsp;HOGWARTS","Description":"Metal enamel badge \"Draco-&nbsp;Dormiens Nunquam- Titillandus\" for Harry Potter fans with the official emblem of Hogwarts.&nbsp;Enamel cover3,5 cm","Category":{"CategoryName":"Badges"}},{"Price":"24.90","Name":"Keyring HOGWARTS&nbsp;","Description":"You'll probably never own the keys to Hogwarts, but at least you can get a keyring!&nbsp;4 cm x 4,5 cm","Category":{"CategoryName":"Badges"}},{"Price":"12.90","Name":"This Harry Potter Pin Badge would make a \r\nmagical gift for any fan of the films and books, be it those who grew up\r\n with Harry, Ron and Hermione or those being introduced to the \r\ncaptivating magic of an amazing franchise. Perfect for birthdays and \r\nChristmas stocking fillers.","Description":"No description available","Category":{"CategoryName":"Badges"}},{"Price":"12.90","Name":"Pin Badge SLYTHERIN","Description":"Attention: Not suitable for people who haven't read the books or seen the movies!&nbsp;Slytherin is one of the four Houses at Hogwarts School of Witchcraft and Wizardry. Founded by Salazar Slytherin, the house is composed mostly of pure-blood students, due to its founder's mistrust of Muggle-borns.Enamel cover3,5 cm","Category":{"CategoryName":"Badges"}},{"Price":"12.90","Name":"Pin Badge QUIDDITCH CAPTAINEnamel pin badge for every Harry Potter fan! In the fantasy world of the Harry Potter novels and movies, Quidditch is a magical competitive sport in involving flying contestants. Matches are played between two teams of seven players riding flying broomsticks, using four balls.Become the captain of the game and you'll surely get all points!","Description":"Metal with enamel cover3,5 cm x 1 cm","Category":{"CategoryName":"Badges"}},{"Price":"11.90","Name":"Pin Badge VOTES FOR WOMEN","Description":"If you have voted for a woman at the last elections, then you surely need to own such badge!&nbsp;","Category":{"CategoryName":"Badges"}}]