[{"Price":"12.90","Name":"Soap Laska YOGHURT AND LAVENDER&nbsp;","Description":"\"Laska by nature\" brings you the iconic Bulgarian soap, inspired by our native land and its exquisite gifts. You can find Laska's products in very few places&nbsp;and one of them is at the airport after you pass by passport check. Relax and unwind with this treat thanks to calming Bulgarian lavender essential oil. The oats will gently exfoliate your skin, the cold-pressed sunflower oil will hydrate it. Handmade slowly with a traditional method, this soap is naturally high in glycerine.Stirred, cut, caressed and wrapped by handNo animal testing0% palm oil 0% chemicals, synthetic fragrances or artificial colours130 g.&nbsp;Contains: Sodium Cocoate, Sodium Olivate, Sodium Sunflowerate, Sodium Sheabutterate, Aqua, Sheep milk, Glycerine, Clay, Pinus Sylvetris essential oil, Mentha arvensis essential oil, Limonene. The soap will perfectly go with Laska's linen bag, that you can also find our website.","Category":{"CategoryName":"Body Care"}},{"Price":"12.90","Name":"Soap Laska PINE AND MINT","Description":"\"Laska by nature\" brings you the iconic Bulgarian soap, inspired by our native land and its exquisite gifts. You can find Laska's products in very few places and one of them is&nbsp;at the airport after you pass by passport check. Let the aroma of pine and mint wash over your senses to uplit your spirit and energise your body. The Fuller's Earth will purify your skin, the cold-pressed sunflower oil will hydrate it, the rich sheep milk will soften it. Handmade slowly with a traditional method, this soap is naturally high in glycerine. Stirred, cut, caressed and wrapped by handNo animal testing0% palm oil 0% chemicals, synthetic fragrances or artificial colours130 g.Contains: Sodium Cocoate, Sodium Olivate, Sodium Sunflowerate, Sodium Sheabutterate, Aqua, Sheep milk, Glycerine, Clay, Pinus Sylvetris essential oil, Mentha arvensis essential oil, Limonene. The soap will perfectly go with Laska's linen bag, that you can also find our website.","Category":{"CategoryName":"Body Care"}},{"Price":"54.90","Name":"Manicure Set","Description":"Product No.74 from Gentlemen's Hardware.One true gent should be always fine and dandy- from nail to toe! You might think that nails are details, but this detail is what catches the eye first. Ladies, give a set to your loved gent to give him a sign... or so that you can secretly use it in case of emergency. The set comes in a wallet from canvas and leather and includes: 2 sizes nail clipper, scissors, nail file, tweezers and a&nbsp;cuticle pusher.6 instrumentsStainless SteelGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"44.90","Name":"Shaving Brush with Stand","Description":"Product No.34 from Gentlemen's Hardware- personally used and highly recommended by us! Let's get back to the real stuff, that have never failed us. The shaving brush! Same as your grandpa's, but higher quality, softer brush and better experience. With wooden handle, high quality plastic stand and soft brush.Length of the brush: 11,5cm, length of the stand: 7,5cm.","Category":{"CategoryName":"Body Care"}},{"Price":"39.90","Name":"Not specified","Description":"GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"29.90","Name":"&nbsp;Beard Balm","Description":"For the true gent who loves to look after his beard, there is no better way than with&nbsp;the&nbsp;finest Beard Balm by Gentlemen's Hardware. Cedarwood &amp; Lime scented and it comes in an elegant metal tin. Helps to control your beard while offering additional shine and conditioning.&nbsp;&nbsp; &nbsp; Made in the UK&nbsp;30 ml&nbsp;Size: 5 cm (diameter) x 2 cm&nbsp;Ingredients: Coconut oil, Shea butter, Argania Spinosa Kernel Oil, Beeswax, Sweet Almond oil, Lime Oil, Cedarwood Oil, Limonene, Linalool,Citral, Geranoil. Directions: Rub a small amount of the balm between your palms. Apply sparingly to lightly style your beard while further&nbsp;conditioning it. The more you use the more control you'll have. Comb after&nbsp;application.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"31.90","Name":"Post Shave Lotion","Description":"No international shipping!Apply this sandalwood-scented lotion after you shave to keep your skin supple and ready for the great outdoors. Box Size: 145 x 40 x 65mmCapacity: 100mlIngredients: Aqua (Water), Petrolatum, Cetearyl Alcohol, Glycerin, Isononsyl Isononanoate, Dimethicone, Glyceryl Stearate, PEG- 100 Stearate, Phenoxyethanol, Butyrospermum, Parkii Butter (Butyrospermum Parkii (Shea) Butter), Polysorbate 60, Parfum (Fragrance), Benzyl Alcohol, Caprylyl Glycol, Acrylates /C10- 30 Alkyl Acrylate Crosspolymer, Xanthan Gum, Ethylhexyglycerin, Disodium EDTA, Sodium Hydroxide, Coumarin, Hexyl Cinnamal, Alpha- Isomethyl Ionone, Eugenol, Cinnamyl Alcohol, Linalool, Butyphenyl Methypropional, Citronellol, Cinnamal, Geraniol, Amyl CinnamalGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Body Care"}},{"Price":"34.90","Name":"Hair And Body Wash&nbsp;","Description":"&nbsp;No international shipping!Product No. 66 from Gentlemen's Hardware. This authentic product has been crafted for the rigours of today's modern life and it is higly recommended and personally used by us! A truly excellent sandalwood scented haird and body wash for true gents who like things fine and dandy.Directions: Dispense a generous amount and apply to wet hair and body. Work the Hair and Body wash into a good lather and then rinse off with waterIngredients: Water, Sodium Laureth Sulfate, Sodium Chloride, Cocamidopropyl Betaine, Decyl Glucoside, Glycerine, Phenoxyethanol, Fragrance, Sodium Benzoate, Citric Acid, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Potassium Sorbate, Disodium EDTA, Polyquaternium-7, Coumarin, Hexyl Cinnamal, Alpha-isomethyl lonone, Cl19140 (FD&amp;C Yellow No.5), Cl 14700 (FD&amp;C Red No.4), Cl 42090 (FD&amp;C Blue No.1) GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Body Care"}},{"Price":"25.90","Name":"Shaving Cream","Description":"&nbsp;No international shipping!ThereвЂ™s no finer way for a chap to get ready for his close-up than with Gentlemen's HardwareвЂ™s best sandalwood-scented shaving cream. Box Size: 152 x 52 x 78mmCapacity: 150mlIngredients: Aqua (Water), Stearic Acid, Butylene Glycol, Parfum (Fragrance), Phenoxyethanol, Glyceryl Stearate, PEG- 100 Stearate, Cetyl Alcohol, Isopropyl Palmitate, Paraffinum Liquidum (Mineral Oil), Benzyl Alcohol, Caprylyl Glycol, Xantham Gum, Sodium Hydroxide, Ethylhexylglycerin, Disodium EDTA, Coumarin, Hexyl Cinnamal, Alpha- isomethyl, Ionone, EugenolGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Body Care"}},{"Price":"27.90","Name":"Hand Salve&nbsp;","Description":"&nbsp;No international shipping!Product No. 77 from Gentlemen's Hardware.This intensive and handsomely-packaged&nbsp;Gentlemen's Hardware is an excellent fragrance-free hand treatment that's been created to suit the rigours of modern life. Gently massage into the skin as needed to leave dry, hard-working hands feeling soft and smooth. Functional and authentic, it's a perfect gift for gents who like things fine and dandy!85g / 3 US oz.&nbsp;Fragrance freeIngredients: Petrolatum, Microcrystalline Wax, Polyethylene, Hydroxystearic Acid,&nbsp;Aluminum Starch Octenylsuccinate, Pentaerythrityl Tetra-di-butyl Hydroxyhydrocinnamete, Polybutene, Lavender Oil, Ethylhexyl Palmate, Cl19140 (Yellow 5 Lake), Cl77492 (Iron Oxides)GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"16.90","Name":"Hand Sanitiser OCD","Description":"&nbsp;No international shipping!If you're not sanitizing, you're getting infected. Open cap, sanitize, close cap. Repeat. Repeat. Repeat.2 oz.&nbsp;Ingredients: Ethyl Alcohol 62%, Water, Vegetable Glycerin, Isopropyl Myristate, Aloe Vera, Carbomer.","Category":{"CategoryName":"Body Care"}},{"Price":"7.90","Name":"Hand Sanitiser DID I REALLY TOUCH THAT","Description":"No international shipping!This antibacterial hand wash from Happy Jackson will leave you feeling clean and fresh. It gently cleanses the skin, while leaving a soft, subtle aroma of cucumber and mint.\r\nThe bright and colourful bottle features the words:\r\nвЂEUGH! DID I REALLY TOUCH THAT?!вЂ™\r\nIt is just the right size to carry around with you, so you can always feel free to live life hands on!60 ml / 2 fl. ozActive ingredients: Ethanol- 62%, Inactive ingredients: Aqua, poly (acrylic acid), glycerin, propylene glycol, triethanolamine,&nbsp;perfume (mint &amp; cucumber),&nbsp;benzyl salicylate, benzyl benzoate, geraniol, hydroxycitronellal,&nbsp;citronella, hexyl&nbsp;cinnamon, limonene, linalool.&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"6.90","Name":"Hello hands, let me hear you say YEAH!","Description":"No international shipping!Hello hands, let me hear you say YEEEEAAH! Your hands will explode from excitement! And the hand cream will revive them after the explosion. Moisturising, infused with nourishing shea butter. &nbsp;75 ml / 2,53 fl.ozIngredients: Water, Petrolatum, Isopropyl Palmate, Cetearyl Alcohol, Glycerin, Clyceryl Stearate, PEG-100 Stearate, Shea Butter, Dimethicone, Phenoxyethanol, Polysorbate 60, Fragnance, Benzyl Alcohol, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Xanthan Gum, Ethylhexyl Ionone, Butylphenyl Methylpropional, Hydroxisohexyl 3-cyclohexene Carboxaldehyde, Linalool, Coumarin, Citronellol, Limonene, Geraniol, Cl19140 (Yellow 5), Cl 14700 (Red 4).","Category":{"CategoryName":"Body Care"}},{"Price":"6.90","Name":"Hand Cream HIGH FIVE","Description":"No international shipping!Give your hands some AWESOME! Make your hands happy with this moisturising hand cream infused with nourishing shea butter to help replenish and revive dry skin.75 ml / 2,53 fl.ozIngredients: Water, Petrolatum, Isopropyl Palmate, Cetearyl Alcohol, Glycerin, Clyceryl Stearate, PEG-100 Stearate, Shea Butter, Dimethicone, Phenoxyethanol, Polysorbate 60, Fragnance, Benzyl Alcohol, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Xanthan Gum, Ethylhexyl Ionone, Butylphenyl Methylpropional, Hydroxisohexyl 3-cyclohexene Carboxaldehyde, Linalool, Coumarin, Citronellol, Limonene, Geraniol, Cl19140 (Yellow 5), Cl 14700 (Red 4).","Category":{"CategoryName":"Body Care"}},{"Price":"96.90","Name":"Beard Kit&nbsp;","Description":"No international shipping!Gentlemen's Hardware's products are personally used and highly recommended by us! Or at least the manly part of our team... The kit arrives in a metal box and includes: beard oil and beard balm (both nicely scented) and a beard comb (non-scented). You can also buy Gentlemen's Hardware beard oil on our website with spray and different scent.&nbsp;Beard oil: 30 ml. / dropper bottleBeard balm: 30 ml.Beard comb: 12 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil MOCHA","Description":"No international shipping!Made in USA.Beard with Mocha scent? Yes, please! Contains all natural ingredients that condition, moisturize, and \r\nstrengthen those precious beard hairs promoting healthy growth!!This product is also designed to condition the skin under your beard \r\npreventing dandruff and flaking to keep your beard life \r\ncomfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleCaramel Mocha Scent","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil HEAD HUNTER","Description":"No international shipping!Made in USA.HEAD HUNTER Beard Oil has a Tropical summer aroma that takes you and \r\nyour Beard on a Island Vacation... Just beware of the HEAD HUNTERS!! Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleTropical Summer Scent","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil VIKING","Description":"No international shipping!Made in USA.Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleвЂЁNo added scent, only natural aroma","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil OUTDOORSMAN","Description":"No international shipping!Made in USA.Outdoorsman Blend Beard Oil has a Great citronella scent that repels unwanted insects while still attracting the Ladies!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera 1 fl. oz. dropper bottleвЂЁCitronella Scent","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil BOURBON","Description":"No international shipping!Made in USA.This Top Notch Manly scent will \r\nset you aside from the rest of the Beards, The Women will want you and \r\nthe Men will want to BE YOU!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleвЂЁBourbon Scent","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil","Description":"No international shipping!Made in the UK.For the rigours of today's modern life. A truly excellent beard oil with a natural forest scent of cedarwood, pineleaf and eucalyptus. For true gents who like things fine and dandy.Directions: Place the desired amount of oil into palm. Rub hands together and evenly apply to facial hair and skin underneath. Discontinue use if irritation occurs. Avoid contact with eyes.Ingredients: Simmondsia Chinesis (Jojoba) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Ricnus Communis (Castor) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Cendrus Atlantica (Cedarwood) Bark Oil, Argania Spinosa (Argan) Kernel Oil, Pinus Sylvestris (Pine) Leaf Oil, Eucalyptus Globulus Leaf Oil, Limonine. Made with 100% natural ingredients!50 ml. / 1.7 US fl.oz.Glass bottle with pumpGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"Beard Oil ORIGINAL","Description":"No international shipping!&nbsp;&nbsp; Made in USA.This Top Notch Manly scent will set you aside from the rest of the Beards, The Women will want you and the Men will want to BE YOU!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!30 mlBottle with a dropperIngredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera.&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"39.90","Name":"Beard Wax CIGAR BLEND &nbsp;","Description":"No international shipping!Grave Before Shave Fisticuffs Cigar Blend Strong Hold Mustache Wax is hand poured Mustache Wax in a 1 ounce tin. Made with all natural ingredients and has a rich Cigar scent with Vanilla after notes. Maintains a \"strong hold\".Metal tinScent: Tabacco, Vanilla29 mlIngredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils","Category":{"CategoryName":"Body Care"}},{"Price":"54.90","Name":"Beard Balm HEAD HUNTER","Description":"No international shipping!Made in USA.вЂЁРўhis amazing balm helps to tame your beard reducing those pesky flyaway \r\nand unruly hairs, while deeply conditioning and protecting your manly \r\nmane!\r\nContains all natural \r\ningredients that condition, moisturize, and strengthen those precious \r\nbeard hairs promoting healthy growth!!вЂЁThis product is also designed to \r\ncondition the skin under your beard preventing dandruff and flaking to \r\nkeep your beard life comfortable...the way it should be!Ingredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils 2 oz. tinScent of Tropical Summer","Category":{"CategoryName":"Body Care"}},{"Price":"35.90","Name":"&nbsp;Beard Foam REUZEL&nbsp;","Description":"&nbsp;Made in the USA.&nbsp;REUZEL Beard Foam, our revolutionary patent-pending leave-in beard conditioner. Reuzel Beard Foam deodorizes your beard and absorbs quickly helping to tame and control. YouвЂ™ll look&nbsp;well-maintained with a beard thatвЂ™s incredibly soft and groomed. Formulated to sooth and condition your beard and the skin underneath to reduce itch, beardruff, promote thicker hair, tame&nbsp;rogue hairs, repair split ends, and to soften coarse hairs all while knocking out that funky smell. Instantly makes your beard appear thicker, and keeps your beard moisturized throughout the day.&nbsp;Easy to work with leaving your&nbsp;beard and mustache full, soft, and healthy.70 ml.Bottle with pumpFresh clean scent&nbsp;Ingredients: Aqua,&nbsp;Disodium Cocoyl Glutamate,&nbsp;Sodium PCA,&nbsp;Cocoamidopropyl Betaine,&nbsp;Cetrimonium Chloride, Leaf Extract, Rosemary, Benzyl Alcohol,&nbsp;Linalool,Limonene","Category":{"CategoryName":"Body Care"}},{"Price":"11.90","Name":"Long lasting luxury soap with pure vegetable base with essential oil.","Description":"Lavender and Vanilla scent56 g./ 2 oz.Reusable paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"54.90","Name":"&nbsp;Beard Balm CIGAR BLEND","Description":"&nbsp; &nbsp; &nbsp;Made in USA.вЂЁРўhis amazing balm helps to tame your beard reducing those pesky flyaway and unruly hairs, while deeply conditioning and protecting your manly mane!&nbsp;Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!60 ml&nbsp;2 oz. tinScent: Cigar Blend &nbsp;Ingredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"&nbsp;Beard Oil &nbsp;BAY RUM&nbsp;","Description":"&nbsp; Made in USA.This Top Notch Manly scent will set you aside from the rest of the Beards, The Women will want you and the Men will want to BE YOU!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!30 ml&nbsp;bottle with a dropperBay Rum scent&nbsp;Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera.&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"45.90","Name":"&nbsp;Beard Oil&nbsp;&nbsp;CIGAR BLEND VANILLA&nbsp;","Description":"&nbsp; &nbsp; Made in USA.Real men have beards, some even have mustaches. But in order to be a real gent you need to look after your facial hair. This oil can help you condition your skin underneath that beard of yours and get rid of the annoying itchy feeling. The rich cigar scent, with vanilla afternotes will make your beard grow healthy and shiny.&nbsp;1 OZ. Dropper BottleCigar Blend, Vanilla scent&nbsp;Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Vanilla.","Category":{"CategoryName":"Body Care"}},{"Price":"85.90","Name":"Shaving Kit","Description":"Products from Gentlemen's Hardware- personally used and highly recommended by us! Let's get back to the real stuff, that have never failed us. A shaving kit, which includes a brush + stand, shaving cream (150ml) and post shave lotion (100ml), that you can also purchase separately on our website.&nbsp;Sandalwood products","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap URANUSDoesn't Uranus belong in your bathroom?&nbsp;Unscented.&nbsp;","Description":"Weight: 56 g.&nbsp;/&nbsp;6 x 2 x 2,5 cm.&nbsp;Made in the USADoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp; Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Long lasting luxury soap with pure vegetable base with essential oil.&nbsp;","Description":"Jasmine and lemon peel&nbsp;scent56 g./ 2 oz.Reusable&nbsp;paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap NIHILISM","Description":"Nihilism.&nbsp;Soap.&nbsp;Unscented.&nbsp;Absolutely no absolutes.&nbsp;Yet oatmeal.&nbsp;All lather is meaningless. Weight: 56 g. / 6 x 2 x 2,5 cm.&nbsp;Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap I SAY FUCK IT","Description":"Made in USA.вЂЁ\"I say fuck it\"Long lasting luxury soap with pure vegetable base with essential oil.* Lavender and vanilla scentвЂЁ* 56 g./ 2 oz. - 8 x 5 x 1,5 cmвЂЁ* Reusable paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap HEY FLAWLESS","Description":"Made in USA.\"Hey flawless, when you die I'm taking your shoes.\"Long lasting luxury soap with pure vegetable base with essential oil.* Lavender and vanilla scentвЂЁ* 56 g./ 2 oz. - 8 x 5 x 1,5 cmвЂЁ* Reusable paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap Bad Decisions","Description":"Made in USA.\"Pretty good at bad decisions\"Long lasting luxury soap with pure vegetable base with essential oil. Gardenia and Orange scent56 g./ 2 oz.Reusable paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap YOU KILL ME","Description":"Made in USA.\"You kill me\"Long lasting luxury soap with pure vegetable base with essential oil.White tea and violet scent56 g./ 2 oz. - 8 x 5 x 1,5 cmReusable paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"39.90","Name":"Pocket Manicure Tool","Description":"Product No. 113 from Gentlemen's Hardware.&nbsp;This multifunctional multi tool from stainless steel will surprise you with it's compact size and 4 functions. Including: Nail Clipper, Knife, Nail Cleaner and Scissors.&nbsp;Size (folded): 5,5 cm. Stainless steel&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap JESUS WASHED","Description":"Made in Bethlehem.&nbsp;For sud's sake! Wash your feet. Wash someone else' s feet. Wash before Supper!&nbsp;Almond, cocoa butter scent.&nbsp;Weight: 56 g. / 6 x 2 x 2,5 cm.&nbsp;Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap FREEDOM","Description":"Give me your grungy, your mired, your muddy masses yearning to breathe freshness...&nbsp;Garden cucumber, olive oil scent.&nbsp;Try the rest of our FOAM SWEET FOAM soaps!&nbsp;Does ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.&nbsp;/Ingredients: glycerine, shea butter, cocoa butter, olive oil, grapeseed oil and ocean minerals from the shining sea/2 oz. / .56 g. / 6 x 2 x 2,5cm.Made in the USA","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap EUREKA","Description":"Archimedes was a genius and he knew that you always get your best ideas in the bath.&nbsp;If you need a think and a soak, you need&nbsp;EUREKA!&nbsp;-- with olive oil and a woodsy fresh scent.&nbsp;Effective on Floating Bodies!&nbsp;Take a bath and get ready to become inspired... or give it to a friend and give them ideas.&nbsp;\"Give me a place to stand on, and I can move the earth.\"&nbsp;- Archimedes&nbsp;\"Okay, big shot, now put down the lever and take a bath.\"- Archimedes' wife&nbsp;with olive oil and a woodsy fresh scentWeight: 56 g. / 6 x 2 x 2,5 СЃРј.Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.&nbsp;в†&nbsp;Try the rest of our FOAM SWEET FOAM soapshttp://www.elephantbookstore.com/index.php?route=product/category&amp;path=226_248&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap EINSTEIN","Description":"Contains 100% almond and cocoa butter scented molecules!&nbsp;WARNING: Do not use as a shampoo. May result in crazy genius hair. Almond, cocoa butter scent.&nbsp;Weight: 56 g. / 6 x 2 x 2,5 cm.Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap ANDY'S 15 MINUTES OF FOAM","Description":"Give One to Your Favorite Tub Girls!&nbsp;Bring one to your next Shower!&nbsp;Lavender, chamomile scentWeight: 56 g. / 6 x 2 x 2,5 cm.Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap ALICES TINY HAND","Description":"Dirty hands? Explain yourself!&nbsp;Wash your hands before you enjoy a cake on which EAT ME is marked in currants. Drink with a sort of mixed flavor of cherry-tart, custard, pineapple, roast turkey, toffy and hot buttered toast. Wash your hands before you enjoy a box of comfits.&nbsp;The ideal hand soap if you're a tiny little thing! &nbsp;The ideal hand soap if you're more than nine feet high!&nbsp;The perfect gift for the host of a Mad Tea-Party!&nbsp;Floral, cocoa butter scent.&nbsp;Weight: 56 g. / 6 x 2 x 2,5 cm.&nbsp;Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap FREUD'S WASH FULFILLMENT","Description":"Mysophobia* got you down? As the good doctor said, \"Dirt of any kind seems to us incompatible with civilization.\" Freudian Soap washes away germs and dirt and it's guaranteed to get your hands cleaner than your conscience.&nbsp;*not effective against agoraphobia, arachnophobia, or xenophobia&nbsp;Cucumber olive oil scent.&nbsp;Weight: 56 g. / 6 x 2 x 2,5 cm.&nbsp;Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap FRIDA","Description":"Wear your heart on your sleeve!&nbsp;Wear your soap on your sink!&nbsp;Make your bathroom tempestuous with flowers that aren't flowery and monkeys that aren't... well, okay, it's all about the monkeys.&nbsp;Your sink will be captivated by the soap that says, \"Yes, it's true I'm here, and I'm just as strange as you.\"&nbsp;Passionflower, olive oil scent.&nbsp;&nbsp;Weight: 56 g. / 6 x 2 x 2,5 cm&nbsp;Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.&nbsp;в†&nbsp;Try the rest of our FOAM SWEET FOAM soaps&nbsp;http://www.elephantbookstore.com/index.php?route=product/category&amp;path=226_248&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"15.90","Name":"Ingredients: Sodium Palmate, Sodium palm kernelate, Aqua, Glycerine, Parfum, Sodium chloride, Pantenol, Methyl paraben, Propyl paraben, Disodium EDTA, Color (Red No.40, Red No.33)","Description":"No description available","Category":{"CategoryName":"Body Care"}},{"Price":"29.90","Name":"Peachwood Comb&nbsp;","Description":"For hair or beard depends on you... or your gene. Gentlemen's Hardware's comb is made from high quality peach tree and guarantees durability. Especially if combined with the other GH products for hair and beard, your whole durable look is guaranteed as well.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Body Care"}},{"Price":"16.90","Name":"Hand Sanitizer I LOVE MY PENIS","Description":"&nbsp;No international shipping!Made in USA.Caution: Do not apply directly to penis.  Leaves hands feeling soft and relieved.Active ingredients: Ethyl Alcohol 62% Inactive ingredients: Water, Vegetable Glycerin, Isopropyl Myristate, Aloe Vera, Carbomer.2 oz/ 59 ml.","Category":{"CategoryName":"Body Care"}},{"Price":"26.90","Name":"Liquid Hand Soap WASH AWAY YOUR SINS","Description":"No international shipping!Kills sins on contact. Wash your hands after shaking them with a sinner. Easter Lily Scent.8 oz.&nbsp;Ingredients: Purified water, sodium coco sulphate, coco glucose, coco&nbsp;betaine, glycerin, aloe vera, sea salt, fragrance, caramel color, potassium&nbsp;sorbate.&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"54.90","Name":"Made in USA.вЂЁ","Description":"Рўhis amazing balm helps to tame your beard reducing those pesky flyaway and unruly hairs, while deeply conditioning and protecting your manly mane!&nbsp;Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"16.90","Name":"Hand Sanitizer SCOOPING MY POOP","Description":"Your cat wants to surprise you with a gift: hand sanitizer. And your cat also sends you a message: \"Dear human, thanks for scooping my poop. Reasons I'm not gonna do it myself: 1. It's not cute. 2. I'm busy sleeping a totally reasonable amount. 3. No thumbs. And come on... what else do you got going on?\"2 oz.&nbsp;Ingredients: Ethyl Alcohol 62%, Water, Vegetable Glycerin, Isopropyl Myristate, Aloe Vera, Carbomer.","Category":{"CategoryName":"Body Care"}},{"Price":"15.90","Name":"Soap DIRTY BITCH","Description":"The soaps are highly recommended and personally used by us! They are greasy and moisturizing.Know someone who needs to clean up their act? This is the perfect comedy\r\n gift! In bright pink with lots of sparkles to take the edge off your \r\ninsult! 9 x 6 x 2 cm.Ingredients: Sodium Palmate, Sodium palm kernelate, Aqua, Glycerine, Parfum, Sodium chloride, Pantenol, Methyl paraben, Propyl paraben, Disodium EDTA, Color (Red No.40, Red No.33)","Category":{"CategoryName":"Body Care"}},{"Price":"26.90","Name":"Face Wash&nbsp;","Description":"Highly recommended and personally used by us!A truly excellent face was for true gents who like things fine and dandy.Directions: Massage over wet face, avoiding the eye area. Rinse off with clean water.Ingredients: Water, Glycerin, Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Lauryl Glucoside, Phenoxyethanol, Sodium Chloride, Lauryl Lactate, PEG-150 Distearate, Caprylyl Glycol, Fragnance, Coco-Glucoside, Glyceryl Oleate, Disodium EDTA, Ethylhexylglycerin, Citric Acid, Panthenol, Benzophenone-4, Cocamidopropyl, Dimethylamine, Hexyl Cinnamal, Limonene, Tocopherol, Hydrogenated Palm Glycerides Citrate, Magnesium Nitrate, Magnesium Chloride, Methylchloroisothiazolinone, Methylisothiazolinone. 250 ml/ 8,4 US fl.oz.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;&nbsp;","Category":{"CategoryName":"Body Care"}},{"Price":"54.90","Name":"Beard Balm BOURBONMade in USA.вЂЁ","Description":"Рўhis amazing balm helps to tame your beard reducing those pesky flyaway \r\nand unruly hairs, while deeply conditioning and protecting your manly \r\nmane!\r\nContains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils 2 oz. tinBourbon Scented","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap Cute","Description":"Made in USA.\"Cute, but psycho, but cute.\"Long lasting luxury soap with pure vegetable base with essential oil. Gardenia and Orange scent56 g./ 2 oz.Reusable paper: instructions for paper swan","Category":{"CategoryName":"Body Care"}},{"Price":"16.90","Name":"Hand Sanitizer ANAL TRAVELERMade in USA.","Description":"Are you traveling? You're going to want to take the Anal Traveler Hand Sanitizer with you, because you just never know what unsanitary conditions you will encounter on your vacation. Better safe than sorry!Active ingredients: Ethyl Alcohol 62% Inactive ingredients: Water, Vegetable Glycerin, Isopropyl Myristate, Aloe Vera, Carbomer.2 oz/59 ml","Category":{"CategoryName":"Body Care"}},{"Price":"9.90","Name":"Soap VAN GOGH","Description":"What other soap lets you travel to the South of France without going broke and resorting to asking your brother for money? Van Gogh's Sunflower soap is a like a little Provence for your powder room.&nbsp;Keep this object like a treasure.&nbsp;Or use it to get your hands really clean.&nbsp;Give it to someone to let them know: \"I like you just the way you Arles.\"&nbsp;In retrospect, this will come to be considered your most important soap.&nbsp;Sunflower lavender scent.&nbsp;Weight: 56 g. /&nbsp; 6 x 2 x 2,5 cm.Made in the USAFOAM SWEET FOAMDoes ordinary soap leave your bathroom dull? Make your sink or tub interesting with these smart little soaps!&nbsp;Ponder.&nbsp;Rinse.&nbsp;Repeat.","Category":{"CategoryName":"Body Care"}}]