[{"Price":"18.90","Name":"Candy Book EDGAR ALLAN POE","Description":"Instead of containing the world-changing insights and critics of Edgar Allan Poe, this tiny book is full of grape-flavored\r\n candy decorated with Poe's face! Any sweet tooth with an out of \r\nbalance ego and superego will appreciate the 3.3 oz. of hard candy \r\ninside. The package looks great on a bookshelf with other books or in \r\nyour dream when you're naked at school eating candy while you watch a \r\nrocket launch.   Ingredients: Sugar, Corn Syrup, Citric Acid, Water, Artificial Banana Flavor, FD&amp;C Yellow, Titatium Dioxide.3,3 oz / 94,5 gGrape flavor","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Sugar, Gum Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, Soy Lecithin, Aspartame, Citric Acid, Acesulfame Potassium, Tapioca Dextrin,&nbsp;Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors (FD&amp;C Red 40, Red&nbsp;40 Lake), BHT (to maintain freshness). Contains&nbsp;Phenylalanine.","Description":"No description available","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints The Morning After","Description":"OMG! What happened last night? Where am I? And who is this guy in bed with me? And why is he dressed like Eleanor Roosevelt?&nbsp;If this monologue sounds even slightly familiar, then you might want to invest in a package or two of The Morning After Mints. Each beautifully decorated tin contains a plentiful portion of refreshing mints, guaranteed to take the bad taste out of your mouth. Just take one or two, quietly get dressed, slip out of the room, and pretend the whole thing never happened... until next time.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Relatively Strong","Description":"In Albert Einstein's Theory of Relativity, he describes gravity as a geometric property of space and time, commonly referred to as spacetime.&nbsp;This is not to be confused with dining, which is a combination of meals and time, commonly known as mealtime.&nbsp;Now, lunchtime and dinnertime can sometimes have an adverse impact on one's breath, making it difficult to have a goodtime and leading to a lot of alonetime. And that's where Einstein's Relatively Strong Mints come in.&nbsp;After mealtime, snacktime, or anytime, eat one or two of these tasty mints and your breath will be fresh in notime.&nbsp;Before you know it, you'll be having a goodtime and looking forward to bedtime.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Boss Lady","Description":"Made in Canada.Chew 'em up and Spit 'em Out.  Spicy cinnamon Boss Lady Gum keeps breath\r\n snappy and fresh.  Each trail blazin' box contains 8 sizzlin' nuggets.8 piecesCinnamon FlavorIngredients: Sugar, Gum Base, Corn Syrup&nbsp;(Glucose),&nbsp;Dextrose, Natural and Artificial Flavors, Soy Lecithin,&nbsp;Citric Acid, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors (FD&amp;C Red&nbsp;40, Red 40 Lake), BHT (to maintain freshness). Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum I Love My Penis","Description":"Made in Canada.Yours is probably made elsewhere?8 gumFruit tasteIngredients: Sugar, Gum Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, High Fructose Corn Syrup, Glycerine, Aspartame, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Camauba Wax, Artificial Colors (FD&amp;C Yellow 5, Yellow 5 Lake), Corn Strach, BHT (to maintain freshness), Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum My Favorite Salad Is Wine","Description":"Made in Canada.\"My favorite salad is gum\"8 gumFruit tasteIngredients: Sugar, Gum Base, Corn Syrup&nbsp;(Glucose), Dextrose, Natural and Artificial Flavors, High Fructose Corn Syrup,&nbsp;Glycerine, Aspartame, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Camauba&nbsp;Wax, Artificial Colors (FD&amp;C Yellow&nbsp;5, Yellow 5 Lake), Corn Strach, BHT (to maintain freshness), Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum I Need More Money And Power","Description":"Made in Canada.\"I need more money and power... and less shit from you people.\"8 gumMint tasteIngredients: Sugar, Gum Base, Corn Syrup&nbsp;(Glucose), Dextrose, Natural and Artificial Flavors, High Fructose Corn Syrup,&nbsp;Glycerine, Aspartame, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Camauba&nbsp;Wax, Artificial Colors (FD&amp;C Yellow&nbsp;5, Yellow 5 Lake), Corn Strach, BHT (to maintain freshness), Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum I Blogged Your Mama","Description":"Made in Canada.\"I blogged your mama! And tweeted your sister.\"You can dream freely, chewing that SINammon gum.8 piecesCinnamon flavorIngredients: Sugar, Gum Base, Corn Syrup&nbsp;(Glucose),&nbsp;Dextrose, Natural and Artificial Flavors, Soy Lecithin,&nbsp;Citric Acid, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors (FD&amp;C Red&nbsp;40, Red 40 Lake), BHT (to maintain freshness). Contains Phenylalanine. Allergen information: Manufactured on shared equipment with milk containing products. May contain milk.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Ponzi","Description":"Made in Canada.\"Ask me about my Ponzi scheme.\"Cheap and chewy.Get yours now.8 piecesPepermint flavorIngredients: Sugar, Dextrose, Gum Base, Corn Syrup (Glucose), Natural and Artificial Flavors, Sorbitol, Soy Lecithin, Aspertame, Acesulfame Potassium, Tapioca Dextrin, Titanium Dioxide, Confectioners Glaze, Carnauba Wax, Corn Starch, BHT (to maintain freshness). Contains Phenylalanine. Allergic information: May contain milk!","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Award For Getting Fat","Description":"Made in Canada.If there was an award for getting fat, I'd eat it... and the box it came in.So If anybody tells you that you eat too much, eat them too.8 piecesFruit flavoredIngredients: Sugar, Gum Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, Soy Lecithin, Aspartame, Citric Acid, Acesulfame Potassium, Tapioca Dextrin,&nbsp;Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors (FD&amp;C Red 40, Red&nbsp;40 Lake), BHT (to maintain freshness). Contains&nbsp;Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Erase Your Past","Description":"Made in Canada.Did you know that every seven years the cells in your body are discarded\r\n and replaced?  That means that one day soon, the very memories that \r\nhaunt you technically won't even have happened to you!&nbsp;8 piecesCinnamon flavorIngredients: Sugar, Gum&nbsp;Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, Soy Lecithin, Aspartame, Citric Acid, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors&nbsp;(FD&amp;C Red 40, Red 40 Lake), BHT (to mantain freshness). Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints After Therapy","Description":"Those of us who've been in therapy know that the real breakthroughs come after the session is over. You'll be riding home on the bus and suddenly shout, \"Oh my god! That's why I wanted to have sex with my grandmother!\" And that's why we've made&nbsp;After Therapy Mints.&nbsp;These deliciously potent marvels are specially formulated to help you process everything that came out during your session. As soon as you hand the therapist the check, pop one into your mouth and wait for the epiphanies to flow. Even if they don't come right away, you'll be rewarded with a minty blast that freshens your breath and clears your mind. They also come in a cool, reusable tin, that can hold your Paxils, Welbutrins, Xanaxes, and Prozacs with room left over for the next day's pills, too.Four out of five therapists recommend&nbsp;After Therapy Mints&nbsp;for their patients who eat mints.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Girl's Best Friend","Description":"Diamonds might be valuable, but they really don't do much. Mints, however, are delicious, they're refreshing, and they make your breath kissably sweet. So when you come right down to it,&nbsp;mints&nbsp;are a girl's best friend. (Guys -- if you really want to make your lady happy, buy her mints instead of diamonds. Trust us on this one.) Mints Are A Girl's Best Friend is the perfect accessory for any material girl. These tasty mints come packaged in a stunning collectible tin featuring the eternally radiant Marilyn Monroe.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Messiah","Description":"We all know that Jesus could cure lepers, mend cripples, and raise the dead. The Bible doesn't mention it, but J.C. also helped people with lesser problems, such as tennis elbow, bunions, and male pattern baldness. We're not sure where He weighed in on bad breath, so we've pitched in and created Messiah Mints. These saintly little peppermints&nbsp;come in an inspiring reusable metal tin and are guaranteed to make your breath minty fresh, even after a hearty meal of loaves and fishes.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Nikola Teslas ExperiMints","Description":"Nikola Tesla was a Serbian-American scientist, inventor, and polyglot. He was also a man so far ahead of his time that present-day technologies are still catching up with his ideas.&nbsp;Why not pop a couple of Nikola Tesla's Experimints in your mouth? Even if you don't experience a sudden epiphany you'll have the minty fresh breath of a genius.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Alices EnchantMints&nbsp;","Description":"They're simply wonderful! A gourmet mint that you'll never forget. Mints come in a metal box, beautifully decorated with original&nbsp;illustration by John Tenniel of our favorite Alice by Lewis Carrol.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Before During And After Sex","Description":"These are deliciously strong peppermints. Get a fresh minty flavor from these gourmet mints.&nbsp;Your love life won't be the same.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Mind Control","Description":"Not just a tin of delicious mints - a telepathic boost!&nbsp;NOW you can experience:Alpha waves from 8 - 15 Hz!Beta waves from 16 - 31 Hz!Gamma waves from 32 - 100 Hz!Delta waves up to nearly 4 Hz!Theta waves from 4 - 7 Hz!Mu waves from 8 - 12 Hz!You won't need the power of suggestion to be kissable!Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints PunishMints","Description":"How do you get your kicks?&nbsp;If cinnamon and habaГ±ero turn you on, you deserve a taste of this.&nbsp;Punishmints adminster a kick in every mint.&nbsp;Tingly yet? Thought so.&nbsp;They. Are. Hot.&nbsp;Don't just take our word for it. Searing is believing.&nbsp;Mistreat yourself.&nbsp;Ouch.Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Superstrong Manly","Description":"Let's get one thing straight - Manly Mints are not for everyone. They're not for fops, flakes, pansies, or any other form of girlie-man. It takes a special sort of guy to handle these potent mints. Oh, sure they're small. But in this one instance, size doesn't matter. Each mint packs a powerful peppermint kick that'll flatten lesser men. For your own protection, we've programmed a cutting-edge Manliness Detector into our e-commerce shopping cart.Good luck.&nbsp;Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints EmpowerMints","Description":"You can do it, ladies! And for those times you think you can't, Empowermints has got your back.&nbsp;These deliciously strong peppermints are formulated to give you an extra boost when the going gets rough and your confidence sags.&nbsp;Just pop one or two Empowermints into your mouth, roll up your sleeves and take care of business.&nbsp;Empowermints come in an inspiring reusable tin and work just as well on men, too.&nbsp;Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Invisibility","Description":"\"Dear Unemployed Philosophers Guild:I owe you an apology. When I first purchased your Invisibility Mints, I was certain they wouldn't work as promised. I mean, how could a tasty little peppermint actually make me invisible to co-workers, friends, and that cute stock boy at the Gristedes Supermarket? But, to my amazement, people began treating me like I wasn't even there! Subway station clerks would ignore my requests for directions, waiters paid no regard to my request for refills of coffee, and at this past Saturday's Match.com Single's Mixer, I sat for three hours and not one guy noticed me. It was amazing! I also love the metal tin they come in -- it's so attractive! So thank you, UPG, and please accept my apology for ever doubting you.Sincerely, Estelle Abernathy, NYC.(P.S.: I'm sorta getting lonely... Do you make an antidote? )\"Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Anti Gravity","Description":"We were going to call this New &amp; Improved Anti-Gravity Mints, but somehow that didn't seem right because we didn't improve them at all. In fact, we intentionally made them less powerful. You see, our old Anti-Gravity Mints formula simply worked too well -- we had trouble keeping them in stock. Not because they were selling that well, but cases of them were levitating off our warehouse shelves and out through the skylight. And when we did sell them, new problems arose. Customer after customer floated away, never to purchase from us -- or anyone else -- again. Talk about your bad business model! (We briefly considered offering free anchors with each purchase, but we dropped that idea, UPS rates being what they are.) So we were forced to&nbsp;re-formulate the recipe for Anti-Gravity Mints and make them more subtle. They're just as delicious as they always were, and still come in a really cool comic-book style tin. But now their anti-gravity&nbsp;effect is very, very subtle. We're not sure if you'll come back and buy more, but we know you'll be able to!&nbsp;Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"18.90","Name":"Candy SIGMUND FREUDSucking this candy doesn't mean anything except it's delicious!Instead of containing the world-changing insights and \r\nobservations of Sigmund Freud, this tiny book is full of banana-flavored\r\n candy decorated with Freud's face! Any sweet tooth with an out of \r\nbalance ego and superego will appreciate the 3.3 oz. of hard candy \r\ninside. The package looks great on a bookshelf with other books or in \r\nyour dream when you're naked at school eating candy while you watch a \r\nrocket launch.","Description":"Ingredients: Sugar, Corn Syrup, Citric Acid, Water, Artificial Banana Flavor, FD&amp;C Yellow, Titatium Dioxide.3,3 oz / 94,5 gBanana flavor","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum I Actually Gave A Shit","Description":"Made in Canada.\"I actually gave a shit earlier. You missed it.\"Your timing sucks. (And you know exactly who I'm talking about, don't ya?)8 piecesCinnamon flavorIngredients: Sugar, Gum Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, Soy Lecithin, Aspartame, Citric Acid, Acesulfame Potassium, Tapioca Dextrin,&nbsp;Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors (FD&amp;C Red 40, Red&nbsp;40 Lake), BHT (to maintain freshness). Contains&nbsp;Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Pizza","Description":"Made in Canada\"The difference between pizza and your opinion is that I asked for pizza.\"I imagine that this is what the Lady said to the Tramp, right before she\r\n walked out of the Red Sauce Joint they once called \"our place.\" It's a \r\nsad story, but it's a pretty funny gum.8 piecesCinnamon FlavorIngredients: Sugar, Gum Base, Corn Syrup&nbsp;(Glucose),&nbsp;Dextrose, Natural and Artificial Flavors, Soy Lecithin,&nbsp;Citric Acid, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Carnauba Wax, Corn Starch, Artificial Colors (FD&amp;C Red&nbsp;40, Red 40 Lake), BHT (to maintain freshness). Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Never Work With Friends","Description":"Made in Canada.\"Never work with friends or colleagues\"In fact, just never work. At all. Ever. Take a nap instead.(The jerk who stole your food from the break room? COLLEAGUE)8 piecesMint flavorIngredients: Sugar, Dextrose, Gum Base, Corn Syrup (Glucose), Natural and Artificial Flavors, Sorbitol, Soy Lecithin, Aspartame, Acesultame Potassium, Tapioca Dextrin, Titanium Dioxide, Confectioners Glaze, Carnauba Wax, Corn Starch, BHT (to maintain freshness). Contains Phenylalanine. Allergic information: Manufactured on shared equipment with milk containing products. May contain milk.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Fruit flavor","Description":"No description available","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Step Aside Coffee","Description":"Made in Canada.\"Step aside Coffee, this is a Job for Alcohol.\"I have a lot of experience, I've been at this for a long time. And I \r\nknow what I need to succeed. Booze, and lots of it. But only the \r\nexpensive kind. That's the trick.  8 pieces of candy-coated, \r\ncinnamon-flavored gum in each box.&nbsp;8 piecesCinnamon flavoredIngredients: Sugar, Gum Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, Glycerine, Aspartame, Citric Acid, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Carnauba Wax, Artificial Colors (FD&amp;C Red 40, Red 40 Lake), Corn Strach, BHT (to maintain freshness). Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum Fuck It","Description":"Made in Canada.My new personal motto!Pardon my French.&nbsp;8 piecesFruit flavorIngredients: Sugar, Gum Base, Corn Syrup&nbsp;(Glucose), Dextrose, Natural and Artificial Flavors, High Fructose Corn Syrup,&nbsp;Glycerine, Aspartame, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Camauba&nbsp;Wax, Artificial Colors (FD&amp;C Yellow&nbsp;5, Yellow 5 Lake), Corn Strach, BHT (to maintain freshness), Contains Phenylalanine&nbsp;and 0 fucks.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"4.90","Name":"Gum You're Beautiful","Description":"Made in Canada.\"You're beautiful, don't change!\"One of our favorite sentiments, now on a pretty little pack of gum. It's\r\n true, you know. Don't ever. 8 piecesFruit-flavoredIngredients: Sugar, Gum Base, Corn Syrup (Glucose), Dextrose, Natural and Artificial Flavors, High Fructose Corn Syrup, Glycerine, Aspartame, Acesulfame Potassium, Tapioca Dextrin, Gum Arabic, Confectioners Glaze, Carnauba Wax, Artificial Colors (FD&amp;C Yellow 5, Yellow 5 Lake), Corn Starch, BHT (to mantain freshness). Contains Phenylalanine.","Category":{"CategoryName":"Gums and Sweets"}},{"Price":"7.90","Name":"Mints Before The Kiss","Description":"Anyone who's ever been in love knows that kissing is an art form. It requires technique, sensitivity, and the ability to improvise when necessary.&nbsp;Like other art forms, kissing also requires preparation. If you just dive in without doing the necessary groundwork you're simply asking for trouble. And that's where Before The Kiss Peppermints come into the picture.&nbsp;These amazingly effective mints help prepare you for some serious smooching.&nbsp;As soon as you suspect the \"game is on,\" pop one or two into your mouth and let these little wonders work their magic.&nbsp;In mere seconds, your breath will feel as crisp and fresh as a frosted pine needle in a snow-covered forest. (analogy fans, please hold your applause)Before The Kiss Peppermints come packaged in a&nbsp;reusable tin, beautifully decorated with Klimt's masterpiece \"The Kiss.\" Mwah!&nbsp;Ingedients: Sorbitol, Natural Peppermint Oil, Other Natural and Artificial Flavors, Magnesium Stearate, Acesulfame PotassiumMade in USANet&nbsp;Weight: 40 g.&nbsp;Metal box","Category":{"CategoryName":"Gums and Sweets"}}]