[{"Price":"69.90","Name":"World Travel Map for Kids&nbsp;","Description":"A map of the world for children, which helps you learn about the world while playing.Choose the appropriate set of cards with animals or sights, along with your child place the cards in the correct countries and explore the world with pleasure.Cards and sticker set","Category":{"CategoryName":"Home & Travel"}},{"Price":"85.90","Name":"World Scratch Map Geography&nbsp;","Description":"The most detailed scratch and pin map of the world.&nbsp;The map contains many islands, small countries, cities and places of interest.Also you will get a scratch list with the worldвЂ™s most popular tourist destinations.Unique design with golden scratch layer.&nbsp;Just take the scratcher and scratch off the layer from the countries you have already visited and your own travel history will come alive in bright colors. This map will be an &nbsp;excellent adornment for the home and also an inspired present for your friends and family.Discover the whole world with travel map geography world!Map dimensions: &nbsp;88 СЃm x 60 cmThe map is made of high quality laminated paper (250 g/m ВІ)","Category":{"CategoryName":"Home & Travel"}},{"Price":"115.90","Name":"Not specified","Description":"Plastic World Travel | Scratch map | Black and GoldTravel Map Black is big wall world map with special scratch-off coating. You can easily mark countries as you visit them: just use a coin to remove gold scratch off coating and reveal the countries you have been to creating a vivid record of your travel history. Travel Map Black is limited edition of 1DEA.me and itвЂ™s only for people with sense of styleвЂў Map dimensions вЂ” 80 x 60 cm;вЂў Tube dimensions вЂ” 64 x 7 cm;вЂў The map is made of durable, flexible and tear-resistant plastic;вЂў Made in Ukraine.Amazing designThis is a unique &nbsp;personal Travel Map, which is very convenient and fun to mark the countries you have visited. You need to scratch &nbsp;by coin the countries you have been to, to see the colorful history of personal travel.&nbsp;Also you can draw routes of your travel and make notes on the map. All inscriptions can be easily erased with &nbsp;a sponge.Great PackageEvery map &nbsp;is packed into a stylish designed tube, which protects your Travel Map from damage and solves the problem how to pack your present.&nbsp;On the tube there is hidden information about how much you have to travel per year to open the whole world, so that the package is even informative.&nbsp;Size: 64Г—7 cmWhat's Insidespecial scraper;white marker for drawings;pins to attach scratch map to the wall;bag tag on your luggage;felt special shred to remove residual scratching;instructions.FeaturesSCRATCH COUNTRIESDRAW ROUTESDURABLE PLASTIC","Category":{"CategoryName":"Home & Travel"}},{"Price":"71.90","Name":"Cushion MOOMIN Yellow","Description":"If you already have enough of your favorite Moomin products- books, greeting cards and mugs, but you still want to add to your interior or simply buy as a gift for a true Moomin fan, then this cushion is the perfect idea!&nbsp;Made from extremely soft material and filled with faux fetter even for those of you who have allergies.&nbsp;Finished beautifully with a concealed zip.Dimensions: 36 cm x 38 cmZip on the bottom","Category":{"CategoryName":"Home & Travel"}},{"Price":"71.90","Name":"Cushion MOOMIN Pink","Description":"If you already have enough of your favorite Moomin products- books, greeting cards and mugs, but you still want to add to your interior or simply buy as a gift for a true Moomin fan, then this cushion is the perfect idea! Made from extremely soft material and filled with faux fetter even for those of you who have allergies. Finished beautifully with a concealed zip.Dimensions: 36 cm x 38 cmZip on the bottom","Category":{"CategoryName":"Home & Travel"}},{"Price":"21.90","Name":"Enamel Mug Espresso Mini","Description":"Product from \"The Adventure Begins\" series.&nbsp;We absolutely LOVE Gentlemen's Hardware's metal mugs! They are covered in enamel and style! Their size if perfect for espresso that you can enjoy at home or in the nature.Material: Metal9cm x 7cm x 6cm (Including Handle)","Category":{"CategoryName":"Home & Travel"}},{"Price":"45.90","Name":"Shaving Soap And Enamel Bowl","Description":"Product No. 63 from Gentlemen's Hardware.This product is highly recommended and also used by us! Take the Rough with the Smooth. Let's bring back that retro thing! Sandalwood Soap- 125 g.Metal Enamel BowlIngredients: Sodium Palmate, Sodium Palm Kernelate, Aqua (Water), Sodium Cocoyl Isethionate, Glycerine, Stearic Acid, PEG-7 Glyceryl Cocoate, Betaine, Olea Europea (Olive), Fruit Oil, Kaolin, Sodium PCA, PEG-150 Lanolin, Simmondsia Chinesis (Jojoba), Seed Oil, Parfum (Fragnance), Sodium Chloride, Sodium Isethianate, Disodium EDTA, Pentaerythrityl Tetra-di-butyl Hydroxyhydrocinnamate, Tretrasodium EDTA, Tetrasodium EDTA, Tertrasodium Etidronate, Coumarin, Hexyl Cinnamal, Cl 77891 (Titanium Dioxide)","Category":{"CategoryName":"Home & Travel"}},{"Price":"24.90","Name":"Enamel Mug &nbsp;MOOMIN Little My&nbsp;","Description":"Made&nbsp;in Finland by Muurla.Brighten your coffee- and teamoments with this mug. Fits even to a smaller hand due to its smaller size. Muurla combines design with durability in this retro&nbsp;Moomin&nbsp;metal mug.320 mlColor: Blue&nbsp;Material: Metal /Does not contain Aluminium!/Dishwasher safe. Do not use in microwave.","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"Enamel Mug MOOMIN Snufkin&nbsp;","Description":"Made&nbsp;in Finland by Muurla.Brighten your coffee- and teamoments with this mug. Fits even to a smaller hand due to its smaller size. Muurla combines design with durability in this retro&nbsp;Moomin&nbsp;metal mug.320 mlColor: YellowMaterial: Metal /Does not contain Aluminium!/Dishwasher safe. Do not use in microwave.","Category":{"CategoryName":"Home & Travel"}},{"Price":"24.90","Name":"Deep Enamel Plate&nbsp;","Description":"Blue enamel plate \"The Adventure BEGINS\".Perfect for your home or the nature /your second home/. Useful for not only soup but for pasta as well. And come on, who doesn't like pasta in the forest?Hand wash only.Not microwavable.Diameter: 21 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"37.90","Name":"Enamel Divided Plate&nbsp;","Description":"A plate divided to 3. If you are food separation fan or \"The Shawshank Redemption\" movie fan, then you'll love the plate. Well, the design is way prettier that just an ugly jail plate... \"The Adventure Begins\" reminds us of the Mountain and its beauties, doesn't matter if we're near or far from it. Easy to carry and travel with. Diameter: 27 cm.Material: MetalHand wash only!Not microwave safe!GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"59.90","Name":"Wooden Sketchbook N2 Elephant","Description":"Handmade in Bulgaria for Elephant Bookstore Ltd.This old school 80 page sketchbook with brown recycled paper is lovingly made from 200-300 year old wood,\r\n carefully recycled from the doors of abandoned houses in old villages \r\naround Veliko Tarnovo, the former medieval capital of Bulgaria, which \r\nmakes every cover completely unique. The paper is recycled and \r\nartificially aged too.Dimensions:&nbsp;&nbsp;19 СЃРј С… 14,5 СЃРј С… 2,5 СЃРј.Material: Wood, paper","Category":{"CategoryName":"Home & Travel"}},{"Price":"48.90","Name":"Wooden Notebook N3 Elephant&nbsp;","Description":"Handmade in Bulgaria for Elephant Bookstore Ltd. This old school 80 page notebook with brown recycled paper is lovingly made from 2-300 year old wood, carefully recycled from the doors of abandoned houses in old villages around Veliko Tarnovo, the former medieval capital of Bulgaria, which makes every cover completely unique. The paper is recycled and artificially aged too.Dimensions:&nbsp;11 СЃРј С… 14,5 СЃРј С… 2,5 СЃРј.Material: Wood, paper","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"Travel Mug &nbsp;Star Wars the Force is Strong","Description":"Even the mighty Empire bows to the power of caffine! Use the force with this classic travel&nbsp;mug. Porcelain mug with a soft flexible silicone lid. Perfect for travels or just on your way to work. Approximate capacity 450 ml.&nbsp;Dishwasher and microwave safe, however prolonged use in the dishwasher might dull the appearance of any decoration.&nbsp;Material: PorcelainSilicone lidApprox. size: 450 ml.Dishwasher and microwave safe","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Travel Mug Little Miss Giggles","Description":"Little Miss Giggles is an adorable girl with red pigtails who can't stop giggling. So if you have your own chirpy Little Miss Giggles in your life, delight them with this Travel Mug.Designed in England and made from durable plastic, the Little Miss Giggles Travel Mug features a handy screw-top lid, so your giggling companion can sip her coffee while she's on the go. And with the phrase: \"Life is better when you giggle\" printed on one side of the green body, this travel mug couldn't be more perfect for the happy person in your life!Made from durable plastic.Screw-top lid.Hand wash recommended.Capacity: 300ml.Dimensions: 8.5cm x 13cm.","Category":{"CategoryName":"Home & Travel"}},{"Price":"43.90","Name":"Torch THROW SOME LIGHT Product No.22 from Gentlemen's Hardware.","Description":"Navigate the dark in style and never get lost again with this robust and smart gold coloured torch.Boxed size: 6вЂќ x 2.25вЂќ x 2.25вЂќ.","Category":{"CategoryName":"Home & Travel"}},{"Price":"44.90","Name":"Shoe Polish Kit","Description":"Product No. 46 from Gentlemen's Hardware.You can always judge a man by his shoes! First impression last, so does a good shine.Black PolishNeutral Polish2 Brushes (hard and soft)Yellow Cloth","Category":{"CategoryName":"Home & Travel"}},{"Price":"34.90","Name":"Lavatory mist POOTIN &nbsp;","Description":"Make all your problems disappear with Putin's Lavatory Mist . Also it would look glorious in your bathroom. Scented with light jasmine and red tea. Once you try it, you will find yourself wrestling bears, covering filthy secrets and bringing odor to its knees. A little Pootin goes a long way. Trust me its worth every Ruble.&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;Made In the USA\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n156 ml\r\n16 cm&nbsp;\r\nWith a spray&nbsp; &nbsp;The price is for one item","Category":{"CategoryName":"Home & Travel"}},{"Price":"8.90","Name":"Time Turner Hermione","Description":"To all Harry Potter fans- the time turner is now a reality and we actually tested it- IT WORKS! It really does! Hurry up and get yours online, because if you wait to comeget it in person, the bookstore might have traveled away.The handles do not spin, but the rings do!Golden colorPlease do not forget that the turner is decorative, no matter how beautiful it is!&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"19.90","Name":"Tin Star Wars Millennium Falcon&nbsp;","Description":"A metal tin with a cool Star Wars Millennium Falcon design. Perfect for all kinds of gadgets and super hero stuff.Size:&nbsp;Super light&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"19.90","Name":"Tin Gadget Man Batman","Description":"Batman logo gadget tin. Even a superhero needs somewhere to stash his wares.&nbsp;Size: 18,5 cm x 13 cm x 6,5 cm.Super light&nbsp;Metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"Enamel Mug MOOMIN &nbsp;Xmas Hearts&nbsp;","Description":"Made&nbsp;in Finland by Muurla.Brighten your coffee- and teamoments with this mug. Fits even to a smaller hand due to its smaller size. Muurla combines design with durability in this retro&nbsp;Moomin&nbsp;metal mug.320 mlColor: RedMaterial: Metal /Does not contain Aluminium!/Dishwasher safe. Do not use in microwave.","Category":{"CategoryName":"Home & Travel"}},{"Price":"47.90","Name":"Doormat &nbsp;Welcome to the Dark Side","Description":"Even the dark side needs a doormat in front of the door. It makes the place cozier.Measures:&nbsp;60 x 40 cmMade of 58% PVC and 42% coconut (brush material).","Category":{"CategoryName":"Home & Travel"}},{"Price":"47.90","Name":"Doormat &nbsp;Welcome to the Batcave","Description":"Make your cave cozy and more homey with this amazing Batman doormat.&nbsp;Measures:&nbsp;60 x 40 cmMade of 58% PVC and 42% coconut (brush material).","Category":{"CategoryName":"Home & Travel"}},{"Price":"47.90","Name":"Doormat &nbsp;Harry Potter Hogwarts","Description":"Greet your guests with this officially licensed Harry Potter doormat featuring the Hogwarts logo.&nbsp;Measures 60 x 40 cmMade of 58% PVC and 42% coconut (brush material).","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Notebook A5 THE JOKER","Description":"A perfect bound leather look notebook featuring embossed Batman - The Joker HaHaHa artwork on the cover.&nbsp;The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap.&nbsp;A perfect gift for any Joker fan.180 pagesApproximate dimensions: 21 cm x 15 cm x 2 cm&nbsp;Storage pocket in the backPen loop and strap&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"34.90","Name":"&nbsp;Lighter TRANSFORMER","Description":"Limited edition windproof lighters, made with class and style!Warning! Lighters are not filled!","Category":{"CategoryName":"Home & Travel"}},{"Price":"7.90","Name":"Hand Sanitiser DID I REALLY TOUCH THAT","Description":"No international shipping!This antibacterial hand wash from Happy Jackson will leave you feeling clean and fresh. It gently cleanses the skin, while leaving a soft, subtle aroma of cucumber and mint.\r\nThe bright and colourful bottle features the words:\r\nвЂEUGH! DID I REALLY TOUCH THAT?!вЂ™\r\nIt is just the right size to carry around with you, so you can always feel free to live life hands on!60 ml / 2 fl. ozActive ingredients: Ethanol- 62%, Inactive ingredients: Aqua, poly (acrylic acid), glycerin, propylene glycol, triethanolamine,&nbsp;perfume (mint &amp; cucumber),&nbsp;benzyl salicylate, benzyl benzoate, geraniol, hydroxycitronellal,&nbsp;citronella, hexyl&nbsp;cinnamon, limonene, linalool.&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"6.90","Name":"Hello hands, let me hear you say YEAH!","Description":"No international shipping!Hello hands, let me hear you say YEEEEAAH! Your hands will explode from excitement! And the hand cream will revive them after the explosion. Moisturising, infused with nourishing shea butter. &nbsp;75 ml / 2,53 fl.ozIngredients: Water, Petrolatum, Isopropyl Palmate, Cetearyl Alcohol, Glycerin, Clyceryl Stearate, PEG-100 Stearate, Shea Butter, Dimethicone, Phenoxyethanol, Polysorbate 60, Fragnance, Benzyl Alcohol, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Xanthan Gum, Ethylhexyl Ionone, Butylphenyl Methylpropional, Hydroxisohexyl 3-cyclohexene Carboxaldehyde, Linalool, Coumarin, Citronellol, Limonene, Geraniol, Cl19140 (Yellow 5), Cl 14700 (Red 4).","Category":{"CategoryName":"Home & Travel"}},{"Price":"6.90","Name":"Hand Cream HIGH FIVE","Description":"No international shipping!Give your hands some AWESOME! Make your hands happy with this moisturising hand cream infused with nourishing shea butter to help replenish and revive dry skin.75 ml / 2,53 fl.ozIngredients: Water, Petrolatum, Isopropyl Palmate, Cetearyl Alcohol, Glycerin, Clyceryl Stearate, PEG-100 Stearate, Shea Butter, Dimethicone, Phenoxyethanol, Polysorbate 60, Fragnance, Benzyl Alcohol, Caprylyl Glycol, Acrylates/C10-30 Alkyl Acrylate Crosspolymer, Disodium EDTA, Xanthan Gum, Ethylhexyl Ionone, Butylphenyl Methylpropional, Hydroxisohexyl 3-cyclohexene Carboxaldehyde, Linalool, Coumarin, Citronellol, Limonene, Geraniol, Cl19140 (Yellow 5), Cl 14700 (Red 4).","Category":{"CategoryName":"Home & Travel"}},{"Price":"21.90","Name":"Mug HOGWARTS CREST BLACK&nbsp;","Description":"Show your school spirit with this cool Hogwarts mug. Ceramic mug, approximately 300 ml. Dishwasher and microwave safe, comes in a box.&nbsp;Size: 300 ml.Material: CeramicMicrowave and dishwasher safe","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Notebook &nbsp;A5 HARLEY QUINN&nbsp;","Description":"Hardback book with unlined Pages, made out of &nbsp;PU leather. Features&nbsp;handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider.&nbsp;A perfect gift and a must have for any&nbsp;DC Comics&nbsp;fans.Size: 21 x&nbsp;14.5 x 2cm180 pagesStorage pocket in the backPen loop and strap&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Notebook A5 &nbsp;Game of Thrones TARGARYEN&nbsp;","Description":"A perfect bound \"leather look\" Game of Thrones A5 notebook featuring embossed House Targaryen artwork on the cover. The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider. This officially licensed notebook is a perfect gift for any Game of Thrones fan.Premium Leather Effect A5 notebookElastic pencil holder and retaining strap featuring logo slider120 pagesCool embossed cover designOfficially licensed","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Candle QUEEN OF AWESOMENESS","Description":"Whether you are looking to add a touch of fun to your pampering sessions, or just a fresh new scent to your home, this colourful candle from Happy Jackson is sure to help.&nbsp;The beautifully fragranced, 100% soy wax candle has a sweet raspberry scent sure to leave you licking your lips in delight.Packaged in a colourful tin with the phrase&nbsp;Queen of Awesomeness!! yeah!&nbsp;on the front, the candle would make a wonderful addition to any room, and after you have enjoyed the delicious fragrance, the tin, with its bold design and bright colours would make a lovely storage piece for little trinkets or keepsakes.&nbsp;Height: 5,5 cm&nbsp;Diameter: 8,5cm.&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"45.90","Name":"Beard Oil OUTDOORSMAN","Description":"No international shipping!Made in USA.Outdoorsman Blend Beard Oil has a Great citronella scent that repels unwanted insects while still attracting the Ladies!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera 1 fl. oz. dropper bottleвЂЁCitronella Scent","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"Journal A5 FANTASTIC BEASTS&nbsp;","Description":"A journal for you to write down your spells and magic potions or documenting &nbsp;your Fantastic Beasts. The&nbsp;notebook has a PU leather cover and ties to keep it closed.&nbsp;There are approximately 120 lined pages and a page marker, &nbsp;size: A5. Would make a great gift for a Fantastic Beasts / Harry Potter fan!Size: A5PU leather&nbsp;Approx. 120 lined pages","Category":{"CategoryName":"Home & Travel"}},{"Price":"47.90","Name":"Doormat I Am The One Who Knocks","Description":"Be the one who knocks. Great house warming gift!  \r\n\t\t\t\t\t\t\tMeasures 60 x 40 cm\r\n\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t \r\n\t\t\t\t\t\t\tMade of 58% PVC and 42% coconut (brush material)","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Cigarette case WEED","Description":"Guaranteed good shit. Construction is an exact replica of a 1920's cigarette case. Features Chinese label, packaging, and advertising art that's been \"re contextualized\" to say the least).Dimensions: 10,5 x 7,5 cm.Material: metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Water Bottle YELLOW THIRST EXTINGUISHER&nbsp;","Description":"American style fire extinguisher in yellow. Reads 'Thirst Extinguisher' with branded Gulp tags.&nbsp;The bottle is metal and light,&nbsp;convenient for everyday use and on your trips. It has a foldable, built - in straw and a handle,&nbsp;super easy wipe clean material.&nbsp;Capacity: 750 mlMaterial: MetalFoldable, built - in strawEasy wipe clean material","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Water Bottle &nbsp;RED THIRST EXTINGUISHER","Description":"American style fire extinguisher in red. Reads 'Thirst Extinguisher' with branded Gulp tags.&nbsp;The bottle is metal and light,&nbsp;convenient for everyday use and on your trips. It has a foldable, built - in straw and a handle,&nbsp;super easy wipe clean material.&nbsp;Capacity: 750 ml&nbsp;Material: MetalHandleFoldable, built - in strawEasy wipe clean material","Category":{"CategoryName":"Home & Travel"}},{"Price":"85.90","Name":"Watch Dali&nbsp;","Description":"The other day, we were sitting in our cucumber slicing our eyeball with a razor blade when a brilliant idea came to us. \"Hey, we should make a Salvador Dali watch!\" So we took off our serpents, revived the bread basket, and got down to work. It took awhile, but we designed a wristwatch that we think Salvador himself would be proud to wear. The face of the watch depicts Dali himself, and his moving mustache serves as the watch's hands. An ant marches around the rim of the watch, ticking off the seconds. &nbsp;Japanese quartz movement&nbsp;1 year warranty&nbsp;Not waterproofFace is 33mm in diameterUnemployed Philosophers GuildвЂ™s WatchesBeing late is very well known activity for each of us, right? Well, the watches wonвЂ™t make us arrive on time, but surely will help us be fashionably late! Nothing can replace having a watch on your hand- thatвЂ™s never out of trend!&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Bowl Tardis","Description":"Doctor Who TARDIS Ceramic Bowl with \"Time and Relative Dimension In Space\" on the reverse.Diameter: 13,5 cm.&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"25.90","Name":"Ceramic Bowl BATMAN COSTUME","Description":"This bowl is definitely one of our loved ones! High quality ceramic, big enough and featuring a beautiful design? What do you need more? Material: CeramicDimensions: 8,5 cm (height), 13,5 cm (diameter)","Category":{"CategoryName":"Home & Travel"}},{"Price":"11.90","Name":"Collectors Tin DRACO","Description":"If you already have every Harry Potter item we offer and wonder what else you can add to your collection... or you need a box, where you can keep little (or not so little) things (coins, jewelry, treasures, secrets, folded wand or whatever you do not want to lose- this is the decision.&nbsp;\r\n\r\nBox size: 10cm x 7,5cm\r\nMaterial: Metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"11.90","Name":"Collectors Tin HUFFLEPUFF","Description":"If you already have every Harry Potter item we offer and wonder what else you can add to your collection... or you need a box, where you can keep little (or not so little) things (coins, jewelry, treasures, secrets, folded wand or whatever you do not want to lose- this is the decision.&nbsp;\r\n\r\nBox size: 10cm x 7,5cm\r\nMaterial: Metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"9.90","Name":"&nbsp;Soap WOMEN ARE FROM VAGINAS MEN ARE FROM BUTTHOLES","Description":"Now listen here young lady, there ARE a few differences between men and women. And it isn't just that men don't know how to fold laundry, or even that women are better at almost everything. It goes farther than that. Scented with jasmine and lemon peel. Each bar is made in the USA with 100% vegetable base and essential oils.56 gSize:&nbsp;8 СЃРј С… 5 СЃРј С… 2 СЃРј","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Cigarette Case SMOKE 'EM IF YOU GOT 'EM","Description":"Construction is an exact replica of a 1920's cigarette case. Light pocket size case, convenient for everyday use.Size:&nbsp;10,5&nbsp;С… 7,5 СЃРј.Material: Metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Cigarette Case NUT CASE&nbsp;","Description":"For those of you who are just &nbsp;the appropriate amount of crazy.&nbsp;Construction is an exact replica of a 1920's cigarette case.Size:&nbsp;10,5 x 7,5 cm.Material: Metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Material: metal","Description":"No description available","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Cigarette case CONDOMS","Description":"Tuition very expensive. Construction is an exact replica of a 1920's cigarette case. Features Chinese label, packaging, and advertising art that's been \"re contextualized\" to say the least).Dimensions:10,5 x 7,5 cm.Material: metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Dimensions: 10,5 x 7,5 cm.","Description":"Material: metal","Category":{"CategoryName":"Home & Travel"}},{"Price":"21.90","Name":"14 oz. / 400 ml.","Description":"No description available","Category":{"CategoryName":"Home & Travel"}},{"Price":"2.90","Name":"Timeless tin &nbsp;I MAKE BAD DECISIONS&nbsp;","Description":"Рђ teeny tiny timeless tin for everything. Convenient pocket size for everyday use.Size: 6 cm x 4 cm","Category":{"CategoryName":"Home & Travel"}},{"Price":"2.90","Name":"Timeless tin ERASMIC SOAP&nbsp;","Description":"Рђ teeny tiny timeless tin for everything. Convenient pocket size for everyday use.&nbsp;Size: 6 cm x 4 cm","Category":{"CategoryName":"Home & Travel"}},{"Price":"2.90","Name":"Timeless tin VOGUE&nbsp;","Description":"Рђ teeny tiny timeless tin for everything. Convenient pocket size for everyday use.&nbsp;Size: 6 cm x 4 cm&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"24.90","Name":"Vase Kite Strings by David Parsons","Description":"One of its greatest strengths lies in the holdings of British 20th century textiles from leading manufacturers and designers. drawing from this unrivalled national collection this detail from Kite Strings was designed by David Parsons in Britain, 1956.The V &amp; A is the world's leading museum of art and design with collections unrivalled in their scope and diversity. It was established to make works of art available to all and to inspire British designers and manufactures. Today, the V &amp; A's collections, which span over 2000 years of creativity in virtually every medium and from many parts of the world, continue to intrigue, inspire and inform.Height: 23 cm.Diameter: 11,5 cm.","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Lunch box LITTLE MISS GIGGLES","Description":"Show your character with these eye-catching lunch boxes, part of the&nbsp;Mr. Men and Little Miss&nbsp;Range; Includes a character appropriate slogan on the back and a handy elastic strap to keep your lunch secure in its box.Material: plasticTight fit for freshnessEasy wipe cleanElastic strapMeasures: 12.5 cm x 18.5 cm x 6 cm (deep)Do not put in dishwasher or microwave&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Lunch Box | Little Miss Princess","Description":"Show your character with these eye-catching lunch boxes, part of the&nbsp;Mr. Men and Little Miss&nbsp;Range; Includes a character appropriate slogan on the back and a handy elastic strap to keep your lunch secure in its box.Little Miss&nbsp;Princess&nbsp;printed designtight fit for freshnesseasy wipe cleanelastic strapmeasures: 12.5 cm x 18.5 cm x 6 cm (deep)в† Do no put in disherwasher or mircowave","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Lunch box MR. HAPPY","Description":"Show your character with these eye-catching lunch boxes, part of the&nbsp;Mr. Men and Little Miss&nbsp;Range; Includes a character appropriate slogan on the back and a handy elastic strap to keep your lunch secure in its box.tight fit for freshnesseasy wipe cleanelastic strapmeasures: 12.5 cm x 18.5 cm x 6 cm (deep)Do not put in dishwasher &nbsp;or microwave&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Lunch Box MR. GRUMPY&nbsp;","Description":"Show your character with these eye-catching lunch boxes, part of the&nbsp;Mr. Men and Little Miss&nbsp;Range; Includes a character appropriate slogan on the back and a handy elastic strap to keep your lunch secure in its box.Material: plasticTight fit for freshnessEasy wipe cleanElastic strapMeasures: 12.5 cm x 18.5 cm x 6 cm (deep)Do not put in dishwasher or microwave&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Lunch box SALAD NUTS &amp; FRUIT&nbsp;","Description":"Two-tone glossy lunch box with elasticated strap to keep your lunch safe. Say NO to the risky lifestyle and take your own Happy Jackson lunch box for a stress - free life.&nbsp;Measures: 17,8 cm x 12,7 cm x 6,4 cmPlasticElasticated strapNot Microwave Safe, Not Recommended for Dishwasher Use","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Lunch Box MY LUNCH&nbsp;","Description":"Two-tone glossy lunch box with elasticated strap to keep your lunch safe. Say NO to the risky lifestyle and take your own Happy Jackson lunch box for a stress - free life.&nbsp;Measures:&nbsp;12.5 cm x 18.5 cm x 6 cmPlasticElasticated strapNot Microwave Safe, Not Recommended for Dishwasher Use","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Lunch Box YAY LUNCH","Description":"Two-tone glossy lunch box with elasticated strap to keep your lunch safe. Say NO to the risky lifestyle and take your own Happy Jackson lunch box for a stress - free life.&nbsp;PlasticMeasures:&nbsp;12.5 cm x 18.5 cm x 6 cmElasticated strapNot Microwave Safe, Not Recommended for Dishwasher Use","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Lunch Box SNACK TASTIC","Description":"Two-tone glossy lunch box with elasticated strap to keep your lunch safe. Say NO to the risky lifestyle and take your own Happy Jackson lunch box for a stress - free life.&nbsp;Measures: 17,8 cm x 12,7 cm x 6,4 cmPlasticElasticated strapNot Microwave Safe, Not Recommended for Dishwasher Use","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"Vintage Bike Bell SAVED BY THE BELL","Description":"Product No. 108 from Gentlemen's Hardware&nbsp;Be safe with the Gentlemen's Hardware Trusty Bike Bell. Always there in your time of need.Approx. size 5.5 cm&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"39.90","Name":"Bike Multi Tool&nbsp;","Description":"Product No. 103 from Gentelmen's Hardware&nbsp;The perfect cyclist's companion for repairs on the go. Including 10 folding tools:Chain - breaker 2 x screwdriversT25 tore head key 2 - 8 mm hex keys 8 - 10 m hex wrenches&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"37.90","Name":"Grow It WINE&nbsp;","Description":"Grow red grapes in your own home. Growing your grapes is simple - everything you need is inside this gift box including starter growing pots, compost discs, seeds and a booklet containing growing tips.Become a wine connoisseur and grow your own red grapes.2 packets of red grape seeds5 starter growing pots made from coconut husk5 natural coconut husk compost discs which expand when watered5 wooden plant markers&nbsp;Your growing instructions booklet","Category":{"CategoryName":"Home & Travel"}},{"Price":"28.90","Name":"Water bottle H2AWESOME&nbsp;","Description":"Hydrate on the move with this flip-top water bottle from Happy Jackson. It features the words вЂH2AWESOME!вЂ™, and will leave you feeling, as well as looking, just that!600ml&nbsp;\r\nflip open lid&nbsp;\r\nMetal, plastic, rubber&nbsp;\r\nStrap for hooking it around your wrist or elsewhere&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"37.90","Name":"Grow It CHILLI PEPPERS","Description":"Grow five different types of chilli plants in your own home. Growing your chillies is simple - everything you need is inside this gift box including starter growing pots, compost discs, seeds and a booklet containing growing tips.Grow five different types of chilli plant with this red hot gift box!1 packet of Tabasco chilli seeds1 packet of Habanero chilli seeds1 packet of Bhut Jolokia chilli seeds1 packet of Jalapeno chilli seeds1 packet of Scotch Bonnet chilli seeds5 starter growing pots made from coconut husk5 natural coconut husk compost discs which expand when watered5 wooden plant markersYour growing instructions booklet&nbsp;&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"14.90","Name":"Notebook A6 Futile Attempt","Description":"With colourful gilded edges, printed endpapers and coloured elastic closure. Reads Futile Attempt at Organising my Life on the front cover. &nbsp;Colour: Blue","Category":{"CategoryName":"Home & Travel"}},{"Price":"18.90","Name":"Snack Bowl for kids NOM NOM&nbsp;","Description":"Special snack bowl containing not one but two departments made for kids. Colorful and attractive so it turns eating into a game - yellow bottom with green cover, that says \"My little bits of YUM! ... nom, nom, nom\".Large: hight 7cm ; diameter 13,5 cmSmall: hight 3 cm ; diameter 12 cm&nbsp;400 mlTwo kid's size spoons&nbsp;NOT suitable for: microwave, oven and dishwasher use&nbsp;Plastic","Category":{"CategoryName":"Home & Travel"}},{"Price":"37.90","Name":"Grow It CHOCOLATE FLOWERS","Description":"Grow chocolate scented flowers in your own home. Growing your flowers is simple - everything you need is inside this gift box including starter growing pots, compost discs, seeds and a booklet containing growing tips.\r\nMake your garden or home smell delicious by growing these chocolate scented flowers.2 packets of chocolate scented flower seeds5 starter growing pots made from coconut husk5 natural coconut husk compost discs which expand when watered5 wooden plant markersYour growing instructions booklet","Category":{"CategoryName":"Home & Travel"}},{"Price":"37.90","Name":"Grow It COFFEE","Description":"Grow coffee plants in your own home. Growing your coffee plants is simple - everything you need is inside this gift box including starter growing pots, compost discs, seeds and a booklet containing growing tips.\r\nEveryone needs their morning coffee and whatвЂ™s better than growing your own at home.&nbsp;4 packet of beer hops seeds5 starter growing pots made from coconut husk5 natural coconut husk compost discs which expand when watered5 wooden plant markersYour growing instructions booklet","Category":{"CategoryName":"Home & Travel"}},{"Price":"37.90","Name":"Grow It BEER","Description":"Grow beer hops in your own home. Growing your beer hops is simple - everything you need is inside this gift box including starter growing pots, compost discs, seeds and a booklet containing growing tips.4 packet of beer hops seeds5 starter growing pots made from coconut husk5 natural coconut husk compost discs which expand when watered5 wooden plant markersYour growing instructions booklet","Category":{"CategoryName":"Home & Travel"}},{"Price":"32.90","Name":"Very shiny trowel that you just wouldn't let get dirty. But that's her job. The beautiful look is a textile adapted design from William Kilburn 1788-1792. Take care of your castle's gardens by giving yourself or your partner in crime one of these! Such a gem!&nbsp;","Description":"No description available","Category":{"CategoryName":"Home & Travel"}},{"Price":"32.90","Name":"Trowel V&amp;A Blue","Description":"Very shiny trowel that you just wouldn't let get dirty. But that's her job. The beautiful look is a textile adapted design from William Kilburn 1788-1792. Take care of your castle's gardens by giving yourself or your partner in crime one of these! Such a gem!&nbsp;Approx. size: 26 x 7,5 cm.","Category":{"CategoryName":"Home & Travel"}},{"Price":"39.90","Name":"Garden Pruners V&amp;A Coral","Description":"A fine option for the discerning gardener with detail from the coral design by William Kilburn. &nbsp;Featuring a safety catch and a non-stick coated blade.&nbsp;Adapted from a textile design, William Kilburn, 1788-1792.Length: Approx. 22cm.&nbsp;Easy locking&nbsp;safety catch","Category":{"CategoryName":"Home & Travel"}},{"Price":"64.90","Name":"Designer Metalware by Nina Jarema.","Description":"Metalware\r\n is very much back in fashion and has been given a bit of a makeover as \r\npart of this beautiful, quirky range called Folklore featuring foxes, \r\nowls and other woodland creatures.These plates are perfect companion to the Day (white) and Night (dark blue) enamel mugs!","Category":{"CategoryName":"Home & Travel"}},{"Price":"24.90","Name":"Enamel Bowl The Adventures Begins&nbsp;","Description":"Metal enamel bowl, great for warm soups or meals in the mountain or at home. Collect a full set of mugs, plates and bowls for full cosiness, wherever you are!Material: MetalDiameter: 15,5cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"55.90","Name":"Garden Multi Tool","Description":"Product No. 95 from Gentlemen's Hardware.His quality product, suitable for any gardener &nbsp;with five handy tools to tackle those gardening tasks. Includes: Garden Shears, Woodsaw, Garden Blade, Pendand Hole and Bark Shovel.Approx. size (when folded) - 12,5cm x 4cm.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"35.90","Name":"This flask is the one you take out with friends and it will be full of memories the day after. Bright, clean and colourful, this hip flask has a fun and playful design. It is made from stainless steel and wrapped in brightly patterned material. It also has a captive top, so you donвЂ™t need to worry about losing the lid. This is a 200 ml. flask, which means it can fit 0.35 pints, or just over 1 small glass of wine. We call that enough of your favourite drink to share with friends. This flask will arrive in a packaging as eye catching as the flask. It would make an extra special gift for your favourite friend, thatвЂ™s if you are feeling generous enough to give it away!","Description":"&nbsp;Features:Made from Stainless SteelLeak proof captive topComes in a presentation box","Category":{"CategoryName":"Home & Travel"}},{"Price":"34.90","Name":"Travel Mug FOLKLORE","Description":"With its artistic and minimalist design, combined with high quality materials, turned out to be one of our clients (and ours too) favourite travel mug in no time! Not microwave safeMaterial: Stainless steelCapacity: 450 ml","Category":{"CategoryName":"Home & Travel"}},{"Price":"34.90","Name":"Metal Travel Mug","Description":"Product No. 98 from The Adventure Begins series. Travel Mug Gentlemen's Hardware is the great company for your trips and adventures. Stylish and useful gift accessory for every gentlemen out there! Stainless steelCap with a drinking hole450 ml.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"24.90","Name":"Inflatable Scream | Unemployed Philosophers Guild","Description":"Do-it-yourself inflatable scream rises to 18\" when you fill it with a sigh, a moan, or a scream of your own. He also wobbles on his water-filled base.","Category":{"CategoryName":"Home & Travel"}},{"Price":"35.90","Name":"14,5 С… 23 С… 6,5 СЃРј.","Description":"No description available","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"17 С… 11,5 С… 5,5 cm","Description":"No description available","Category":{"CategoryName":"Home & Travel"}},{"Price":"29.90","Name":"Keyring Multitool","Description":"Product No.99 from Gentlemen's Hardware.With five tools, including: LED Light, Bottle Opener, Straight Edge Knife and 2 x Screwdrivers.6 cm. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"39.90","Name":"Multifunctional Hammer 6 in 1","Description":"Product No. 89 from Gentlemen's Hardware. The ultimate tool for both big and small tasks at hand.2 x Flat head and 2 x Cross head Screwdrivers nested in the handle of the Claw Hammer.Ideal for hammering those nails or tightening up those eyeglasses- job done! Material: metalLength: 19 cm. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"Home & Travel"}},{"Price":"35.90","Name":"Hip Flask | &nbsp;I don t get drunk I get awesome","Description":"Keep you favourite tipple close at hand in this brilliant Happy Jackson Awesome! Hip Flask. This fantastic flask is ideal to take to an outdoor event and would also make a fabulous gift idea. Stainless steel with a captive top. 'I don't get drunk, I get awesome!' speech bubble design.Capacity 180 ml.Gift boxed.Measurements: 11 cm x 9.5 cm","Category":{"CategoryName":"Home & Travel"}},{"Price":"7.90","Name":"60ml cucumber and mint cleansing hand gel in 3 designs.","Description":"No description available","Category":{"CategoryName":"Home & Travel"}},{"Price":"34.90","Name":"Multifunctional Cutlery Tool","Description":"Product No.58 from Gentlemen's Hardware.Tried and True! Highly recommended from us!Detachable fork and spoon fitted together into one utilitarian Cutlery Tool. Includes Bottle Opener, Cork Screw, Foil Cutter and Penknife.Size when folded: 11,5 cm. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"64.90","Name":"Wrench Multitool&nbsp;","Description":"Product No.112 from Gentlemen's Hardware. High quality multi-tool with five tools, including: Adjustable Wrench, Saw, Knife, LED Torch and Screwdriver Set. Every gentleman needs one of these!Length when folded: 15,5 cm.Gift boxGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"Home & Travel"}},{"Price":"49.90","Name":"Metal Teapot Folklore Night","Description":"This\r\n stylish Folklore Coffee Pot/Teapot from the Night and Day range would \r\nadd charm to your kitchen. Illustrated and designed in Britain by Nina \r\nJerama, this white coffee pot features an owl and foxes in an enchanting\r\n woodland scene. Made of Metal, the coffee pot is perfect for the home \r\nand garden, camping, festivals or picnics in the park. A fantastic gift \r\nfor any coffee lover. Gift box.Capacity 950ml\r\nHeight 18cm including lid); Width 20cm from handle to spout)\r\nBeautiful Gift box","Category":{"CategoryName":"Home & Travel"}}]