[{"Price":"45.90","Name":"Shaving Soap And Enamel Bowl","Description":"Product No. 63 from Gentlemen's Hardware.This product is highly recommended and also used by us! Take the Rough with the Smooth. Let's bring back that retro thing! Sandalwood Soap- 125 g.Metal Enamel BowlIngredients: Sodium Palmate, Sodium Palm Kernelate, Aqua (Water), Sodium Cocoyl Isethionate, Glycerine, Stearic Acid, PEG-7 Glyceryl Cocoate, Betaine, Olea Europea (Olive), Fruit Oil, Kaolin, Sodium PCA, PEG-150 Lanolin, Simmondsia Chinesis (Jojoba), Seed Oil, Parfum (Fragnance), Sodium Chloride, Sodium Isethianate, Disodium EDTA, Pentaerythrityl Tetra-di-butyl Hydroxyhydrocinnamate, Tretrasodium EDTA, Tetrasodium EDTA, Tertrasodium Etidronate, Coumarin, Hexyl Cinnamal, Cl 77891 (Titanium Dioxide)","Category":{"CategoryName":"MEN ONLY"}},{"Price":"24.90","Name":"Deep Enamel Plate&nbsp;","Description":"Blue enamel plate \"The Adventure BEGINS\".Perfect for your home or the nature /your second home/. Useful for not only soup but for pasta as well. And come on, who doesn't like pasta in the forest?Hand wash only.Not microwavable.Diameter: 21 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"37.90","Name":"Enamel Divided Plate&nbsp;","Description":"A plate divided to 3. If you are food separation fan or \"The Shawshank Redemption\" movie fan, then you'll love the plate. Well, the design is way prettier that just an ugly jail plate... \"The Adventure Begins\" reminds us of the Mountain and its beauties, doesn't matter if we're near or far from it. Easy to carry and travel with. Diameter: 27 cm.Material: MetalHand wash only!Not microwave safe!GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"43.90","Name":"Torch THROW SOME LIGHT Product No.22 from Gentlemen's Hardware.","Description":"Navigate the dark in style and never get lost again with this robust and smart gold coloured torch.Boxed size: 6вЂќ x 2.25вЂќ x 2.25вЂќ.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"44.90","Name":"Shoe Polish Kit","Description":"Product No. 46 from Gentlemen's Hardware.You can always judge a man by his shoes! First impression last, so does a good shine.Black PolishNeutral Polish2 Brushes (hard and soft)Yellow Cloth","Category":{"CategoryName":"MEN ONLY"}},{"Price":"54.90","Name":"Manicure Set","Description":"Product No.74 from Gentlemen's Hardware.One true gent should be always fine and dandy- from nail to toe! You might think that nails are details, but this detail is what catches the eye first. Ladies, give a set to your loved gent to give him a sign... or so that you can secretly use it in case of emergency. The set comes in a wallet from canvas and leather and includes: 2 sizes nail clipper, scissors, nail file, tweezers and a&nbsp;cuticle pusher.6 instrumentsStainless SteelGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"44.90","Name":"Shaving Brush with Stand","Description":"Product No.34 from Gentlemen's Hardware- personally used and highly recommended by us! Let's get back to the real stuff, that have never failed us. The shaving brush! Same as your grandpa's, but higher quality, softer brush and better experience. With wooden handle, high quality plastic stand and soft brush.Length of the brush: 11,5cm, length of the stand: 7,5cm.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Not specified","Description":"GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"&nbsp;Beard Balm","Description":"For the true gent who loves to look after his beard, there is no better way than with&nbsp;the&nbsp;finest Beard Balm by Gentlemen's Hardware. Cedarwood &amp; Lime scented and it comes in an elegant metal tin. Helps to control your beard while offering additional shine and conditioning.&nbsp;&nbsp; &nbsp; Made in the UK&nbsp;30 ml&nbsp;Size: 5 cm (diameter) x 2 cm&nbsp;Ingredients: Coconut oil, Shea butter, Argania Spinosa Kernel Oil, Beeswax, Sweet Almond oil, Lime Oil, Cedarwood Oil, Limonene, Linalool,Citral, Geranoil. Directions: Rub a small amount of the balm between your palms. Apply sparingly to lightly style your beard while further&nbsp;conditioning it. The more you use the more control you'll have. Comb after&nbsp;application.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"31.90","Name":"Post Shave Lotion","Description":"No international shipping!Apply this sandalwood-scented lotion after you shave to keep your skin supple and ready for the great outdoors. Box Size: 145 x 40 x 65mmCapacity: 100mlIngredients: Aqua (Water), Petrolatum, Cetearyl Alcohol, Glycerin, Isononsyl Isononanoate, Dimethicone, Glyceryl Stearate, PEG- 100 Stearate, Phenoxyethanol, Butyrospermum, Parkii Butter (Butyrospermum Parkii (Shea) Butter), Polysorbate 60, Parfum (Fragrance), Benzyl Alcohol, Caprylyl Glycol, Acrylates /C10- 30 Alkyl Acrylate Crosspolymer, Xanthan Gum, Ethylhexyglycerin, Disodium EDTA, Sodium Hydroxide, Coumarin, Hexyl Cinnamal, Alpha- Isomethyl Ionone, Eugenol, Cinnamyl Alcohol, Linalool, Butyphenyl Methypropional, Citronellol, Cinnamal, Geraniol, Amyl CinnamalGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"34.90","Name":"Hair And Body Wash&nbsp;","Description":"&nbsp;No international shipping!Product No. 66 from Gentlemen's Hardware. This authentic product has been crafted for the rigours of today's modern life and it is higly recommended and personally used by us! A truly excellent sandalwood scented haird and body wash for true gents who like things fine and dandy.Directions: Dispense a generous amount and apply to wet hair and body. Work the Hair and Body wash into a good lather and then rinse off with waterIngredients: Water, Sodium Laureth Sulfate, Sodium Chloride, Cocamidopropyl Betaine, Decyl Glucoside, Glycerine, Phenoxyethanol, Fragrance, Sodium Benzoate, Citric Acid, Hydroxypropyl Guar Hydroxypropyltrimonium Chloride, Potassium Sorbate, Disodium EDTA, Polyquaternium-7, Coumarin, Hexyl Cinnamal, Alpha-isomethyl lonone, Cl19140 (FD&amp;C Yellow No.5), Cl 14700 (FD&amp;C Red No.4), Cl 42090 (FD&amp;C Blue No.1) GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"25.90","Name":"Shaving Cream","Description":"&nbsp;No international shipping!ThereвЂ™s no finer way for a chap to get ready for his close-up than with Gentlemen's HardwareвЂ™s best sandalwood-scented shaving cream. Box Size: 152 x 52 x 78mmCapacity: 150mlIngredients: Aqua (Water), Stearic Acid, Butylene Glycol, Parfum (Fragrance), Phenoxyethanol, Glyceryl Stearate, PEG- 100 Stearate, Cetyl Alcohol, Isopropyl Palmitate, Paraffinum Liquidum (Mineral Oil), Benzyl Alcohol, Caprylyl Glycol, Xantham Gum, Sodium Hydroxide, Ethylhexylglycerin, Disodium EDTA, Coumarin, Hexyl Cinnamal, Alpha- isomethyl, Ionone, EugenolGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"27.90","Name":"Hand Salve&nbsp;","Description":"&nbsp;No international shipping!Product No. 77 from Gentlemen's Hardware.This intensive and handsomely-packaged&nbsp;Gentlemen's Hardware is an excellent fragrance-free hand treatment that's been created to suit the rigours of modern life. Gently massage into the skin as needed to leave dry, hard-working hands feeling soft and smooth. Functional and authentic, it's a perfect gift for gents who like things fine and dandy!85g / 3 US oz.&nbsp;Fragrance freeIngredients: Petrolatum, Microcrystalline Wax, Polyethylene, Hydroxystearic Acid,&nbsp;Aluminum Starch Octenylsuccinate, Pentaerythrityl Tetra-di-butyl Hydroxyhydrocinnamete, Polybutene, Lavender Oil, Ethylhexyl Palmate, Cl19140 (Yellow 5 Lake), Cl77492 (Iron Oxides)GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"96.90","Name":"Beard Kit&nbsp;","Description":"No international shipping!Gentlemen's Hardware's products are personally used and highly recommended by us! Or at least the manly part of our team... The kit arrives in a metal box and includes: beard oil and beard balm (both nicely scented) and a beard comb (non-scented). You can also buy Gentlemen's Hardware beard oil on our website with spray and different scent.&nbsp;Beard oil: 30 ml. / dropper bottleBeard balm: 30 ml.Beard comb: 12 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil MOCHA","Description":"No international shipping!Made in USA.Beard with Mocha scent? Yes, please! Contains all natural ingredients that condition, moisturize, and \r\nstrengthen those precious beard hairs promoting healthy growth!!This product is also designed to condition the skin under your beard \r\npreventing dandruff and flaking to keep your beard life \r\ncomfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleCaramel Mocha Scent","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil HEAD HUNTER","Description":"No international shipping!Made in USA.HEAD HUNTER Beard Oil has a Tropical summer aroma that takes you and \r\nyour Beard on a Island Vacation... Just beware of the HEAD HUNTERS!! Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleTropical Summer Scent","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil VIKING","Description":"No international shipping!Made in USA.Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleвЂЁNo added scent, only natural aroma","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil OUTDOORSMAN","Description":"No international shipping!Made in USA.Outdoorsman Blend Beard Oil has a Great citronella scent that repels unwanted insects while still attracting the Ladies!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera 1 fl. oz. dropper bottleвЂЁCitronella Scent","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil BOURBON","Description":"No international shipping!Made in USA.This Top Notch Manly scent will \r\nset you aside from the rest of the Beards, The Women will want you and \r\nthe Men will want to BE YOU!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera1 fl. oz. dropper bottleвЂЁBourbon Scent","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil","Description":"No international shipping!Made in the UK.For the rigours of today's modern life. A truly excellent beard oil with a natural forest scent of cedarwood, pineleaf and eucalyptus. For true gents who like things fine and dandy.Directions: Place the desired amount of oil into palm. Rub hands together and evenly apply to facial hair and skin underneath. Discontinue use if irritation occurs. Avoid contact with eyes.Ingredients: Simmondsia Chinesis (Jojoba) Seed Oil, Vitis Vinifera (Grape) Seed Oil, Ricnus Communis (Castor) Seed Oil, Prunus Amygdalus Dulcis (Sweet Almond) Oil, Cendrus Atlantica (Cedarwood) Bark Oil, Argania Spinosa (Argan) Kernel Oil, Pinus Sylvestris (Pine) Leaf Oil, Eucalyptus Globulus Leaf Oil, Limonine. Made with 100% natural ingredients!50 ml. / 1.7 US fl.oz.Glass bottle with pumpGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Beard Oil ORIGINAL","Description":"No international shipping!&nbsp;&nbsp; Made in USA.This Top Notch Manly scent will set you aside from the rest of the Beards, The Women will want you and the Men will want to BE YOU!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!30 mlBottle with a dropperIngredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera.&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Beard Wax CIGAR BLEND &nbsp;","Description":"No international shipping!Grave Before Shave Fisticuffs Cigar Blend Strong Hold Mustache Wax is hand poured Mustache Wax in a 1 ounce tin. Made with all natural ingredients and has a rich Cigar scent with Vanilla after notes. Maintains a \"strong hold\".Metal tinScent: Tabacco, Vanilla29 mlIngredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils","Category":{"CategoryName":"MEN ONLY"}},{"Price":"54.90","Name":"Beard Balm HEAD HUNTER","Description":"No international shipping!Made in USA.вЂЁРўhis amazing balm helps to tame your beard reducing those pesky flyaway \r\nand unruly hairs, while deeply conditioning and protecting your manly \r\nmane!\r\nContains all natural \r\ningredients that condition, moisturize, and strengthen those precious \r\nbeard hairs promoting healthy growth!!вЂЁThis product is also designed to \r\ncondition the skin under your beard preventing dandruff and flaking to \r\nkeep your beard life comfortable...the way it should be!Ingredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils 2 oz. tinScent of Tropical Summer","Category":{"CategoryName":"MEN ONLY"}},{"Price":"35.90","Name":"&nbsp;Beard Foam REUZEL&nbsp;","Description":"&nbsp;Made in the USA.&nbsp;REUZEL Beard Foam, our revolutionary patent-pending leave-in beard conditioner. Reuzel Beard Foam deodorizes your beard and absorbs quickly helping to tame and control. YouвЂ™ll look&nbsp;well-maintained with a beard thatвЂ™s incredibly soft and groomed. Formulated to sooth and condition your beard and the skin underneath to reduce itch, beardruff, promote thicker hair, tame&nbsp;rogue hairs, repair split ends, and to soften coarse hairs all while knocking out that funky smell. Instantly makes your beard appear thicker, and keeps your beard moisturized throughout the day.&nbsp;Easy to work with leaving your&nbsp;beard and mustache full, soft, and healthy.70 ml.Bottle with pumpFresh clean scent&nbsp;Ingredients: Aqua,&nbsp;Disodium Cocoyl Glutamate,&nbsp;Sodium PCA,&nbsp;Cocoamidopropyl Betaine,&nbsp;Cetrimonium Chloride, Leaf Extract, Rosemary, Benzyl Alcohol,&nbsp;Linalool,Limonene","Category":{"CategoryName":"MEN ONLY"}},{"Price":"54.90","Name":"&nbsp;Beard Balm CIGAR BLEND","Description":"&nbsp; &nbsp; &nbsp;Made in USA.вЂЁРўhis amazing balm helps to tame your beard reducing those pesky flyaway and unruly hairs, while deeply conditioning and protecting your manly mane!&nbsp;Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!60 ml&nbsp;2 oz. tinScent: Cigar Blend &nbsp;Ingredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"&nbsp;Beard Oil &nbsp;BAY RUM&nbsp;","Description":"&nbsp; Made in USA.This Top Notch Manly scent will set you aside from the rest of the Beards, The Women will want you and the Men will want to BE YOU!Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!30 ml&nbsp;bottle with a dropperBay Rum scent&nbsp;Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera.&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"&nbsp;Beard Oil&nbsp;&nbsp;CIGAR BLEND VANILLA&nbsp;","Description":"&nbsp; &nbsp; Made in USA.Real men have beards, some even have mustaches. But in order to be a real gent you need to look after your facial hair. This oil can help you condition your skin underneath that beard of yours and get rid of the annoying itchy feeling. The rich cigar scent, with vanilla afternotes will make your beard grow healthy and shiny.&nbsp;1 OZ. Dropper BottleCigar Blend, Vanilla scent&nbsp;Ingredients: Tea tree oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Vanilla.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"Vintage Bike Bell SAVED BY THE BELL","Description":"Product No. 108 from Gentlemen's Hardware&nbsp;Be safe with the Gentlemen's Hardware Trusty Bike Bell. Always there in your time of need.Approx. size 5.5 cm&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Bike Multi Tool&nbsp;","Description":"Product No. 103 from Gentelmen's Hardware&nbsp;The perfect cyclist's companion for repairs on the go. Including 10 folding tools:Chain - breaker 2 x screwdriversT25 tore head key 2 - 8 mm hex keys 8 - 10 m hex wrenches&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"24.90","Name":"Enamel Bowl The Adventures Begins&nbsp;","Description":"Metal enamel bowl, great for warm soups or meals in the mountain or at home. Collect a full set of mugs, plates and bowls for full cosiness, wherever you are!Material: MetalDiameter: 15,5cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"55.90","Name":"Garden Multi Tool","Description":"Product No. 95 from Gentlemen's Hardware.His quality product, suitable for any gardener &nbsp;with five handy tools to tackle those gardening tasks. Includes: Garden Shears, Woodsaw, Garden Blade, Pendand Hole and Bark Shovel.Approx. size (when folded) - 12,5cm x 4cm.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"34.90","Name":"Metal Travel Mug","Description":"Product No. 98 from The Adventure Begins series. Travel Mug Gentlemen's Hardware is the great company for your trips and adventures. Stylish and useful gift accessory for every gentlemen out there! Stainless steelCap with a drinking hole450 ml.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"35.90","Name":"14,5 С… 23 С… 6,5 СЃРј.","Description":"No description available","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"17 С… 11,5 С… 5,5 cm","Description":"No description available","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"Keyring Multitool","Description":"Product No.99 from Gentlemen's Hardware.With five tools, including: LED Light, Bottle Opener, Straight Edge Knife and 2 x Screwdrivers.6 cm. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Multifunctional Hammer 6 in 1","Description":"Product No. 89 from Gentlemen's Hardware. The ultimate tool for both big and small tasks at hand.2 x Flat head and 2 x Cross head Screwdrivers nested in the handle of the Claw Hammer.Ideal for hammering those nails or tightening up those eyeglasses- job done! Material: metalLength: 19 cm. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"34.90","Name":"Multifunctional Cutlery Tool","Description":"Product No.58 from Gentlemen's Hardware.Tried and True! Highly recommended from us!Detachable fork and spoon fitted together into one utilitarian Cutlery Tool. Includes Bottle Opener, Cork Screw, Foil Cutter and Penknife.Size when folded: 11,5 cm. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"64.90","Name":"Wrench Multitool&nbsp;","Description":"Product No.112 from Gentlemen's Hardware. High quality multi-tool with five tools, including: Adjustable Wrench, Saw, Knife, LED Torch and Screwdriver Set. Every gentleman needs one of these!Length when folded: 15,5 cm.Gift boxGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Pocket Penknife FISH","Description":"Product No.88 from Gentlemen's Hardware.Prize Catch!Gold effect penknife for getting out of fishy situations. Length: 8 cm.Material: MetalGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"Enamel Mug The Adventures Begins White","Description":"Metal Enamel Mug in dark blue color \"The Adventure Begins\" from Gentlemen's Hardware collection.Perfect for your home or the nature /your second home/.Hand wash onlyNot microwave safe400 ml.Color: White-Beige with red handle GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"85.90","Name":"Shaving Kit","Description":"Products from Gentlemen's Hardware- personally used and highly recommended by us! Let's get back to the real stuff, that have never failed us. A shaving kit, which includes a brush + stand, shaving cream (150ml) and post shave lotion (100ml), that you can also purchase separately on our website.&nbsp;Sandalwood products","Category":{"CategoryName":"MEN ONLY"}},{"Price":"329.90","Name":"Globe Night Lights","Description":"Product No.07 from Gentlemen's Hardware. ItвЂ™s a big world out there as this&nbsp;30 cm&nbsp;globe light proves. Plug it in, give it a whirl and marvel at the worldвЂ™s night time city lights. Comes with a sturdy stainless steel base and is smartly packaged in a presentation box bearing the words вЂњA Brave New WorldвЂќ. *English plug only,adapter not included. GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"43.90","Name":"Penknife Many Hands","Description":"Product No.05 from Gentlemen's HardwarePerfect gift for everyone who wants to have everything in their pocket. With 10 tools, including: saw, scissors, bottle opener and screwdriver.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"64.90","Name":"Pliers Multi-Tool","Description":"Product No.105 from Gentlemen's HardwareHigh quality multi-tool that would be the great gift for your favorite man (father or husband) or for you if you are one of these. With nine tools including: pliers, wire cutters, knife, saw and screwdriver + 12 separate attachable tools.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"79.90","Name":"Wallet with coin pocket Cross Black","Description":"Men wallet for documents and cards&nbsp;Cross Nueva FV. Genuine leather, black color.&nbsp;Size: 9 x 10,8cm.&nbsp;3 card holdersCoin pocket2 paper money pocketsGift box6 months guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"79.90","Name":"Wallet Cross RTC Black","Description":"Men wallet for documents and cards&nbsp;Cross Nueva FV. Genuine leather, black color.&nbsp;Size: 9 x 10,8cm.&nbsp;8 card holders2 paper money pocketsGift box6 months guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"69.90","Name":"Wallet Cross Nueva Oak Brown","Description":"Men wallet for documents and cards&nbsp;Cross Nueva FV. Genuine leather, brown&nbsp;color.&nbsp;Size: 9 x 10,8cm.&nbsp;Gift box6 months guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"69.90","Name":"Wallet Cross EspaГ±ol Black","Description":"Men slim wallet Cross Grabado EspaГ±ol from genuine leather in black color with 8 card holders, 2 paper money departments and 2 side departments for ID. The perfect gift for any true gentlemen.&nbsp;Size: 9 x 10,8cm.&nbsp;Gift box6 months guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Leather Wallet","Description":"Product No. 92 from Gentlemen's Hardware.Fortune favours the brave! Will fit perfectly to every gentlemen. Personally recommended and used by us!&nbsp; Made from leather and canvas, bi-fold wallet.Material: leather, canvasComes in a gift boxDimensions: 11 x 8 cm (folded), 17 cm (unfolded)","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"Enamel Mug The Adventures Begins Blue","Description":"Metal Enamel Mug in dark blue color \"The Adventure Begins\" from Gentlemen's Hardware collection.Perfect for your home or the nature /your second home/.Hand wash onlyNot microwave safeMaterial: Metal /Does not contain Alumium!/400 ml.Color: Dark BlueGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"37.90","Name":"Multifunctional Carabiner","Description":"Product No. 110&nbsp;from Gentlemen's Hardware.The perfect trusty accessory for your backpack. With 4 tools, including: Carabiner knife, Saw, Compass&nbsp;and LED Flash Light.Battery included.10 x 5 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"124.90","Name":"Metal Toolbox&nbsp;","Description":"If you've ran out of ideas for gifts for men and you think they wouldn't appreciate cosmetics then we give you an idea that real men would surely appreciate- toolbox! Not just a toolbox, but Gentlemen's Hardware ToolBox- high quality metal and irresistible style. Big enough to contain every type of instrument, plus a portable section for smaller things and a secure closure.&nbsp;Dimensions: 43 cm С… 18cm.MetalGrey&nbsp;colorGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Pocket Manicure Tool","Description":"Product No. 113 from Gentlemen's Hardware.&nbsp;This multifunctional multi tool from stainless steel will surprise you with it's compact size and 4 functions. Including: Nail Clipper, Knife, Nail Cleaner and Scissors.&nbsp;Size (folded): 5,5 cm. Stainless steel&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"21.90","Name":"Waiter's Best Friend BOTTLE OPENER","Description":"Product No. 04 from Gentlemen's Hardware.Ladies and gents, we present to you waiter's best friend from stainless steel! One good turn deserves another! Includes opener for wine corks, another one for metal caps and a bonus mini-knife in case you have a bigger problem or any of the clients is being indecent.Approx. size when folded - 11cm.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"35.90","Name":"Keyring Pliers","Description":"Product No.109 from Gentlemen's Hardware.Pocket multi tool pliers with five tools, including: Pliers, Knife, File and 2 x Screwdrivers.Material: MetalLength: 4 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"54.90","Name":"Multi Purpose Hammer Tool","Description":"Product No.51 from Gentlemen's Hardware.Why have one tool, when you can have seven? This cunning and robust gadget might look like one mighty hammer, but it actually conceals several essential tools, including pliers, knife and screwdriver. Guaranteed to get you out of a tight spot on your adventures, it hits the nail on the head.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"34.90","Name":"Bike Repair Kit","Description":"Product No.51 from Gentlemen's Hardware \r\n\t\t\t\t\t\t\t2 Metal Tire Levers6in1 Bicycle ToolRubber Adhesive Solution \r\n\t\t\t\t\t\t\tBone Wrench and Metal Rasp9 Rubber Patches in 3 sizes and Instructions","Category":{"CategoryName":"MEN ONLY"}},{"Price":"14.90","Name":"Lip Balm","Description":"Who says lip balm is for ladies only? Well, this one is especially for true gents! Cuz the wind is cruel to everyone. Ingredients: Olive fruit oil, Hydrogenated Coco-Glycerides, Microcrystalline Wax, Ethylhexyl, Palmitate, Shea Butter, Tridecyl Trimellitate, Synthetic Wax, Hydrogenated Sunflower Seed Oil, Polyethylene, Sunflower Oil, Paraffin, Candelilla Wax, Tocopheryl Acetate, Fragnance, Polybutene, Tocopherol, Yellow 5 Lake.0.4 US oz / 10 g.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"45.90","Name":"Water Bottle","Description":"The ideal companion for long hikes. Stainless steel double-walled water bottle with secure lid - Begin your Adventure!  Capacity: 500mlVacuum closer Stainless steelGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"43.90","Name":"Fire Starter","Description":"Product No.58 from Gentlemen's Hardware.Need to get things burning? Gentlemen's Hardware makes things easier \r\nwith their glorious firestarter gadget вЂ“ a safe and simple tool that \r\ncreates a spark to start your fire when camping or out in the wild.Add the missing spark with this handy lighter- designed to take on outdoor adventures or as a handy gadget to have when matches aren't at hand. Handy fire starting tool presented in a retro style box Ideal for camping and festivals Safely creates a sparkDimensions: H12 x W2 x D2 cm.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"75.90","Name":"Glass Cocktail Shaker","Description":"This rather special glass cocktail shaker has the full ingredients for an Espresso Martini printed on the back and even features details on how to mix it. &nbsp;Keep it behind the bar or in the drinks cabinet at home ready to spring out when the lights get low, the music starts and the liquor arrives... have a blast! &nbsp;You can also find great items like this in our glassware collection.&nbsp;Official cocktail shaker from Gentleman's HardwareIncludes a small metal measuring cupA stylish &amp; professional lookFeatures the ingredients for an Espresso Martini on the backServes 2GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"Peachwood Comb&nbsp;","Description":"For hair or beard depends on you... or your gene. Gentlemen's Hardware's comb is made from high quality peach tree and guarantees durability. Especially if combined with the other GH products for hair and beard, your whole durable look is guaranteed as well.&nbsp;GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"196.90","Name":"Barbecue Set","Description":"Product No.75 from The Adventure Begins series by Gentlemen's Hardware.&nbsp;Portable barbecue that has such compact size that you just grab the \"\"briefcase\" and go for a walk in the nature. Made from metal but&nbsp;light&nbsp;and easy to carry. Inside there is a place for coal and on top- a grate and the&nbsp;exciting grill-process may begin! &nbsp; A research by Telegraph UK shows that Gentlemen's Hardware is number 3 in a TOP 5 classification for best portable barbecues for 2016.Approx. size: 30 cm x 18 cm.Colour: Black &amp; SilverGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together! &nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"16.90","Name":"Hand Sanitizer I LOVE MY PENIS","Description":"&nbsp;No international shipping!Made in USA.Caution: Do not apply directly to penis.  Leaves hands feeling soft and relieved.Active ingredients: Ethyl Alcohol 62% Inactive ingredients: Water, Vegetable Glycerin, Isopropyl Myristate, Aloe Vera, Carbomer.2 oz/ 59 ml.","Category":{"CategoryName":"MEN ONLY"}},{"Price":"29.90","Name":"Whiskey Glasses","Description":"Product No.24 from Gentlemen's Hardware.You decide whether the glass is half full or half empty! These elegant tumblers are a particularly fine choice for malt whiskey. The classic tulip shape captures aromas perfectly, whilst the naturally balanced weight enhances the drinking experience for any time liquor.To Good Health! Material: GlassH9 x W7 x D7.2cm","Category":{"CategoryName":"MEN ONLY"}},{"Price":"54.90","Name":"Made in USA.вЂЁ","Description":"Рўhis amazing balm helps to tame your beard reducing those pesky flyaway and unruly hairs, while deeply conditioning and protecting your manly mane!&nbsp;Contains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"26.90","Name":"Face Wash&nbsp;","Description":"Highly recommended and personally used by us!A truly excellent face was for true gents who like things fine and dandy.Directions: Massage over wet face, avoiding the eye area. Rinse off with clean water.Ingredients: Water, Glycerin, Cocamidopropyl Betaine, Sodium Lauroyl Sarcosinate, Lauryl Glucoside, Phenoxyethanol, Sodium Chloride, Lauryl Lactate, PEG-150 Distearate, Caprylyl Glycol, Fragnance, Coco-Glucoside, Glyceryl Oleate, Disodium EDTA, Ethylhexylglycerin, Citric Acid, Panthenol, Benzophenone-4, Cocamidopropyl, Dimethylamine, Hexyl Cinnamal, Limonene, Tocopherol, Hydrogenated Palm Glycerides Citrate, Magnesium Nitrate, Magnesium Chloride, Methylchloroisothiazolinone, Methylisothiazolinone. 250 ml/ 8,4 US fl.oz.GentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!&nbsp;&nbsp;","Category":{"CategoryName":"MEN ONLY"}},{"Price":"54.90","Name":"Beard Balm BOURBONMade in USA.вЂЁ","Description":"Рўhis amazing balm helps to tame your beard reducing those pesky flyaway \r\nand unruly hairs, while deeply conditioning and protecting your manly \r\nmane!\r\nContains all natural ingredients that condition, moisturize, and strengthen those precious beard hairs promoting healthy growth!!вЂЁThis product is also designed to condition the skin under your beard preventing dandruff and flaking to keep your beard life comfortable...the way it should be!Ingredients: Coconut oil, Shea butter, Beeswax, Tea Tree Oil, Pure Apricot Oil, Jojoba Oil, Sweet Almond Oil, Vitamin E, Aloe Vera, Some Essential Oils 2 oz. tinBourbon Scented","Category":{"CategoryName":"MEN ONLY"}},{"Price":"39.90","Name":"Stove Top ESPRESSO COFFEE MAKER","Description":"Product No. 57 from Gentlemen's Hardware.A storm is brewing!Perfect for those who love a brew the traditional way, the Gentlemen's Hardware Espresso Stove Top Coffee Maker is ideal for coffee time, breakfast, dinner, parties and friends visiting. This percolator is stylish enough to be brought from the stove top to the table- black, adorned with the words ' A Storm Is Brewing'.The coffee percolator has been around since 1800s. Originally invented by American-born British&nbsp;physicist and soldier count Rumford.&nbsp;Makes up to 6 cupsSuitable for gas &amp; electric hobsAluminiumHeight: 19cmComes with instructionsGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}},{"Price":"26.90","Name":"Bottle Opener OPEN BOTTLE HERE","Description":"This Retro Metal OPEN BOTTLE HERE Bottle Opener is a must have for all homes as well as bars, clubs, kitchens and man caves. An Ideal Gift to give at any time of year this American style wall mounted bottle opener is a stylish addition to all homes. In two simple steps you can be drinking your fave drink!!As used in bars and motel rooms across the USA. Dimensions 80 x 70mm","Category":{"CategoryName":"MEN ONLY"}},{"Price":"24.90","Name":"Credit Card Tool In Tin","Description":"Product No.50 from Gentlemen's Hardware.In a bit of a tight spot? This clever brass style tool combines an array of handy tools in one credit card sized solution. From ruler to bottle opener youвЂ™ll always have what you need for the job. Comes in a neat little mini tin, ready to give as a gift.Includes: can opener, knife blade, screwdriver, ruler, bottle opener, position wrench, butterfly wrench, saw blade, direction ancillary indicationGentlemenвЂ™s Hardware products have been crafted for the rigors of todayвЂ™s modern life with a vintage aesthetic. Truly excellent products manufactured by relentless pioneers with an unfaltering commitment to quality, function and style. HereвЂ™s to many happy years together!","Category":{"CategoryName":"MEN ONLY"}}]