[{"Price":"34.90","Name":"Tumbling Tower","Description":"Back in retro times, life was a simpler place.Apart from the ever-present fear of the atomic bomb, things were pretty peachy - mainly due to the sense of community and sharing that was around. &nbsp;These days we have smart gadgets and doovy-whatsits that do all sorts of great things, but they can be a little anti-social. And thatвЂ™s why retro toys are so much fun вЂ“ they get everyone involved, helping you to bond, learn from each other and that doublesвЂ¦ nay triples the fun! Golly gee! &nbsp;These Tumbling Blocks are the perfect example. The aim of this game is to continue building a tower of wooden blocks by gently and carefully removing blocks from the existing building. But watch out! If they tumble down, the game's over!&nbsp;Now doesnвЂ™t that just sound swell?&nbsp;Designed in the UKNot suitable for children under three years of ageRecommended for players ages 6 years and upSuitable for two or more playersMade from woodInstructions includedPresented in a funky retro-style RidleyвЂ™s gift box which is made from recycled cardboardDimensions of each block: 7.5 x 2 x 1.5cm.&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"23.90","Name":"&nbsp;Pinball Space Intergalactic","Description":"Back in the days of retro radical-ness, the world was a different, much simpler place. People read broadsheet newspapers on the train instead of playing Candy Crush on their smart phones. Most importantly, the games kids played hardly ever ran off electricity.&nbsp;This RidleyвЂ™s Intergalactic Space Pin Ball game is so awesomely retro requiring no batteries, this portable, highly durable and funky looking pinball game will keep big and little kids entertained for ages. Simply pull back the trigger and shoot the 8 metal pinballs into orbit, will you be good enough to land a ball in the lucky 100 point slot? Make a competition out of it and see whoвЂ™s able to land the highest score!Made of high-grade plasticMeasures 18cm x 29cm","Category":{"CategoryName":"Party & Games"}},{"Price":"23.90","Name":"Pinball COSMIC CAT","Description":"It's a CAT-ASTROphe! Can you purrr-fect hte cosmic cat pinball? We have received a distress signal from one of our space stations. Inside are your mission details. Help us! Those crazy cosmic cats are at it again...Material: High Quality PlasticDimensions: 29 x 18 cm.Ages 6+","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Two or more players in each team (or play one to one)","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"5.90","Name":"Festival bracelets Harry Potter Gryffindor","Description":"These Harry Potter wristbands will show your true Gryffindor spirit. Perfect for birthday parties or festivals. Made from cotton.Material: CottonOne size only&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"5.90","Name":"Festival bracelets &nbsp;Harry Potter Slytherin","Description":"These Harry Potter wristbands will show your true Slytherin spirit. Perfect for birthday parties or festivals. Made from cotton.Material: CottonOne size only&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"45.90","Name":"Puzzle &nbsp;HARRY POTTER QUIDDITCH&nbsp;","Description":"Made in the USA.Harry PotterвЂ™s Quidditch adventures wouldnвЂ™t be complete without catching the golden snitch against his Slytherin counterparts. And neither will this puzzle without your help! Help Harry Potter win the match by putting together this 1000 piece jigsaw puzzle celebrating his time at Hogwarts.1000 piecesFinished size:&nbsp;46 cm x 61 cmBox size: 25 cm x 20,05 cm x 6 cm&nbsp;Linen Style Finish to reduce glare","Category":{"CategoryName":"Party & Games"}},{"Price":"45.90","Name":"Puzzle HARRY POTTER HOGWARTS&nbsp;","Description":"Made in the USA.Hogwarts Castle has always been invisible to Muggles, but now with this 500 piece jigsaw puzzle, even non-wizards can see the ins and outs of the greatest wizarding school in the UK. Unlock the secrets of Hogwarts one piece out of a time with this intricately illustrated jigsaw puzzle drawn by original Harry Potter book cover artist Mary GrandPrГ©. Made in the USA from recycled chipboard.500 piecesFinished Puzzle Size: 61 cm x 46 cm&nbsp;Box Size:&nbsp;25 cm x 20,05 cm x 6 cm&nbsp;Linen Style Finish to reduce glare","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Harry Potter Memory game","Description":"Made in the USA.Amazing Harry Potter art abounds in this 36 piece memory/matching concentration game.&nbsp;The game consists of finding matches while all are face down.&nbsp;Each piece features illustrations from Mary GrandPrГ©'s book art from the original Harry Potter books written by J.K. Rowling. Great fun for all ages 3 and up! Made in the USA from recycled materials.&nbsp;An ideal gift for the Harry Potter fanatic in your life!36 piecesMade from recycled materials","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"The covers of The New Yorker have entertained and enlightened the magazineвЂ™s readers for nearly a century. With unmatched visual sophistication and wit, they let no subject escape their scrutiny. A roster of extraordinary artists continues to create indelible images that are infinitely varied in style and tone, whether whimsical, provocative, serene, or lough-out-loud funny. From the iconic Eustace Tilley to spot-on images of contemporary life, The New YorkerвЂ™s covers are always the talk of the town.","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Not specified","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Jigsaw Puzzle MAIN STREET","Description":"Made in the USA.New Yorker Cover by Artist Beatrice Tobias, originally published on November 18th, 1939.&nbsp;The covers of The New Yorker have entertained and enlightened the magazineвЂ™s readers for nearly a century. With unmatched visual sophistication and wit, they let no subject escape their scrutiny. A roster of extraordinary artists continues to create indelible images that are infinitely varied in style and tone, whether whimsical, provocative, serene, or lough-out-loud funny. From the iconic Eustace Tilley to spot-on images of contemporary life, The New YorkerвЂ™s covers are always the talk of the town.1000 pieces&nbsp;Finished size:&nbsp;46 cm x 61 cmBox size: 25 cm x 20,05 cm x 6 cm&nbsp;Linen Style Finish to reduce glare","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Jigsaw Puzzle CATTUCCINO&nbsp;","Description":"Made in the USA.Cattuccino -&nbsp;New Yorker Cover&nbsp;originally published on January 6th, 1992.&nbsp;The covers of The New Yorker have entertained and enlightened the magazineвЂ™s readers for nearly a century. With unmatched visual sophistication and wit, they let no subject escape their scrutiny. A roster of extraordinary artists continues to create indelible images that are infinitely varied in style and tone, whether whimsical, provocative, serene, or lough-out-loud funny. From the iconic Eustace Tilley to spot-on images of contemporary life, The New YorkerвЂ™s covers are always the talk of the town.1000 pieces&nbsp;Linen Style Finish to reduce glareFinished size: 49 cm x 67.6 cm&nbsp;Box size:&nbsp;&nbsp;25 cm x 20,05 cm x 6 cm&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Jigsaw Puzzle EUROPEAN VACATION&nbsp;","Description":"Made in the USA.Take a euro trip with this cool jigsaw puzzle. For those of you who have a wanderlust spirit but can't afford to make their dreams come true. All of this is now possible, just put together the pieces and start your travels.&nbsp;1000 pieces&nbsp;Recommended age: 13 + Years&nbsp;Finished size: 49 cm x 67.6 cm&nbsp;Box size:&nbsp;&nbsp;25 cm x 20,05 cm x 6 cm&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Jigsaw Puzzle &nbsp;SHELVED&nbsp;","Description":"Made in the USA.Shelved - New Yorker Cover by Artist Roz Chast, originally published on October 18th, 2010.&nbsp;The covers of The New Yorker have entertained and enlightened the magazineвЂ™s readers for nearly a century. With unmatched visual sophistication and wit, they let no subject escape their scrutiny. A roster of extraordinary artists continues to create indelible images that are infinitely varied in style and tone, whether whimsical, provocative, serene, or lough-out-loud funny. From the iconic Eustace Tilley to spot-on images of contemporary life, The New YorkerвЂ™s covers are always the talk of the town.750&nbsp;pieces&nbsp;Finished size:&nbsp;46 cm x 61 cmBox size: 25 cm x 20,05 cm x 6 cm&nbsp;Linen Style Finish to reduce glare","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Jigsaw Puzzle NIGHTAWKS NEW YEAR &nbsp;","Description":"Made in the USA.Nighthawks - New Yorker Cover by Artist Owen Smith, originally published on December 27th, 1999.&nbsp;The covers of The New Yorker have entertained and enlightened the magazineвЂ™s readers for nearly a century. With unmatched visual sophistication and wit, they let no subject escape their scrutiny. A roster of extraordinary artists continues to create indelible images that are infinitely varied in style and tone, whether whimsical, provocative, serene, or lough-out-loud funny. From the iconic Eustace Tilley to spot-on images of contemporary life, The New YorkerвЂ™s covers are always the talk of the town.500 piecesFinished Puzzle Size: 46 cm x 61 cm&nbsp;Box Size:&nbsp;&nbsp;25 cm x 20,05 cm x 6 cm&nbsp;Linen Style Finish to reduce glare","Category":{"CategoryName":"Party & Games"}},{"Price":"49.90","Name":"Jigsaw Puzzle BEACHGOING","Description":"A busy day at the beach. Seems as though everyone has the same idea this sweltering July day. This crazy crowd is doing everything under the sun; tanning, chatting, eating, splashing, swimming, ogling, and having a general good ol' time.&nbsp;New Yorker cover from July 8, 1939 by Richard Taylor.&nbsp;1000 piecesFinished size:&nbsp;50.8 cm x&nbsp;68.58 cmBox size: 25 cm x 20,05 cm x 6 cm&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"4.90","Name":"Jigsaw puzzle WONDER WOMAN&nbsp;","Description":"Jigsaw puzzle in a cool Wonder woman tin. Easy and&nbsp;convenient, pocket size.150 pieces&nbsp;Size: 11 cm x 8,5 cm x 2,5 cm","Category":{"CategoryName":"Party & Games"}},{"Price":"75.90","Name":"Board Game EYETOONSLet's get it on...Put your finely 'tooned' musical knowledge to the test in this easy to play and addictive fun family board game. Go head-to-head in a variety of musical based challenges, can you identify the musical artist and song from the cartoon on the card? Can you hum the tune or draw your own вЂtoonвЂ™? It's a race to the finish in this action packed musical medley!","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Trumps DICTATOR&nbsp;","Description":"Is there anything better in a person than a dark humour? We at Gift Republic think not. With this in mind we've recreated the classic kid's game with a more mature twist. Perfect to play on long bus journeys or in darkened basements, our new range of Top Trumps will provide hours of morbid fun.&nbsp;Who led more invasions, Pol Pot or Kim Jong-Il? There's only one way to find out...&nbsp;30 cards","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Trumps GANGSTER","Description":"Is there anything better in a person than a dark humour? We at Gift Republic think not. With this in mind we've recreated the classic kid's game with a more mature twist. Perfect to play on long bus journeys or in darkened basements, our new range of Top Trumps will provide hours of morbid fun.&nbsp;Which gangster killed more people, John Gotti or Pablo Escobar? There's only one way to find out...&nbsp;30 cards","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Trumps &nbsp;DEADLY DISEASE","Description":"Is there anything better in a person than a dark humour? We at Gift Republic think not. With this in mind we've recreated the classic kid's game with a more mature twist. Perfect to play on long bus journeys or in darkened basements, our new range of Top Trumps will provide hours of morbid fun.&nbsp;Which lethal disease killed more people, rabies or cholera? There's only one way to find out...&nbsp;30 cards","Category":{"CategoryName":"Party & Games"}},{"Price":"34.90","Name":"&nbsp;Interactive Scratch Poster KAMASUTRA BUCKET LIST 100","Description":"#100 BUCKET LIST Kamasutra edition вЂ“ is a new interactive scratch poster that motivates to diversify the intimate life lovers with one hundred spicy variations.You will need to:вЂ“ Choose a hot pose togetherвЂ“ Peek under the blanket (erase the protective scratch layer)вЂ“ Get motivated and try the poseвЂ“ mark as completed!В· Unusual gift for couples or honeymoonersВ· Spicy accessory for the bedroomВ· Innovative technology scratchВ· Product made in UkraineВ· Multifunctional gift tube вЂњSecret BoxвЂќВ· Reason to diversify your intimate lifeВ· New emotions in your relationshipВ· Motivation to make the most of your nightВ· Creating memories togetherВ· Brings attention to the importance of a healthy&nbsp;sexual lifeThis checklist is intended for adult and young couples who want to spend time together and have fun!Together, choose an interesting pose, look under the blanket, try the pose and move on to the next one.Arrange a night of amorous adventures or try thr 100day Hot Challenge.Find new erogenous zones and unexpected solutions, learn something new about each other. about each other something new.Make the most out of your night.The poster is packed into a stylish design tube, which protects it from damage and solves the problem of gift wrapping.Secret box In addition, we propose you to use the lower part of the tube, as a Secret Box, to write notes about your secret fantasies or store naughty items, such as condoms or sex toys! вЂў Poster dimensions вЂ” 60 x 40 cm;вЂў Tube dimensions вЂ” 45 x 7 cm;","Category":{"CategoryName":"Party & Games"}},{"Price":"41.90","Name":"Jigsaw Puzzle Horcruxes","Description":"Complete the puzzle to find the Horcruxes! BoxedThe image of the result on paper1 package with 500 puzzle pieces","Category":{"CategoryName":"Party & Games"}},{"Price":"21.90","Name":"Pinball SPACE","Description":"\"We are under attack from an evil alien force! Supplies are dangerously low- can you help us to safely catch our supply capsules in the docking stations before it's too late? Please help us- you're our only hope...\"Material: High Quality Plastic&nbsp;Dimensions: 25,5 x 14 cm.Ages 6+","Category":{"CategoryName":"Party & Games"}},{"Price":"31.90","Name":"Card game CARD SET","Description":"Play to test memory, to win money or to pass time. Play with friends, enemies or strangers. Play by yourself, against many or as a team. Play around the world adapting the game and bending abide by the rules many years old. Snap, Patience, Rummy or Poker; however you play, play well.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Contents: 4x Games Instructions: Whist, Solitaire, Pontoon (also known as \"21\"), Rummy2x Decks of High Quality Playing Cards","Category":{"CategoryName":"Party & Games"}},{"Price":"79.90","Name":"Poker Set","Description":"Texas Hold'emKnow when to hold and when to fold!The strengths and weaknesses in a person's character will all be revealed within a game of poker. Whilst the aim is to gather the highest value of chips by skillfully applying your bets, the true challenge lies in ruthlessly leading your opponents down blind alleys and into hopeless situations. Apply real life and common sense to your game and you'll become easy to predict, play a random game of calculated and daring moves and you may ultimately win everything. Are you ready to play? Let me see your poker face!&nbsp;Contents: Instructions, 200x Poker Chips, 1x Dealer button, 2x Deck of 52 cardsBox size: 24 x 19 cm.","Category":{"CategoryName":"Party & Games"}},{"Price":"34.90","Name":"Dominoes","Description":"Whichever way you play, there's always a challange waiting. 28 pieces form the 'boneyard' and whether your aim is to score high or ditch your pieces, you'll always need to add cunning and logic into the mix. Do not be deceived by the simplicity of the pieces- this is not a child's play. Contents: Instructions, 28x .","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Card game CHARADES","Description":"Simply вЂact outвЂ™ the titles of books, films, songs, tv shows and plays without speaking for your team to guess.How to play: Four or more people split into two teams. A chosen player from each team mimes a title from the card, using actions only- strictly no talking allowed! The player should act out the title as a whole, or as individual words. The remaining players in the team have three minutes to guess the title and win two points. If they cannot guess in time, the other team has a chance to answer and win one point.&nbsp;140 question cards (700 titles)Instructions","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Card game GENERAL KNOWLEDGE","Description":"Challenge your friends and family to a wide range of trivia topics with this updated version of the Games Room General Knowledge quiz, featuring brand new content.How to play: Two or more players in each team (or play one to one). You can now take it in turns to ask the competing team a question. The correct answer is&nbsp;highlighted all the way through, and teams are awarded one point for each correct answer. The first team to 20 (or the team who wins the most amount of points in 15 minutes) is the winner.Please note: all Ridley's games are being updated every year.140 question cardsInstructions&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"39.90","Name":"Card game Quiz Compedium&nbsp;","Description":"Gather your friends and family, young and old alike for a series of games that will challenge all your skill and luck. Simply take turns to roll the die and answer the corresponding game card to begin the fun. This also is a great idea when you love all Ridley's games, but you can't pick just one. Here's what's in the box:&nbsp;General Knowledge - How good is your general knowledge? Including a variety of subjects from Astronomy to Zoology. Who will be the \"mastermind\".&nbsp;Brain Teasers - Who will rise to the test with these&nbsp;mind-boggling collection of brain teasers, riddles and conundrums that will have you all scratching your head.Pop&nbsp;Music Quiz - Whether you're a Pop Princess, Rock God or Hip-Hop Aficionado, there's something for everyone in this fun game.Movie Buff Quiz - Have you got what it takes to be crowned champion \"Movie Buff\"? A fun and fast-paced quiz for film fanatics of all ages. Lights, Camera, Action!Includes: 4 x 70 Game Cards, Decision Die, Instructions.&nbsp;All Ridley's games are being updated every year.&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"39.90","Name":"Card game Party Compendium","Description":"Gather your friends and family, young and old alike for a series of games that will challenge all your skill and luck. Simply take turns to roll the die and answer the corresponding game card to begin the fun. This also is a great idea when you love all Ridley's games, but you can't pick just one. Here's what's in the box:&nbsp;Guess What - In this word-guessing game, you simply solve the secret word, from another player's description- but there's a catch, there are certain words that you can't say. It's harder than it sounds but lots of fun!Classic Charades- It's a \"race against mime\" in this game of Classic Game. Simply act out the titles of books, films, songs, tv shows and play without speaking for the other player/s to guess.Sing It Back - Read out the lyrics from a well-known song- your teammates must then say or better still, sing the next line. Earn extra points by guessing the artist and song titles.&nbsp;Name Game Quiz - Describe the famous person without using the words on the cards and see just how many your team mates can guess to win the game.&nbsp;Includes: 4 x 70 Game Cards, Decision Die, Instructions.&nbsp;All Ridley's games are being updated every year.&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"21.90","Name":"Fast masks and Coasters","Description":"These beer mat face coasters bring an element of joy to the otherwise tedious task of protecting surfaces. With 20 double sided coasters, watch as your friends transform into one of 40 different characters. These are the perfect antidote for an awkward silence, creates the ideal selfie opportunity and are a true fan favourite for a Snapchat story. Don't miss out!20 double sided coasters","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Card game SING IT BACK","Description":"Read out the lyric from a well-known song. Then your team mates must say or sing the next line of the song.&nbsp;This is a really fun game and includes 280 classic pop and rock&nbsp;hits from the 50s up to the current date.&nbsp;Please note: Ridley's games are renewed every year in order to be up to the current date.&nbsp;How to play: Four or more players in two teams.&nbsp;The winner is the first team to reach an agreed number of points. Set the timer for 60 sec. The selected player from the first Team must then pick a card and sing the first line for their team members to guess. Once the second line is sung correctly, they can sing the other first line. Pick another card and keep going until the minute is up! It is now the other's team turn to play. Each correct guess wins the team one point.&nbsp;140 question cards (280 songs)Instructions","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Card game CHARADES&nbsp;","Description":"Simply вЂact outвЂ™ the titles of books, films, songs, tv shows and plays without speaking for your team to guess.How to play: Four or more people split into two teams. A chosen player from each team mimes a title from the card, using actions only- strictly no talking allowed! The player should act out the title as a whole, or as individual words. The remaining players in the team have three minutes to guess the title and win two points. If they cannot guess in time, the other team has a chance to answer and win one point.&nbsp;Please note: Ridley's games are being updated every year.&nbsp;140 question cards (700 titles)Instructions","Category":{"CategoryName":"Party & Games"}},{"Price":"24.90","Name":"Magnetic play set ALICE&nbsp;","Description":"Now that Alice has her own magnetic play set, her adventures can continue on your locker or fridge! Comes with a dozen favorite characters and accessories from the original Tenniel illustrations for&nbsp;Wonderland&nbsp;and&nbsp;Through the Looking-Glass.","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes Fright","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"39.90","Name":"Shot Glasses Target","Description":"Did you ever wonder how shot glasses got their name? According to the overpaid workers in our Unemployed Philosophers Research Department, shot glasses got their name in the Old West. Cowboys would enter saloons and trade bullets for small glasses of whiskey. We often suspect our researchers of making crap up, but this theory has the ring of truth to it. Our country has always fostered a relationship between liquor and guns -- the Federal Bureau of Alcohol, Tobacco, and Firearms is just one example. (Dick Cheney is another.) And so we're offering this cool and unique set of Shot Glasses. They're decorated a variety of targets, and one with a realistic bullet hole. You get six shot glasses in each set, and they come packaged in a fun box with detailed instructions for drinking and shooting responsibly. So buy a set of Shot Glasses and get ready for some high caliber drinking!&nbsp;2 oz./ eachGift box","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Playing Cards PETITE ROSE","Description":"Classical playing cards with retro design of small pink roses, gently packed and closed in a metal vintage box with the same design.&nbsp;Box size: 10,5 cm x 7,5 cm.","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Playing Cards BICYCLE RIDERS","Description":"If you're going on a bicycling trip and you need a game, but you don't have a lot of room for it- these bicycle rider's classical playing cards (closed in a vintage metal box) are created especially for you.&nbsp;Box size: 10,5 x 7,5 cm.Classical playing cards","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Playing Cards DITSY GARDEN","Description":"If you're looking for a gift for a lady, but you know real flowers will wilt in a day or you love collecting playing cards, then we have the solution: Beautifully designed with small flowers- classical playing cards, gently packed and closed in a metal box with the same design.Box size: 10,5 cm x 7,5 cm.Classical playing cards","Category":{"CategoryName":"Party & Games"}},{"Price":"54.90","Name":"Smartphone Magnifier","Description":"/+ video below/Ever been in the bath and wanted to watch Netflix but the only safe spot for your phone to lean was&nbsp;too far away to make out Walter WhiteвЂ™s face clearly? Or been showing a video of a cat eating a burger on your phone to&nbsp;a group of friends and thought, my arm hurts? Well  is here to help your mobile content sharing woes and in retro-style too. is a lo-fi, hands free way to watch movies and videos off your phone&nbsp;at twice the original size. Just load your phone into the retro-styled cardboard TV and enjoy all your mobile content (feline videos included)&nbsp;on an 8вЂі screen. YouвЂ™re welcome.Dimensions:&nbsp;18.6 x 18.7 x 12.2 cm    Smartphone magnifier : ))) рџ„ #elephantbookstore #harrypotterlover #elephantbookstore A video posted by Elephant Bookstore Sofia (@elephantbookstoresofia) on Jan 30, 2017 at 11:12am PST","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Card game BRAIN FREEZE","Description":"A fast paced word guessing party game suitable for all ages. Get your team mates to work out the secret word, the only catch is you can't say any of the words listed on the card. It's harder than it sounds and lots of fun!Teams: Four or more players in two teams.Equipment: Stopwatch (not included)How to play: Decide on the number of rounds and divide players into Team A and Team B, choosing the order in which they will play. The first player from the first team can pick a card and describe the main words to theirThey must not reveal this word or use the five extra words stated on the card. Set the stopwatch, so each player has a maximum of 60 seconds to describe as many words as possible. One point is awarded for each correct answer guessed within the time limit.LET THE GAMES BEGIN!Includes 140 Question Cards","Category":{"CategoryName":"Party & Games"}},{"Price":"23.90","Name":"Drink Markers BOSOM BUDDIES","Description":"Feel like a gooseberry? Not merry enough to start making a fool of yourself yet? Grab yourself a bosom buddy! Be careful though this one could be a bit of a handful! Pop her on the edge of your glass and get to know her, im sure by the end of the night through your beer goggles you might really really like her! Introduce her to some people, have a dance with her, maybe even pucker up with her if you really get on! Everyone loves a bosom buddy especially one in a skimpy bikini! Use your bosom buddy at stag doвЂ™s, house parties, a lads night out or even a BBQ. Simply attach her hands to the edge of your glass and she's sure to cling on and show you her boobies!","Category":{"CategoryName":"Party & Games"}},{"Price":"23.90","Name":"Drink Markers DRINKING BUDDIES","Description":"Everyone needs a drinking buddy, especially one who looks great in a\r\n pair of budgie smugglers! Hang a hunk on the side of your glass to mark\r\n your drink and avoid mix ups. Essential for hen parties, girlsвЂ™ nights,\r\n picnics or anytime the drinks are flowing. \t\t\tPack size 217 x 170mm","Category":{"CategoryName":"Party & Games"}},{"Price":"11.90","Name":"Inflatable Crown KING","Description":"Show off your kingly majesty with this deluxe regal crown. Perfect for both kids and adults, this reusable inflatable royal headpiece is brilliant for birthdays, stag parties and any occasion where you need to show the world that you rule!","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes PrehistoriaPlayers: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes MedicPlayers: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes EnchantedPlayers: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes CluesPlayers: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"45.90","Name":"Story Cubes Max Original","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes IntergalacticPlayers: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes Score","Description":"Add a dash of magic to your stories! Roll all three cubes to conjure up fantastic fairy tales. Works even better when mixed with other sets of Rory's Story Cubes.Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes Powers","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes Medieval","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Looney Tunes","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Scooby Doo","Description":"Looks like another mystery to solve! Which monster is chasing Scooby and Shaggy? What clue has Velma discovered? With Rory's Story Cubes you decide the story! Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Moomin","Description":"Who has Moomintroll met, deep in the forest? Where will the Moomin family sail today? With Rory's Story Cubes you decide the story.Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Batman","Description":"Is the Riddler planning his next crime? Who has discovered BatmanвЂ™s identity? Will the Joker escape from Arkham Asylum? With RoryвЂ™s Story CubesВ®: Batman you decide the story.Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"9.90","Name":"Story Cubes Rescue","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"11.90","Name":"Inflatable Crown PRINCE","Description":"You rule! But only for one day, and only while you wear this deluxe, regal, inflatable crown! 185 x 170 x 20 mm","Category":{"CategoryName":"Party & Games"}},{"Price":"21.90","Name":"Inflatable Birthday Hat LOST COUNT","Description":"Inflatable birthday cake hat with candles. Who cares about the numbers, as long as everyone knows it's your birthday, it doesn't matter! One size only = adult size.","Category":{"CategoryName":"Party & Games"}},{"Price":"11.90","Name":"Cake candles Lost Count","Description":"Did we lost the count?","Category":{"CategoryName":"Party & Games"}},{"Price":"12.90","Name":"Card Glasses PARTY ANIMALS","Description":"/+ video below/When you bring NPW's Party Animal glasses, you bring the party!Party like an animal - literally! - with our animated card glasses! Just download the 'Party Animal NPW' app, choose your animal and watch as the masks transform into 3D animal heads that move when you move.&nbsp;Hit the Apple App Store or Google Play Store and download the \"Party Animal NPW\" app on your smartphone or tablet.Slip on the animal glasses of your choice. Cool cat, wild stag, crazy horse or hot dog.Grab a friend! As they hold the device watch the screen as your head becomes one of four crazy animals.Go wild over your party animal transformation!","Category":{"CategoryName":"Party & Games"}},{"Price":"24.90","Name":"Drink Markers LIZZIE'S FIZZIES","Description":"Everyone needs a drinking buddy, especially one with champagne \r\nquaffing etiquette. Hang a delightful queen Lizzie on the side of your \r\nglass to mark your drink and avoid mix ups. Essential for garden \r\nparties, picnics or anytime the drinks are flowing - just add bunting.  \r\n   Pack Size 173 X 162 X 23","Category":{"CategoryName":"Party & Games"}},{"Price":"14.90","Name":"Bunting RUSTY AND FRIENDSFive meter paper bunting with 15 flags, perfect for parties and celebrations. Not only for the little ones, but for the older too, especially if you love the forest and its occupants!","Description":"Length of bunting: 5m.15 flagsLength of each flag: 23 cm. Hemp rope","Category":{"CategoryName":"Party & Games"}},{"Price":"4.90","Name":"Great for birthday parties in any venue, this police style Birthday Part in Progress tape is perfect for kids and adults!","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"19.90","Name":"WHAT AM I? | Lagoon","Description":"A brilliant brain fitness game in which players divide into teams and compete against the clock to complete a mix of mind bending lateral and logic puzzles. A great gift for difficult to buy for men who like a mental challenge!","Category":{"CategoryName":"Party & Games"}},{"Price":"12.90","Name":"Perfect for birthdays, anniversaries and celebrations,Tabletop Numbers Trivia&nbsp;are filled with fascinating facts about that milestone number. 6 styles; 16, 18, 21, 30, 40 and 50. 48 pcs.","Description":"For ages:&nbsp;8+","Category":{"CategoryName":"Party & Games"}},{"Price":"12.90","Name":"Perfect for birthdays, anniversaries and celebrations,&nbsp;Tabletop Numbers Trivia&nbsp;are filled with fascinating facts about that milestone number. 6 styles; 16, 18, 21, 30, 40 and 50. 48 pcs in CDU.","Description":"For ages&nbsp;8+.","Category":{"CategoryName":"Party & Games"}},{"Price":"17.90","Name":"Magnetic Thinking Putty takes regular \"silly\" putty and turns its awesomeness up to 11. Like any other putty, it can be stretched, bounced, molded, popped, and torn. However, when this putty is in the presence of a magnetic field, it exhibits fascinating properties.","Description":"Millions of tiny micron sized magnets are embedded in each handful of Magnetic Thinking Putty. Use the included super strong ceramic magnet to control the putty like a snake charmer. Or \"charge\" the blob of putty so it can become a magnet of its own and pick up small tacks and paperclips.","Category":{"CategoryName":"Party & Games"}},{"Price":"29.90","Name":"Whiskey Glasses","Description":"Product No.24 from Gentlemen's Hardware.You decide whether the glass is half full or half empty! These elegant tumblers are a particularly fine choice for malt whiskey. The classic tulip shape captures aromas perfectly, whilst the naturally balanced weight enhances the drinking experience for any time liquor.To Good Health! Material: GlassH9 x W7 x D7.2cm","Category":{"CategoryName":"Party & Games"}},{"Price":"108.90","Name":"STAND OUT FROM THE CROWD WEARING THIS CREEPY HORSE HEAD MASK","Description":"We've discovered yet another universal truth   a person wearing a Horse Head Mask looks downright disturbing. But don't take our word for it, wear this latex mask with realistic fur mane to your next social function and watch as people scramble to avoid you! Fits most adult heads. Bagged with illustrated tag.&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"129.90","Name":"Mask Unicorn","Description":"STAND OUT FROM THE CROWD WEARING THIS CREEPY HORSE HEAD MASKWe've\r\n discovered yet another universal truth   a person wearing a Horse Head \r\nMask looks downright disturbing. But don't take our word for it, wear \r\nthis latex mask with realistic fur mane to your next social function and\r\n watch as people scramble to avoid you! Fits most adult heads.","Category":{"CategoryName":"Party & Games"}},{"Price":"4.90","Name":"Trivia 70s MUSIC&nbsp;","Description":"Presented in a mini collectable 1970вЂ™s style Vinyl Deck, this retro quiz will take you back to the golden days of music. Whether you need to break the ice at the dinner table, or just want to see who out of all your friends is the ultimate music buff, then tune into one of our retro Trivia Box Sets and relive some the best years of music.100 trivia cards","Category":{"CategoryName":"Party & Games"}},{"Price":"17.90","Name":"Board Game &nbsp;The Dirt Track Racing","Description":"Ideal for those who are a fan of detail and appreciate all things made with style. Great idea for a present or just for your personal collection.&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Card game BRAIN TEASERS","Description":"Put your friends and family to the test with this mind boggling collection of brain teasers, riddles and conundrums that will have you all scratching your heads!&nbsp;Four or more players:Teams: Two or more players in each team (or play one to one)Equipment: Stopwatch (optional- not included)How to play: Divide the players into two teams and toss a coin to decide who plays first. Teams must then take it in turns to pick a card and ask the competing team a question. One point is awarded for each correct answer. The fisrst team to win 10 points (or the team who wins the most amount of points in 15 minutes) is the winner.LET THE GAMES BEGIN!Includes 140 Question Cards","Category":{"CategoryName":"Party & Games"}},{"Price":"39.90","Name":"Chess and Checkers&nbsp;","Description":"~Chess is more than a game, the fine art of chess also tests one's patience and logic. Plan your strategy and use your moves to defend your king, while taking out your opponent's pieces.&nbsp;~Checkers is a seemingly simple game although the key lies with wisdom and practice, as well as a sharp memory and plenty of focus.Contains: Instructions, 1x Folded game board, 16x Silver chess pieces, 16x Black chess pieces, 12x Silver Checkers, 12x Black Checkers.Box dimensions: 39 x 20 cm.","Category":{"CategoryName":"Party & Games"}},{"Price":"65.90","Name":"UKULELE Hawaiian Dream","Description":"Everyone's favorite Ukulele is now here! And if you hear this word for the first time- it's alright. The Ukulele is not a kids size toy-guitar as you might think of it's size. It is wooden string instrument with Hawaiian origin, specific sound, 4 silicon strings and compact size so you can take to any trip. If you don't have the skills of getting a correct tune, it's alright again- there's a beginners guide included and also internet is full of tutorials- from basics to best tricks.&nbsp;Length: 53 cmColour: Red4 sillicon strings&nbsp;Set of stickers with Hawaiian motivesMaterial: Wood     Ukulele рџЊ #ukulele #ukulelegirl #ridleys #ridleysukulele #elephantbookstore A post shared by Elephant Bookstore Sofia (@elephantbookstoresofia) on Feb 10, 2017 at 12:59am PST","Category":{"CategoryName":"Party & Games"}},{"Price":"15.90","Name":"Boomerang","Description":"Incorporate some Australian tradition into gametime with this classic boomerang from Rex International . Complete with flying instructions, you'll soon be able to make your boomerang return to you, time and time again. A great way to get outside and combine fun with culture.Length 30 cmWidth 4cmWood, paint","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Voyages","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"59.90","Name":"Smartphone Projector GOLD","Description":"Ever wanted to&nbsp;project your favourite movie&nbsp;onto the wall while youвЂ™re snuggled up in bed using just your phone? Or thought it would be cool to show your mates funny fail videos but sometimes thereвЂ™s just too many of them to crowd around a small screen? Smartphone Projector has been designed by&nbsp;Luckies&nbsp;of London to create intimate screenings any time, any place. Whether you want to set up visuals for a house party or simply watch music videos with your friends, Smartphone Projector is the answer. Go hands free, put your feet up and view at up to 8 x magnification. Get more from your smart phone with the original, lo fi, D.I.Y Smart Phone projector. Light, compact and portable itвЂ™s the coolest way to use smart technology!&nbsp;Quite simply a cinema&nbsp;in a box!Material:&nbsp;Cardboard, with glass lens&nbsp;Colour: GoldSuitable for use with iOS and Android compatible smart phones. Phone brightness must be turned up to 100% and for maximum effectiveness use in a dark room and project onto a smooth white surface. Fits phones up to a maximum size of 8cm x 16cm&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"7.90","Name":"INCLUDES","Description":"48 cards and instructionsQUICK PLAYDeal the whole deck of cards face down, one card at a time to each player; do not look at &nbsp;your cards. In turn, each player takes a turn flipping over the top card of their pile and putting it face up in front of themselves. Flipping continues until one player turns over a card of the same Moustache as the top card on another player's pile. The first person to yell \"Snap!\" takes the two piles with matching cards and adds them face down to their own pile. The player who ends up with all the cards wins the game.","Category":{"CategoryName":"Party & Games"}},{"Price":"18.90","Name":"Crack the вЂtoonвЂ™, name the tune!Put your musical knowledge to the test in this fun family card game. Go head-to-head to see who can identify the musical artist and song from the cartoon on the card.&nbsp;","Description":"Box HWD: 9 x 13 x 3 cmSuitable for 2 or more players","Category":{"CategoryName":"Party & Games"}},{"Price":"22.90","Name":"Hologram Viewer","Description":"Fancy giving someone the ultimate personalised gift for their birthday this year? Sounds like you need our . This fun little gadget lets you create and watch 3D holograms in the comfort of your own home. All you need to do is download the free app, create your very own personalised content and place your phone into the hologram viewer.Had a fight with your beau? Send them&nbsp;an вЂIвЂ™m sorryвЂ™ message with our . Nothing screams forgive me like a hologram message, are we right? If giving the  to a loved one, the lucky recipient will receive a text message containing their personalised message and instructions on how to download and play their personalised content. If thatвЂ™s not the future, we donвЂ™t know what isвЂ¦Dimensions:&nbsp;4.1 x 17.1 x 7.9 cmFor best results,&nbsp;, place the product at eye level in a dark room.     Hologram viewer! рџ± #hologramviewer #elephantbookstore A video posted by Elephant Bookstore Sofia (@elephantbookstoresofia) on Jan 30, 2017 at 11:03am PST","Category":{"CategoryName":"Party & Games"}},{"Price":"59.90","Name":"Smartphone Projector COPPER","Description":"Ever wanted to&nbsp;project your favourite movie&nbsp;onto the wall while youвЂ™re snuggled up in bed using just your phone? Or thought it would be cool to show your mates funny fail videos but sometimes thereвЂ™s just too many of them to crowd around a small screen? Smartphone Projector has been designed by&nbsp;Luckies&nbsp;of London to create intimate screenings any time, any place. Whether you want to set up visuals for a house party or simply watch music videos with your friends, Smartphone Projector is the answer. Go hands free, put your feet up and view at up to 8 x magnification. Get more from your smart phone with the original, lo fi, D.I.Y Smart Phone projector. Light, compact and portable itвЂ™s the coolest way to use smart technology!&nbsp;Quite simply a cinema&nbsp;in a box!Material:&nbsp;Cardboard, with glass lens&nbsp;Colour: CopperSuitable for use with iOS and Android compatible smart phones. Phone brightness must be turned up to 100% and for maximum effectiveness use in a dark room and project onto a smooth white surface. Fits phones up to a maximum size of 8cm x 16cm&nbsp;","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Original","Description":"Players: 1+Age: 6+How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"5.90","Name":"It will take courage, quick wits and nerves of steel to beat the Million Pound Drop вЂ“ Have you got what it takes? Packed with over 110 questions.","Description":"The Million Pound DropВ© Endemol UK Limited 2010. The Million Pound Drop is a registered trade mark of Endemol UK Limited and is used under licence.&nbsp;UK exclusive","Category":{"CategoryName":"Party & Games"}},{"Price":"5.90","Name":"Everybody's talking about pop music! Whether you're a dancing queen, or a king of rock 'n' roll, this quiz will determine who is going to be crowned the top of the Pop Quiz! Featuring a vast range of pop related posers, this groovy game will bring the dance floor to wherever you choose to play it. No matter what your specialist genre of music, this pop quiz is sure to have all contestants singing its praises!","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"5.90","Name":"Host your own entertaining pub quiz night with friends and family from the comfort of your own home with 50Fifty's Quiz Factory. With 250 questions testing your knowledge on a whole range of topics, this set of quiz questions is bound to test even the greatest quiz minds. A novelty item based on traditional fun that will please the whole family!&nbsp;","Description":"No description available","Category":{"CategoryName":"Party & Games"}},{"Price":"28.90","Name":"Drinking Games COMPENDIUM","Description":"Endless nights of utterly outrageous fun and frolics are guaranteed with this fantastic compendium of adult drinking games. Each of the 25 games will turn any gathering into a night to remember, as players cast inhibitions aside and participate in what can only be described as sheer madness and mayhem!1 pack of Drinking Game cards, containing 25 games, 1 pack of playing cards, 1 pack of forfeit cards, pad and pencil, 5 dice, ping-pong ball, 4 straws, 1 ribbon, full instructionsPack comes in a metal box, shaped as a bottle","Category":{"CategoryName":"Party & Games"}},{"Price":"19.90","Name":"Drinking game SHOTS AND CROSSES","Description":"The classic game of noughts and crosses requiring strategy and concentration... HICC! Can you keep your wits about yourself and make a winning row of three? Play this classic game of strategy and concentration with a difference. The first player to make a row of shot glasses wins- the loser's forfeit is drink them! Water, vodka, whisky, ouzo- it's up to the winner! 9 shot glasses (plastic)1 reusable game mat","Category":{"CategoryName":"Party & Games"}},{"Price":"25.90","Name":"Story Cubes Actions","Description":"Players: 1+Age: 6+ How to play? Story Cubes are often used for team building, brain storming or as extension to other board or drinking games. The most popular way to play is telling stories about last night or made-up stories on certain topic. Elephant Bookstore (as well as other companies) uses Story Cubes in job interviews, which is a very good check of person's imagination.","Category":{"CategoryName":"Party & Games"}},{"Price":"11.90","Name":"Cake candles Happy Fucking Birthday","Description":"For when there is not enough room on the cake...","Category":{"CategoryName":"Party & Games"}}]