[{"Price":"69.90","Name":"World Travel Map for Kids&nbsp;","Description":"A map of the world for children, which helps you learn about the world while playing.Choose the appropriate set of cards with animals or sights, along with your child place the cards in the correct countries and explore the world with pleasure.Cards and sticker set","Category":{"CategoryName":"Stationery"}},{"Price":"85.90","Name":"World Scratch Map Geography&nbsp;","Description":"The most detailed scratch and pin map of the world.&nbsp;The map contains many islands, small countries, cities and places of interest.Also you will get a scratch list with the worldвЂ™s most popular tourist destinations.Unique design with golden scratch layer.&nbsp;Just take the scratcher and scratch off the layer from the countries you have already visited and your own travel history will come alive in bright colors. This map will be an &nbsp;excellent adornment for the home and also an inspired present for your friends and family.Discover the whole world with travel map geography world!Map dimensions: &nbsp;88 СЃm x 60 cmThe map is made of high quality laminated paper (250 g/m ВІ)","Category":{"CategoryName":"Stationery"}},{"Price":"59.90","Name":"Wooden Sketchbook N2 Elephant","Description":"Handmade in Bulgaria for Elephant Bookstore Ltd.This old school 80 page sketchbook with brown recycled paper is lovingly made from 200-300 year old wood,\r\n carefully recycled from the doors of abandoned houses in old villages \r\naround Veliko Tarnovo, the former medieval capital of Bulgaria, which \r\nmakes every cover completely unique. The paper is recycled and \r\nartificially aged too.Dimensions:&nbsp;&nbsp;19 СЃРј С… 14,5 СЃРј С… 2,5 СЃРј.Material: Wood, paper","Category":{"CategoryName":"Stationery"}},{"Price":"48.90","Name":"Wooden Notebook N3 Elephant&nbsp;","Description":"Handmade in Bulgaria for Elephant Bookstore Ltd. This old school 80 page notebook with brown recycled paper is lovingly made from 2-300 year old wood, carefully recycled from the doors of abandoned houses in old villages around Veliko Tarnovo, the former medieval capital of Bulgaria, which makes every cover completely unique. The paper is recycled and artificially aged too.Dimensions:&nbsp;11 СЃРј С… 14,5 СЃРј С… 2,5 СЃРј.Material: Wood, paper","Category":{"CategoryName":"Stationery"}},{"Price":"87.90","Name":"Not specified","Description":"Bag Harry Potter GryffindorRed massanger bag with the Gryffindor label that is a must have for any Quidditch team member.&nbsp;Pocket with zip on the inside and a slip pocket on the outside,&nbsp;Adjustable shoulder strap, zip up fastening, front pocket and inner zip pocket, black polyester lining. The whole bag is made from PU. This bag will make you too cool for school.&nbsp; Measures:&nbsp;Adjustable shoulder strapzip up fasteningPU leather&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Notebook A5 THE JOKER","Description":"A perfect bound leather look notebook featuring embossed Batman - The Joker HaHaHa artwork on the cover.&nbsp;The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap.&nbsp;A perfect gift for any Joker fan.180 pagesApproximate dimensions: 21 cm x 15 cm x 2 cm&nbsp;Storage pocket in the backPen loop and strap&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Notebook FRIENDS CENTRAL PERK&nbsp;","Description":"Friends Central Perk Premium A5 Hardback Notebook. Made PU leather with a Central Perk logo.&nbsp;The book is held shut with an elastic strap with metal slider, has an elastic pen holder and a paper pocket on the back inside cover. The pages inside are blank and it has approx. 110 pages.&nbsp;Blank PagesApprox. 110 pages.Size: 21 cm x 14.5 cm x 2 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Notebook Game of Thrones LANNISTER","Description":"A perfect bound \"leather look\" Game of Thrones A5 notebook featuring embossed Lannister artwork on the cover. The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider. This officially licensed notebook is a perfect gift for any Game of Thrones fan.Premium Leather Effect A5 notebookElastic pencil holder and retaining strap featuring logo slider120 pagesCool embossed cover designOfficially licensed","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Notebook ADVENTURE TIME","Description":"Adventure Time, come on grab your friends and go to very distant lands! Join Jake the Dog and Finn the human on their incredible psychedelic and whimsical adventures in the Land of Ooo.&nbsp;With this Adventure Time Jake A5 Hardback Notebook you can begin producing your own wacky cartoon creations! This officially licensed notebook features Jake the Dog to inspire you on your way to greatness! Awesome!Size: A5Hardback Notebook Elasticated FasteningApprox. 90 pages","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Black Heisenberg Premium A5 Notebook | Breaking Bad","Description":"A perfect bound \"leather look\" notebook featuring embossed Heisenberg artwork on the cover. The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider. A perfect gift for any Breaking Bad fan.","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Notebook &nbsp;A5 HARLEY QUINN&nbsp;","Description":"Hardback book with unlined Pages, made out of &nbsp;PU leather. Features&nbsp;handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider.&nbsp;A perfect gift and a must have for any&nbsp;DC Comics&nbsp;fans.Size: 21 x&nbsp;14.5 x 2cm180 pagesStorage pocket in the backPen loop and strap&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Notebook A5 &nbsp;Game of Thrones TARGARYEN&nbsp;","Description":"A perfect bound \"leather look\" Game of Thrones A5 notebook featuring embossed House Targaryen artwork on the cover. The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider. This officially licensed notebook is a perfect gift for any Game of Thrones fan.Premium Leather Effect A5 notebookElastic pencil holder and retaining strap featuring logo slider120 pagesCool embossed cover designOfficially licensed","Category":{"CategoryName":"Stationery"}},{"Price":"25.90","Name":"Notebook A5 &nbsp;Game of Thrones STARKA perfect bound \"leather look\" Game of Thrones A5 notebook featuring embossed House Targaryen artwork on the cover. The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider. This officially licensed notebook is a perfect gift for any Game of Thrones fan.Premium Leather Effect A5 notebookElastic pencil holder and retaining strap featuring logo slider120 pagesCool embossed cover designOfficially licensed","Description":"No description available","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Notebooks HARRY POTTER MAGIC&nbsp;","Description":"Two awesome exercise notebooks for you to practice your spells and write down potions. Any young wizard should have these. The books are unlined inside, size A5, two notebooks.Size: A52 x Exercise BooksUnlined","Category":{"CategoryName":"Stationery"}},{"Price":"29.90","Name":"Notebook A5 Chewbacca Furry","Description":"A perfect bound A5 notebook featuring Chewbacca faux fur cover. The inner pages are printed with a custom logo and there is a coloured ribbon book mark. This officially licensed notebook is a a perfect gift for Star Wars fans of any age.","Category":{"CategoryName":"Stationery"}},{"Price":"29.90","Name":"Journal A5 FANTASTIC BEASTS&nbsp;","Description":"A journal for you to write down your spells and magic potions or documenting &nbsp;your Fantastic Beasts. The&nbsp;notebook has a PU leather cover and ties to keep it closed.&nbsp;There are approximately 120 lined pages and a page marker, &nbsp;size: A5. Would make a great gift for a Fantastic Beasts / Harry Potter fan!Size: A5PU leather&nbsp;Approx. 120 lined pages","Category":{"CategoryName":"Stationery"}},{"Price":"23.90","Name":"Money box GRINGOTTS","Description":"Metal money box for Harry Potter fans. May be used by muggles as well (just like you). There is a hole located at the bottom so you can cheat. Size 14 cm x 7cm&nbsp;Metal","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"Notebook A6 HUFFLEPUFF","Description":"The yellow and black Hufflepuff crest, which features a badger, represents a house that stands for hard work, patience, justice, and loyalty. Perfect for writing down magic spells and potion recipes.\r\nSize A6\r\n240 pages\r\nHard covers\r\nElasticated band","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"Notebook A6 SLYTHERIN","Description":"The house represents values ambition, cunning, leadership, and resourcefulness. Perfect for writing down magic spells and potion recipes.Size A6Hard covers240 pagesElasticated band","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Wooden Jumbo Pencil","Description":"Made in UKMade From Natural Wood From A Sustainable Source.Warning Label Reads:&nbsp;\"This Is Not A Toy: Do Not Fire\"Size:&nbsp;23 x 2 cm&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Notebook A6 Futile Attempt","Description":"With colourful gilded edges, printed endpapers and coloured elastic closure. Reads Futile Attempt at Organising my Life on the front cover. &nbsp;Colour: Blue","Category":{"CategoryName":"Stationery"}},{"Price":"229.90","Name":"Dimensions: H34 x W22.5 x D25.5 cm","Description":"No description available","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"Ohhh hot pink, yes please. This sugary pop notebook from Happy Jackson is just the thing to fix our addiction to Happy Jackson. The cheeky little sayings on everyday objects we adore. This hot pink notebook is not exception and we love this cheeky little saying. The notebook reads: вЂњCRAP I GOTTA GET DONE!вЂќ and we are pretty sure everybody things this every single day. The list mount up and things only seem to get ticked of slowly. But with this notebook you can make your lists and the front will always remind you the clock is ticking.","Description":"Finished off with an elasticated closure, this notebook is ideal for work, in your office drawer or on the go. Inside the pages are lined.","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Notebook A6 MADNESS IS JUST GENIUS IN DISGUISE","Description":"Colour: turquoise-greenElastic band for secure closeInside motives in yellow","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"Happy Jackson Thoughts And Doodles Notebook. With colourful gilded edges, printed endpapers and coloured elastic closure.&nbsp;Reads Thoughts and Doodles of an undiscovered Genius on the front cover. A5 Size.","Description":"No description available","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"We love a bit of yellow and this stunning bright yellow notebook really catches our eye. A great way to keep all your list, to do notes and of course any great ideas and cunning plans. Complete with pretty colourful gilded edges, printed end papers and the elastic closure, we also love the little light bulb, for those light bulb moments ding! A lovely gift this Christmas, we also have many more designs on lovely bright notebooks. As you can never have enough lists.","Description":"Loved by bloggers to, this stunning notebook from Happy Jackson is sure to go down a treat whether buying as a gift or why not just treat yourself, and brighten up your day with a sunshine notebook.Size: A5","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"A5 Notebook Random Crap&nbsp;| Happy Jackson","Description":"Do you know someone who needs a little assistance in getting organised or just can't find a place for those random thoughts? This Happy Jackson A5 notebook is the perfect place to note down all that random crap from your mind!Hosts colourful gilded edges, beautifully lined paper, printed endpapers and a coloured elastic closure.Reads \"Random Crap\" on the front cover","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Notebook Stargazing Large&nbsp;","Description":"The beautiful Stargazing Notebook comes in a larger format with the same useful features - constellation maps, a guide to the phases of the moon, a schedule of total lunar eclipses, and a handy tear-out simple astrolabe - so you can use it for stargazing at night or for making everyday notations of your days.&nbsp;18cm С… 12,5cm.","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Stargazing","Description":"A beautiful little notebook for communing with the universe, compete with: \r\n\r\n- constellation maps\r\n- schedule of total lunar eclipses\r\n- guide to the moon's phases\r\n- a tear-out simple astrolabe\r\nDimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Comic Notebook&nbsp;","Description":"They say everybody has a book in them - possibly a classic - and these days it's more likely than ever that book is a comic book.&nbsp;The pages already have comic book borders and panels drawn in, so from the moment you open the cover, you're ready for action. And that's not all. The back panel gives you more than a dozen punch-out stencils to use for speech balloons, thought balloons, captions, sound effects... everything you need to tell your story.9cm С… 12,5cm. / 64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Notebook Sherlock Holmes&nbsp;","Description":"Here's the indispensible Sherlock Holmes Notebook in a larger format with Rules of Deduction and even more handy features -- not to mention additional space to record the case, date, clues, suspects, and your every astute observation!&nbsp;&nbsp;\"Holmes, you have an answer to everything.\"&nbsp;18cm x 12,5cm","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Captains Log","Description":"A handy notebook with charts, inspirational quotes, and room for the many observations you'll make on your five-year mission. Star Trek fans will know.&nbsp;64 pages / 9cm x 12,5cm","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Notebook CAPTAINS LOG","Description":"A handy logbook with charts, inspirational quotes, and room for the many observations you'll make on your five-year mission. All Stark Trek fans will understand.4.75\" x 7\" with 64 lined pages for all your observations","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes FEMINOTES","Description":"Some men still don't get the message, so stick it to them with FeminNotes\r\n sticky notes. Their bold colors and creative shapes will help you \r\nplayfully get your point across. Each attractive sticky note booklet \r\ncomes with over 100 die-cut sticky notes for all occasions, and it all \r\nfits easily in your pocketbook. FemiNotes will stick to binders, \r\nmonitors, desktops, and even glass ceilings.11 x 8 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky notes Christ&nbsp;","Description":"Jesus really knew how to get people's attention. Whether He was walking on water, healing lepers, or feeding a mob with just a few fish, Jesus really knew how to get His point across. And now we have a minor miracle that can help you communicate, too. Adhesive Christ Almighties sticky notes are an inspired set of die-cut sticky notes that are guaranteed to get noticed.11 С… 8 СЃРј.","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes MUSICAL NOTES","Description":"Do your memos tend to B flat? Wouldn't you like to C major improvements in your communication skills? If all this strikes a chord with you, then consider getting some of these Musical Notes Sticky Notes for yourself or your staff. It's no treble at all.&nbsp;11 x 8 cm","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky notes STAR TREK","Description":"The Star Trek Sticky Notes booklet comes with hundreds of handy sticky notes featuring your favorite characters from the original series.&nbsp;&nbsp;Become your own chief of communications!11 x 8 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes FIRST AID","Description":"A pack of sticky notes \r\nin the shapes of ointment and assorted bandages -- everything you need \r\nto remedy your writing: fix the wording, mend a sentence, and make your \r\ndocuments all better. \r\nPerfect for script doctors!11 x 8 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"69.90","Name":"Wallet Cross EspaГ±ol Black","Description":"Men slim wallet Cross Grabado EspaГ±ol from genuine leather in black color with 8 card holders, 2 paper money departments and 2 side departments for ID. The perfect gift for any true gentlemen.&nbsp;Size: 9 x 10,8cm.&nbsp;Gift box6 months guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Stationery"}},{"Price":"165.90","Name":"Planner with pen RTC Cross A5 Black","Description":"The Classic Century Leather Padfolio holds an A4 note pad and features various pockets for documents, notes, and cards. It makes elegant presentation at meetings and also makes a great gift.&nbsp;An A4 note pad and holderOne expandable document pocketFour card slots and a pen loopCross agenda pen (refill # 8779B-4) with lifetime mechanical guaranteeFull-grain Napa leather with two-year material and workmanship warrantyThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners. If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Stationery"}},{"Price":"69.90","Name":"Journal Cross STAR WARS C3PO","Description":"Designed to complement your Star Wars pen, each journal features a flexible cover with an embossed character-themed design and Star Wars logo. Smart features include an inside pocket, an elastic closure, and a ribbon to mark your page as you journal your favorite Star Wars scene.Cover features an embossed character-themed design in a high-quality leatherette finishPen holder incorporated into the spine of the journal (pen not included)Details include an angled elastic closure, ribbon page marker, and inside pocket.Available in medium size with 160 lined acid-free pages of 100gsm qualityPaper is made from FSC-certified, post-consumer recycled paperThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners. If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Stationery"}},{"Price":"59.90","Name":"Journal with pen Cross Signature Black","Description":"Signature Medium Journals are a stylish evolution. Each journal features a cleverly integrated pen sleeve that's ideal for storing the complimentary pens, plus ribbon page marker, expandable inner pocket and acid-free paper with perforations to more easily tear out pages.A5 page format (14,8 x 21,00cm)Lined pagesPen holder incorporated into the spine of the journal.Details include a ribbon page marker.Inside pocket.Pen included.The various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners. If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Stationery"}},{"Price":"49.90","Name":"Journal with pen Cross A6 Brown","Description":"Signature Small Journals are a stylish evolution. Each journal features a cleverly integrated pen sleeve that's ideal for storing the complimentary pens, plus ribbon page marker, expandable inner pocket and acid-free paper with perforations to more easily tear out pages.A6 page size (10,5 x 14,8cm).Lined pages.Pen holder incorporated into the spine of the journal.Details include a ribbon page marker.Inside pocket.Pen included.The various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Mars","Description":"A passport notebook to the red planet. The age of space exploration may be over, but that doesn't mean you can't dream.\r\n\"There are celestial sights more dazzling spectacles that inspire more awe, but to the thoughtful observer... there is nothing in the sky so profoundly impressive as these canals of Mars\"\r\n\r\n\r\n3.5\" x 5\"\r\n64 pages\r\n\r\n\r\n    Make your choice now!","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Neverland","Description":"We know a place where dreams are born and time is never planned... And now you can get there with this official Neverland Passport. It's actually a durable and attractive notebook beautifully decorated with vintage images from Peter Pan. There are all sorts of fun uses... We hear that Tinker Bell uses one for her diary. (\"Dear Diary, that Wendy is such a jerk!\") So get a Neverland Passport for your next trip and you will breeze through Neverland customs (though Captain Hook always has trouble at the metal detector).Includes travel tips and an official passport information page.Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Nirvana&nbsp;","Description":"Who needs mediation when you can simply buy a passport to nirvana? It's also a notebook, handy for keeping track of your past lives.Includes travel tips and an official passport information page.Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes EINSTEINA little book with assorted sticky notes.\r\nWhen closed, the books measure 3 1/4\" X 4 1/4\" and will fit nicely in your purse or back pocket!","Description":"No description available","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes FRIDA KAHLO","Description":"A little book with assorted sticky notesWhen closed, the books measure 3 1/4\" X 4 1/4\" and will fit nicely in your purse or back pocket!","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes Freudian Slips","Description":"No description available","Category":{"CategoryName":"Stationery"}},{"Price":"27.90","Name":"Hip flask Garden BirdsOur clients say they're so content that they start seeing random birds. Weird. Is it that good?","Description":"Material: stainless steel6 oz.","Category":{"CategoryName":"Stationery"}},{"Price":"27.90","Name":"Hip flask Periodic Table","Description":"Perfect for exam preparation. Perfect during exam. Perfect after exam.Material: Stainless steel6 oz.","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Wonderland","Description":"When you're at the Wonderland border, getting held up in customs can make you late for very important dates. If you're fortunate enough to possess one of our Wonderland Passports, however, you'll sail right through and be playing croquet with the Queen in no time. The Wonderland Passport looks and feels just like an official passport, but it's actually a handy and attractive notebook. It features an image of the White Rabbit on the cover, and includes useful travel tips from Lewis Carrol's imagination, such as \"Tip #4: Begin at the beginning and go until you come to the end: then stop.\"&nbsp;Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"11.90","Name":"Classic Bicycle Bell","Description":"Whether you're on your bike or on the pavements, this classic chrome-plated bicycle warning bell will alert pedestrians and slow walkers alike to your presence.Diameter: 6 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"42.90","Name":"Glow in the dark STAR MAP","Description":"Made in the UK.Star Map is a wonderful piece of wall art as well as a unique, functional, and genuinely fascinating map of the constellations. Printed on high quality paper, with a beautiful matt finish contrasting with spot laminated design features Looks great in the daytime although it's in darkness that the real magic happens   features amazing glow in the dark in) A beautiful and unusual feature in any environment. For those interested in astrology, the constellations which make up the signs of the zodiac are highlighted and typical attributes of each star sign are described.59.4 x 42 x 0.1 cm","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Utopia","Description":"This small notebook is your passport to the mythical land of Utopia. Fill the blank pages with notes for constructing your own perfect society. Because that's the closest you'll get to Utopia.Includes Vtopensivum Alphabetvm - Utopian Alphabet and an official passport information page.Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Area 51","Description":"A passport notebook that proves Area 51 is real! Spread the truth!Includes travel tips and an official passport information page.Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"79.90","Name":"The Light Blue Pin World Map is a world wall map printed on a flexible felt panel. The continents include cities with over 1 million inhabitants, and the map also offers a unique and exciting view of a world without borders. The surprising graphic results achieved make the maps ideal for display at home or in the office. The tactile characteristics of felt transform the static nature of a map вЂ” a simple object to be looked at вЂ” into something new with which users can interact.","Description":"The attractive package includes a set of 15 special pins to use with the map. Using these special pins it is possible to relate to the geographical image presented and develop an individual narrative concept. Pins, notes, drawings, photos and souvenirs can be attached to the maps to create a travel log of an actual trip or the expedition of your dreams.Origin: ItalyPin Regular: 130cm L x 70cm H&nbsp;100% Recyclable&nbsp;15 Pins Included&nbsp;Felt Panel&nbsp;Iron on Reverse&nbsp;Washable","Category":{"CategoryName":"Stationery"}},{"Price":"2.90","Name":"Christmas Fortune Pen","Description":"What will Christmas bring? Keep clicking to find out... Includes a \"What is your Christmas fortune?\" legend on the back. You can get up to 6 different fortunes, that must be 3 in a row!","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Hell","Description":"You'd think that getting into Hell would be easy. It USED to be, but like airport travel and filing tax returns, everything is more complex these days. But have no fear -- the Hell Passport can make your passage into eternal damnation a piece of Devil's food cake. It looks and feels just like an actual passport and includes a place for personal information, a passport photo, and useful travel tips. And if you don't have any immediate plans to go to Hell, it also functions as a handy and cool little notebook to jot down your most devilish thoughts. (Warning: the pages are not flame retardant, so keep your passport a safe distance from the burning brimstone, okay?)&nbsp;Dimensions: 9 cm x 13 cm64 pages    Make your choice now!","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Comic Book Notebook Large","Description":"The pages already have comic book borders and panels drawn in, so from the moment you open the cover, you're ready for action. And that's not all. The back panel gives you more than a dozen punch-out stencils to use for speech balloons, thought balloons, captions, sound effects... everything you need to tell your story.&nbsp;Whether you're a writer/artist or collaborating with a talented friend, here is the perfect portable, tradable pocket notebook for drawing superheroes or drafting scenes for your ground-breaking autobiographical graphic novel.&nbsp;What are you waiting for? The Comic Notebook will give your drafts and drawings some real POW!&nbsp;Twice the size of our pocket Comic Book Notebook, this larger format gives you the same comic book style guide, list of tools, and punch-out stencils - but with more room, for cartoonists who have big things to say!Large format (4.75 x 7\") pages of panels, punch-out stencils included.&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Garden of Eden","Description":"Returning to Paradise is a bitch. We spend much of our lives trying to return to the simple, innocent, and trouble-free state that Adam and Eve apparently took for granted. It's a challenge, but at least it's become a bit easier with our official Garden of Eden Passport. This attractive notebook features Adam and Eve on the cover and looks and feels like an actual passport. Inside you'll find a page for your personal passport data - even a spot for a photo so people will know you from Adam. You'll also find selected passages from the Book of Genesis and loads of blank, ruled pages so you can use it as a notebook or diary to record your original sins.&nbsp;Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Camelot","Description":"All hail Camelot! Join the Knights of the Round Table with this Camelot Passport. Keep a journal of your quest for the One True Grail within its pages.&nbsp;Includes&nbsp;The knight code of Chivalry&nbsp;and an official passport information page.&nbsp;Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Plato's Republic","Description":"Welcome to Plato's Republic, a land ruled by philosopher-kings and their guardians! It's a happy-go-lucky place where anything goes, except for theater, poetry, wine, flutes, parenting, democracy, and other things of that sort. If you visit this perfectly imperfect land, you should probably get hold of a Plato's Republic Passport. It includes useful travel tips with a handy list of things that The Republic allows and does not allow. (No random breeding, please.) And best of all, the Plato's Republic Passport doubles as a cool little notebook where you can record your own deep thoughts and dental appointments.Includes travel tips and an official passport information page.Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Paradise","Description":"Imagine this scenario: You've reached the end of your life and see that welcoming bright light at the end of the tunnel. As you emerge, you behold Paradise in all its glory spread out before you. But as you start to enter, you're stopped by some uniformed official demanding to see your Paradise Passport. Would that stink, or what? And that's why we made the Paradise Passport It's an attractive and realistic passport that's guaranteed to grant easy access to Paradise. Just flash this baby and you'll have total access to everything Paradise has to offer -- rolling hills, fields of flowers, babbling brooks, etc. (Now that we think about it, Paradise sounds sort of dull. But, thankfully, the Paradise Passport is also useful for getting the hell out of there. And it also makes a lovely notebook for the earthly realm.)Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport OZ","Description":"\"It is not down in any map; true places never are.\" - MelvilleGetting to The Land of Oz\r\n used to be a complicated and dangerous process, involving tornadoes, \r\nuprooted farmhouses and violent welcoming committees. But now it's a lot\r\n easier thanks to our official Oz Passport. This realistic passport will\r\n grant you unhindered travel throughout Oz. Explore Munchkinland! Frolic\r\n in the Poppy Fields! Visit\r\nthe Emerald City and party with the Big O himself! The Oz Passport also \r\nfunctions as a handy and durable notebook, perfect for keeping a journal\r\n for any trip or adventure. So get one for yourself... and your little \r\ndog, too!\r\nIncludes travel tips and an official passport information pageDimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Dimensions: 9 cm x 13 cm64 pages","Description":"No description available","Category":{"CategoryName":"Stationery"}},{"Price":"24.90","Name":"Cast Iron Dog HookThis cast iron hook is perfect for dog lovers. Especially Labradors. Especially iron ones.","Description":"Dimensions:  Height: 13 cm Width: 5 cm","Category":{"CategoryName":"Stationery"}},{"Price":"85.90","Name":"Scratch Map MARINEScratch map in ocean blue with silver cover of the countries, that is actually red underneath. But first, you need to go to the certain country and then scratch it on your map. Don't cheat! You can also write and draw on it or hang the map on your wall! It is great fun for travelers! Let the scratch begin! You have one lifetime! GO!","Description":"60 x 40 cmMaterial: PlasticContains: white marker, pins, and metal tool for scratching","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"Notebook A6 &nbsp;GRYFFINDOR","Description":"The house Gryffindor represents bravery and chivalry. As a member this notebook is perfect for writing down magic spells and potion recipes.Size A6240 pagesHard coversElasticated band","Category":{"CategoryName":"Stationery"}},{"Price":"19.90","Name":"Notebook A6 RAVENCLAW&nbsp;","Description":"Ravenclaw crest, which features an eagle, represents a house that stands for intelligence, creativity, learning, and wit. Perfect for writing down magic spells and potion recipes.Size A6240 pagesHard coversElasticated band&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport Sherlock Holmes","Description":"The game is afoot! This useful pocket-sized notebook will allow you to jot down clues and to-do list while you're on the chase of an evil mastermind. 64 pages / 9cm x 12,5cm&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"39.90","Name":"Scratch MapВ® Travel map has proved to be a real hit, so what could be better than a compact sized version of the most opulent map in the Luckies of London Scratch MapВ® maps range. Ready to be slung inside a suitcase nothing less than a LV leather trunk of course..) Scratch MapВ® Travel Deluxe map is made using luxury finish matte black paper, with gold foil overlay. Featuring the same detail as the full size version, keep track of where youвЂ™ve been by revealing the world in all itвЂ™s colorful glory.","Description":"As if that wasnвЂ™t enough, the back of the map has a multitude of facts to tick off as you travel, or to inspire your next adventure. Intrigued by the fact that Monaco has the shortest coastline in the world? Book that flight, remove that foil and cross off another map fact!We chose to use matte finish paper because it looks that bit more special and exclusive, it does mean however it needs to be treated a little differently to itвЂ™s gloss finish sister. We recommend using an eraser or fingernail to remove the foil, as metal can damage the paperвЂ™s lovely looking matte finish.Size: 42 x 29.7 cm","Category":{"CategoryName":"Stationery"}},{"Price":"59.90","Name":"Journal with pen Cross Signature Brown","Description":"Signature Medium Journals are a stylish evolution. Each journal features a cleverly integrated pen sleeve that's ideal for storing the complimentary pens, plus ribbon page marker, expandable inner pocket and acid-free paper with perforations to more easily tear out pages.","Category":{"CategoryName":"Stationery"}},{"Price":"69.90","Name":"Journal Cross STAR WARS Darth Vader&nbsp;","Description":"Designed to complement your Star Wars pen, each journal features a flexible cover with an embossed character-themed design and Star Wars logo. Smart features include an inside pocket, an elastic closure, and a ribbon to mark your page as you journal your favorite Star Wars scene.Cover features an embossed character-themed design in a high-quality leatherette finishPen holder incorporated into the spine of the journal (pen not included)Details include an angled elastic closure, ribbon page marker, and inside pocket.Available in medium size with 160 lined acid-free pages of 100gsm qualityPaper is made from FSC-certified, post-consumer recycled paperThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners. If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Stationery"}},{"Price":"26.90","Name":"Notebook Bicycle Rider's Journal","Description":"The perfect gift for a scribbling cyclist, this 150 (approx.) blank page\r\n journal with document pocket, bookmark ribbon and security band is sure\r\n to be well received. 21 x 15 x 0,7 cm.Material: Card, Paper","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Classic Service BellClassic chrome reception desk service bell, just ring the bell for service!&nbsp;","Description":"Diameter of bell: 8.5cm","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Bicycle Horn","Description":"If you enjoy riding your bike and hate people messing around your life, then this classic bike horn is perfect for your situation! Even on competitions! It will scare the crap out of the other competitors and make you win! Get this new best friend now! Length: 19 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"59.90","Name":"Wooden Photo Album A5 Elephant","Description":"Handmade in Bulgaria for Elephant Bookstore Ltd. This old school 80 page sketchbook with brown recycled paper is lovingly made from 200-300 year old wood,\r\n carefully recycled from the doors of abandoned houses in old villages \r\naround Veliko Tarnovo, the former medieval capital of Bulgaria, which \r\nmakes every cover completely unique. The paper is recycled and \r\nartificially aged too.Dimensions: A5 formatMaterial: Wood, paper","Category":{"CategoryName":"Stationery"}},{"Price":"36.90","Name":"Travel Edition Scratch Map Poster","Description":"Compact and cute,  is a mini version of our best selling Scratch Map В® Original. The perfect present for the globetrotter in your life, it wonвЂ™t take up too much room in a rucksack! The idea behind Scratch MapВ® Travel came about because so many people loved having a Scratch Map on their walls but wanted something similar, to take with them on their travels. So Scratch MapВ® Travel was born, compact enough to pop in a suitcase, but big enough to contain detail and keep a record of your adventures. Everyone intends to keep a journal or diary when they go on the trip of a lifetime, but in reality fun comes first! Scratch MapВ® Travel makes it easy to record your adventures as you go.","Category":{"CategoryName":"Stationery"}},{"Price":"15.90","Name":"This pencil is dedicated to Tommy Tucker Conservative M.P.between (1950-1958).Each pencil tells the humorous story of its origin. Made From Natural Wood From A Sustainable SourceWarning Label Reads: \"This Is Not A Toy: Do Not Fire At Point Blank Range: Not Suitable For Irresponsible Chidren Or Adults\"","Description":"Size: 18 cmMade in UK","Category":{"CategoryName":"Stationery"}},{"Price":"29.90","Name":"Notebook A5 BATMAN","Description":"A perfect bound \"leather look\" notebook featuring embossed Batman Logo artwork on the cover. The inner pages are printed with a custom logo and there is a handy rear storage pocket, a coloured ribbon book mark, elasticated woven pen loop and matching strap with a custom moulded metal slider. A perfect gift for any DC Comics fan.","Category":{"CategoryName":"Stationery"}},{"Price":"29.90","Name":"Notebook A5 SUPERMAN","Description":"A perfect bound \"leather look\" notebook featuring embossed Batman \r\nLogo artwork on the cover. The inner pages are printed with a custom \r\nlogo and there is a handy rear storage pocket, a coloured ribbon book \r\nmark, elasticated woven pen loop and matching strap with a custom \r\nmoulded metal slider. A perfect gift for any DC Comics fan.","Category":{"CategoryName":"Stationery"}},{"Price":"12.90","Name":"Sticky Notes WONDERLAND","Description":"Extra curious sticky notes for when you're stuck down a rabbit hole or in a cubicle.\r\nWhen closed, the book measures 3 1/4\" X 4 1/4\" and will fit nicely in your purse or back pocket!","Category":{"CategoryName":"Stationery"}},{"Price":"29.90","Name":"Notebook A5 007 Premium","Description":"A perfect bound \"leather look\" officially liceensed James Bond \r\nnotebook featuring embossed 007 Logo on the cover. The inner pages are \r\nprinted with a custom logo and there is a handy rear storage pocket, a \r\ncoloured ribbon book mark, elasticated woven strap. A perfect gift for \r\nany James Bond fan.","Category":{"CategoryName":"Stationery"}},{"Price":"16.90","Name":"Drumstick Pens","Description":"Make your classes or office a better place. Instead of only doodling in the ends of your papers, you can freely play a drum solo on your desk. Set of 2 pensBlue colorLength: 21,5 cmMaterial: Wood","Category":{"CategoryName":"Stationery"}},{"Price":"34.90","Name":"Waterproof Notebook Brown","Description":"Introducing..... Brown Waterproof Notebook. With a smart brown leather like cover and black rimmed pages this is the new executive version. The notebook measures approx. Dimensions: 15 x 10.5 x 1.5 cm 80 water resistant pages100% waterproof and can be used with any pencilNo rows or prints","Category":{"CategoryName":"Stationery"}},{"Price":"49.90","Name":"World Scratch Map Brown | Luckies","Description":"The Original Scratch Map вЂ“ buy direct from the creators for the highest quality, UK made Scratch Off World Map poster. Avoid poor imitations вЂ“ buy the real deal! Invented in 2009 by Luckies of London, our Scratch Maps have become one of the most popular gifts ever created. Whether itвЂ™s for your jet set sisterвЂ™s birthday, or a well travelled uncle, Scratch Maps look great on everyoneвЂ™s wall! Luckies Scratch Map feature a gold foil top layer which means that once a country has been visited, the intrepid traveller gets to scratch it off to reveal beautifully vibrant details beneath.Scratching off the gold foil also reveals amazing facts about our world. Packaged in a super high quality matte finish tube, Scratch Maps make a truly thoughtful and personal gift; the perfect present for the globe trotter in your life, or maybe the dreamer that always has their next trip in mind.Or keep it for yourself and create the ultimate personal record of your travels by scratching off all your adventures&nbsp;","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Passport UNCONSCIOUS&nbsp;","Description":"Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"7.90","Name":"Notebook Music","Description":"The perfect little notebook for your notations - musical and otherwise. Comes with a handy music instruction chart in the bacРє.Dimensions: 9 cm x 13 cm64 pages","Category":{"CategoryName":"Stationery"}},{"Price":"14.90","Name":"Bottle Pourer RHINO","Description":"If you want the party to be wherever you are, then this is for you! Pourer with rhino head to turn all heads around!Hole: 1,5 cm.Also used for: oil, vinegar, dressings, wine, spirits","Category":{"CategoryName":"Stationery"}},{"Price":"27.90","Name":"Hip flask Mid Century Poppy","Description":"Stainless Steel Hip Flask, containing whole 6 oz of happiness.Material: Stainless steel6 oz.","Category":{"CategoryName":"Stationery"}},{"Price":"27.90","Name":"Hip flask Midnight Garden &nbsp;If you'd like to be drinking your whiskey without anyone recognizing your alcohol, Midnight Garden is just for you!","Description":"Material: stainless steel6 oz.","Category":{"CategoryName":"Stationery"}},{"Price":"24.90","Name":"Cast Iron Stag HookIdeal for sheds, this cast iron hook is in the style of a garden rake.&nbsp;","Description":"Length: 15 cm.","Category":{"CategoryName":"Stationery"}},{"Price":"59.90","Name":"Scratch MapВ® Capitals poster was designed with people who love a good city break in mind! Printed on matte black paper, this world map poster allows you to remove the foil from the countries AND the capital cities that youвЂ™ve visited to reveal an array of vibrant purples, greens, blues and pinks. The perfect travel keepsake, Scratch MapВ® Capitals map also features extra detail about the capital cities of the world meaning you can brush up on your general knowledge before embarking on a weekend away.","Description":"For best results, &nbsp;use an eraser to remove the foil.\r\n\r\nFeatures:\r\nWorld map with removable foil layer.\r\nAdditional detail of the worldвЂ™s capitals.\r\n\r\nMaterials):\r\nPaper, laminate, coloured foil.\r\n\r\nItem Dimensions:\r\nWidth: 82.5 cm\r\nHeight: 0.2 cm\r\nDepth: 59.4 cm\r\n\r\n\r\n\r\nFrame not included.","Category":{"CategoryName":"Stationery"}}]