[{"Price":"22.90","Name":"Pen Sheaffer Santinel Deep Pink NT","Description":"A simple click of a button and...you're ready to write... The Sheaffer Sentinel features a convenient push-button mechanism that allows you to activate the tip of the pen instantly. It's so easy that you can even do it with one hand behind your back. The Sentinel fits into virtually any portfolio or pocket calendar, making it perfect for practical everyday use. Its classic slim profile allows for a pleasurable writing experience. Consider it an excellent gift for the student, professional... or professional student.The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"22.90","Name":"Pen Sheaffer Sentinel Chrome Burgandy","Description":"A simple click of a button and...you're ready to write... The SheafferВ® SentinelВ® features a convenient push-button mechanism that allows you to activate the tip of the pen instantly. The SentinelВ® fits into virtually any portfolio or pocket calendar, making it perfect for practical everyday use. Its classic slim profile allows for a pleasurable writing experience, whether you choose the ballpoint or pencil.Brushed Chrome plate finish featuring nickel plate appointmentsSpecially formulated ink flows flawlessly for a smooth writing experienceIncludes 1 Medium Black Ballpoint Refill installed in pen; extra refills available in additional widths and colorsThe fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"127.90","Name":"Pen Sheaffer Sagaris Fluted Gold","Description":"Fluted Gold Tone Cap and Barrel featuring Gold Tone TrimBallpoint features the Sheaffer White Dot, the symbol of writing excellenceBallpoint offers smooth twist-action for one handed operationIncludes 1 black Sheaffer вЂTвЂ™ ballpoint refillPackaged in a luxury gift boxThe fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"749.90","Name":"Limited Rollerball Pen Cross Townsend R2D2&nbsp;","Description":"Commemorating the original 1977 film, this Townsend Star Warsв„ў writing instrument brings the beloved R2-D2 to life with deep-etched engravings on brushed platinum plate with an embedded smooth-top jet cabochon. Presented in a luxury gift box with an included Star Warsв„ў themed pen stand, this writing instrument is a unique luxury and the perfect gift for any avid Star Warsв„ў fan.&nbsp;Only 1,977 R2-D2 limited-edition pens were produced per technology, each individually serialized.&nbsp;The difference between a rollerball and an ordinary ballpoint pen is that you don't need pressure to write. Now it's possible to write upside down and your pen won't stop writing, doesn't matter of the position.Impeccably engraved character detail enhances collectability and character authenticityPen top features a smooth-top jet cabochon inset reminiscent of R2-D2вЂ™s designPresented in a luxury gift box with a Star Warsв„ў pen standStar Warsв„ў collectorвЂ™s booklet tells the story of this iconic characterIncludes the designerвЂ™s Certificate of Authenticity and a Lifetime Mechanical Guarantee","Category":{"CategoryName":"Writing Tools"}},{"Price":"139.90","Name":"Pen Cross Multi-Functional Black","Description":"An effortless twist transforms this finely-crafted black ballpoint pen, to a red editing pen, to a pencil, and back again. On the other end is a precision stylus to improve accuracy and ease when you interact with your favorite mobile device. However you choose to work and create, Tech3+ delivers on versatility, convenience, and style.Classic design with three writing tips inside: a black ballpoint, red ballpoint and pencilContinuous twist technology for easy tip selectionWide 8MM stylus that also unscrews to reveal an eraserCompatibility with most capacitive touchscreen devicesLifetime mechanical guarantee","Category":{"CategoryName":"Writing Tools"}},{"Price":"69.90","Name":"Rollerball Cross Click Star Wars C3PO","Description":"New Click designs inspired by three movie legends.&nbsp;Our popular Click pen now comes in a special collection honoring the original Star Wars film trilogy. Created with an appreciation for quality craftsmanship and writing finesse, these themed pens feature the color palettes of three major characters, as well as an emblem and design overlays to bring the spirit of each to life. And ClickвЂ™s smooth gel-ink technology lets Star Wars write effortlessly, even at lightspeed.The difference between a rollerball and an ordinary ballpoint pen is that you don't need pressure to write. Now it's possible to write upside down and your pen won't stop writing, doesn't matter of the position.Finishes were inspired by signature colors of Darth Vader, C-3PO, and the StormtroopersHighly polished lacquer adds imperial elegance&nbsp;Each pen features a themed character emblem and design detailsEasy-to-use вЂњclickвЂќ mechanismSmooth-flowing gel ink technology for a superior writing experienceEach pen is showcased in a coordinating character-themed gift box","Category":{"CategoryName":"Writing Tools"}},{"Price":"139.90","Name":"Pen Cross Multi-Function Blue","Description":"An effortless twist transforms this finely-crafted black ballpoint pen, to a red editing pen, to a pencil, and back again. On the other end is a precision stylus to improve accuracy and ease when you interact with your favorite mobile device. However you choose to work and create, Tech3+ delivers on versatility, convenience, and style.Classic design with three writing tips inside: a black ballpoint, red ballpoint and pencilContinuous twist technology for easy tip selectionWide 8MM stylus that also unscrews to reveal an eraserCompatibility with most capacitive touchscreen devicesLifetime mechanical guarantee","Category":{"CategoryName":"Writing Tools"}},{"Price":"189.90","Name":"Pen Cross Century II Medalist","Description":"The Legend Continues.&nbsp;Embracing both tradition and evolutionвЂ”the iconic Cross profile takes a broader point of view.&nbsp;Century II has the style and grace of the Classic Century, but with a bolder look and wider profile. Its signature Cross design, distinctive finishes, and balanced, weighted feel give a sense of purpose to anything you write.Beautiful precious metal and translucent lacquer finishes to choose fromPrecision balanced and weighted for a rich, tactile experiencePresented in a luxury gift boxLifetime Mechanical GuaranteeA tasteful and timeless collaboration of polished chrome and 23 Karat gold-plated appointments","Category":{"CategoryName":"Writing Tools"}},{"Price":"239.90","Name":"Fountain Pen Cross Century II Medalist","Description":"The Legend Continues.&nbsp;Embracing both tradition and evolutionвЂ”the iconic Cross profile takes a broader point of view.&nbsp;Century II has the style and grace of the Classic Century, but with a bolder look and wider profile. Its signature Cross design, distinctive finishes, and balanced, weighted feel give a sense of purpose to anything you write.Beautiful precious metal and translucent lacquer finishes to choose fromPrecision balanced and weighted for a rich, tactile experiencePresented in a luxury gift boxLifetime Mechanical GuaranteeA tasteful and timeless collaboration of polished chrome and 23 Karat gold-plated appointments","Category":{"CategoryName":"Writing Tools"}},{"Price":"189.90","Name":"Pen Cross Century II Black GT","Description":"The Legend Continues.&nbsp;Embracing both tradition and evolutionвЂ”the iconic Cross profile takes a broader point of view.&nbsp;Century II has the style and grace of the Classic Century, but with a bolder look and wider profile. Its signature Cross design, distinctive finishes, and balanced, weighted feel give a sense of purpose to anything you write.Beautiful precious metal and translucent lacquer finishes to choose fromPrecision balanced and weighted for a rich, tactile experiencePresented in a luxury gift boxLifetime Mechanical GuaranteeA multilayered black lacquer finish with 23KT gold-plated appointments","Category":{"CategoryName":"Writing Tools"}},{"Price":"259.90","Name":"Fountain Pen Cross Century II Black GT","Description":"The Legend Continues.&nbsp;Embracing both tradition and evolutionвЂ”the iconic Cross profile takes a broader point of view.&nbsp;Century II has the style and grace of the Classic Century, but with a bolder look and wider profile. Its signature Cross design, distinctive finishes, and balanced, weighted feel give a sense of purpose to anything you write.Beautiful precious metal and translucent lacquer finishes to choose fromPrecision balanced and weighted for a rich, tactile experiencePresented in a luxury gift boxLifetime Mechanical GuaranteeRhodium-plated solid 18KT gold nib adapts to your unique touch","Category":{"CategoryName":"Writing Tools"}},{"Price":"139.90","Name":"Pen Cross Century Medalist","Description":"An icon of American design and innovation. The choice of movers, shakers and ground breakers since 1946.&nbsp;Does form follow function? Or does function drive form? Whatever your point of view, Classic Century delivers. Its sleek profile and patented twist-action barrel sparked a design revolution. Generations later passionate fans remain loyal to the iconic silhouette, while trendsetters appreciate its authenticity. Cool comes full circle.Lifetime mechanical guaranteePremium Gift BoxA winning combination of polished chrome and 23 Karat gold-plated appointmentsSubtle incised line pattern","Category":{"CategoryName":"Writing Tools"}},{"Price":"169.90","Name":"Fountain Pen Cross Century Medalist","Description":"An icon of American design and innovation. The choice of movers, shakers and ground breakers since 1946.&nbsp;Does form follow function? Or does function drive form? Whatever your point of view, Classic Century delivers. Its sleek profile and patented twist-action barrel sparked a design revolution. Generations later passionate fans remain loyal to the iconic silhouette, while trendsetters appreciate its authenticity. Cool comes full circle.Lifetime mechanical guaranteePremium Gift BoxCoolly elegant with a polished sheen and frosty diamond etchingPolished chrome appointmentsMedalist comes with a 23 karat gold plated stainless steel nibSpecially formulated ink flows flawlessly and dries quickly","Category":{"CategoryName":"Writing Tools"}},{"Price":"159.90","Name":"The various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;","Description":"If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Writing Tools"}},{"Price":"179.90","Name":"Fountain Pen Cross Classic GT Black","Description":"An icon of American design and innovation. The choice of movers, shakers and ground breakers since 1946.&nbsp;Does form follow function? Or does function drive form? Whatever your point of view, Classic Century delivers. Its sleek profile and patented twist-action barrel sparked a design revolution. Generations later passionate fans remain loyal to the iconic silhouette, while trendsetters appreciate its authenticity. Cool comes full circle.Includes 2 Slim Black Fountain Pen Cartridges (#8929-1) that are as neat and easy-to-use as a ballpoint or a rollerball refillThreaded cap and barrel designClassic Black comes with a 23 karat gold plated stainless steel nibSpecially formulated ink flows flawlessly and dries quicklySatin black finish and 23 Karat gold-plated appointments makes a definitive statement of styleThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Writing Tools"}},{"Price":"79.90","Name":"Pen Cross Bailey Medalist","Description":"Bailey was designed with an eye for detail. From its multi-grooved chrome center ring with patterned engravings to its sleek, modern clip, it exudes a distinct style thatвЂ™s sure to be noticed.Traditional, well-balanced designDistinctive cap-over-barrel stylingMulti-grooved center ring with deep-cut engraving accentsPatented twist-action propel/repel featureSpecially formulated Cross ink flows flawlessly for a superior writing experienceLifetime mechanical guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Writing Tools"}},{"Price":"109.90","Name":"Fountain Pen Cross Bailey Medalist","Description":"A simple articulation of modern Cross design, this elegant writing instrument features a traditional well-balanced profile in a selection of sophisticated finishes. A multi-grooved center ring with deep-cut engraved accents adds just the right amount of flair.&nbsp;Traditional, well-balanced designDistinctive cap-over-barrel stylingMulti-grooved center ring with deep-cut engraving accentsLifetime guaranteeThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Writing Tools"}},{"Price":"79.90","Name":"Pen Cross Bailey Black","Description":"A simple articulation of modern Cross design, this elegant writing instrument features a traditional well-balanced profile in a selection of sophisticated finishes. A multi-grooved center ring with deep-cut engraved accents adds just the right amount of flair.&nbsp;Traditional, well-balanced designDistinctive cap-over-barrel stylingMulti-grooved center ring with deep-cut engraving accentsThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Writing Tools"}},{"Price":"109.90","Name":"Fountain Pen Cross Bailey Black","Description":"A simple articulation of modern Cross design, this elegant writing instrument features a traditional well-balanced profile in a selection of sophisticated finishes. A multi-grooved center ring with deep-cut engraved accents adds just the right amount of flair.&nbsp;Traditional, well-balanced designDistinctive cap-over-barrel stylingMulti-grooved center ring with deep-cut engraving accentsThe various collections of Cross satisfy even the most eccentric tastes. With over 150 years experience, Cross managed to combine the classic with the \"requirements\" of modern times, by bringing romance and comfort in the daily lives of their owners.&nbsp;If desired, engraving products is completely free and takes just two extra days after purchase.","Category":{"CategoryName":"Writing Tools"}},{"Price":"22.90","Name":"A simple click of a button and...you're ready to write... The Sheaffer Sentinel features a convenient push-button mechanism that allows you to activate the tip of the pen instantly. It's so easy that you can even do it with one hand behind your back. The Sentinel fits into virtually any portfolio or pocket calendar, making it perfect for practical everyday use. Its classic slim profile allows for a pleasurable writing experience. Consider it an excellent gift for the student, professional... or professional student.","Description":"The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"22.90","Name":"Pen Sheaffer Sentinel Chrome Turquoise&nbsp;","Description":"A simple click of a button and...you're ready to write... The Sheaffer Sentinel features a convenient push-button mechanism that allows you to activate the tip of the pen instantly. It's so easy that you can even do it with one hand behind your back. The Sentinel fits into virtually any portfolio or pocket calendar, making it perfect for practical everyday use. Its classic slim profile allows for a pleasurable writing experience. Consider it an excellent gift for the student, professional... or professional student.The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"177.90","Name":"Fountain Pen Sheaffer Sagaris Fluted Gold GT&nbsp;","Description":"The Sheaffer Sagaris Fluted Gold Tone GT Fountain Pen 9474-0 has a fluted gold barrel with gold tone trim. Featuring a smooth polished stainless steel medium nib, the pen takes Sheaffer Skrip ink cartridges.&nbsp;The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"98.90","Name":"Pen Sheaffer Sagaris Glossy Black GT&nbsp;","Description":"The Sheaffer Sagaris Gloss Black GT Ballpoint has a gloss black barrel with gold tone trim. Featuring a twist mechanism, this ballpoint pen takes Sheaffer 'T' ball pen refills. &nbsp;The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"252.90","Name":"Fountain Pen Sheaffer Prelude Palladium&nbsp;","Description":"Sheaffer Prelude fountain pen in a high gloss black lacquer barrel, palladium-plated cap and 22k gold plated trim. Features a specially formed resin grip section and a 2 tone gold plated stainless steel nib. Use with Skrip ink cartridges or a converter for bottled ink (both included). All Prelude models showcase the SheafferВ®&nbsp;White Dot on the top of the clip, a trademark symbol of writing excellence.The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"97.90","Name":"Writing Tool Napkin Prima Millennium Falcon","Description":"Made in Italy.The technique is unique by itself:&nbsp;precise mark like a pencil and an exclusive and elegant design,&nbsp;PRIMA&nbsp;is a writing instrument, that writes with no ink and no refill.&nbsp;Prima is completely hand made in Italy and is designed by Sergio Mori the designer. The body is made in anodized&nbsp;aluminium. This one is even more special - limited Star Wars edition a&nbsp;tribute to Han Solo's famous starship&nbsp;Millennium Falcon.&nbsp;&nbsp;Length&nbsp;-&nbsp;18 cm,&nbsp;Diameter&nbsp;-&nbsp;1cmWeight - 39 gr.Material -&nbsp;Single body in anodized&nbsp;aluminiumEthergraf","Category":{"CategoryName":"Writing Tools"}},{"Price":"69.90","Name":"Rollerball Pen Cross Click Star Wars Darth Vader","Description":"New Click designs inspired by three movie legends.&nbsp;Our popular Click pen now comes in a special collection honoring the original Star Wars film trilogy. Created with an appreciation for quality craftsmanship and writing finesse, these themed pens feature the color palettes of three major characters, as well as an emblem and design overlays to bring the spirit of each to life. And ClickвЂ™s smooth gel-ink technology lets Star Wars write effortlessly, even at lightspeed.The difference between a rollerball and an ordinary ballpoint pen is that you don't need pressure to write. Now it's possible to write upside down and your pen won't stop writing, doesn't matter of the position.\r\n\r\n\r\n\r\nFinishes were inspired by signature colors of Darth Vader, C-3PO, and the Stormtroopers\r\nHighly polished lacquer adds imperial elegance&nbsp;\r\nEach pen features a themed character emblem and design details\r\nEasy-to-use вЂњclickвЂќ mechanism\r\nSmooth-flowing gel ink technology for a superior writing experience\r\nEach pen is showcased in a coordinating character-themed gift box","Category":{"CategoryName":"Writing Tools"}},{"Price":"79.90","Name":"Pen Sheaffer Sagaris Brushed Chrome CT&nbsp;","Description":"Inspired by long-time favorite, SheafferВ® TriumphВ®, SheafferВ® Sagaris is light-weight, slim, and fits comfortably in the palm of your hand. It has a distinguished profile characterized by a tapered cap and barrel, and carries the world-renowned \"White DotВ®\" symbol of quality.The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"22.90","Name":"Pen Sheaffer Sentinel Chrome Green","Description":"A simple click of a button and...you're ready to write... The Sheaffer Sentinel features a convenient push-button mechanism that allows you to activate the tip of the pen instantly. It's so easy that you can even do it with one hand behind your back. The Sentinel fits into virtually any portfolio or pocket calendar, making it perfect for practical everyday use. Its classic slim profile allows for a pleasurable writing experience. Consider it an excellent gift for the student, professional... or professional student.The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}},{"Price":"73.90","Name":"Fountain Pen Sheaffer 300 Collection Glossy Black&nbsp;","Description":"Sheaffer 300 fountain pen in a glossy black lacquer with gold trim. The Sheaffer 300 series features a cigar-shaped profile that is balanced and comfortable to hold. Sheaffer stainless steel nib. Use with Sheaffer Skrip ink cartridges or a converter for bottled ink (cartridge and converter are both included.) All 300 models showcase the Sheaffer signature wide band and the SheafferВ®&nbsp;White Dot on the top of the clip, a trademark symbol of writing excellence. The fine writing tools of Sheaffer are sold only at three places in Bulgaria and Elephant Bookstore has the pleasure to be one of them. If desired, engraving is for free and takes just two extra days after the purchase.&nbsp;All of the writing tools are sold with blue and an extra black filler.&nbsp;","Category":{"CategoryName":"Writing Tools"}}]